---
url: https://developer.rhino3d.com/api/RhinoCommon
scraped_at: 2025-09-08T15:50:37.623402
title: Namespaces
---

# Namespaces

**Rhino**

Contains commonly-used value types and classes used in Rhino.

**Rhino.ApplicationSettings**

Static settings global to the entire Rhino application

**Rhino.Collections**

**Rhino.Commands**

**Rhino.Display**

**Rhino.DocObjects**

The DocObjects namespace contains types that correspond to geometry that is
found in a document. Generally, these types reference an attribute and have a
distinctive ID.

**Rhino.DocObjects.Custom**

**Rhino.DocObjects.SnapShots**

**Rhino.DocObjects.Tables**

**Rhino.FileIO**

**Rhino.Geometry**

The Geometry namespace contains geometric types used in Rhino. Examples are
lines, curves, meshes and boundary representations.

**Rhino.Geometry.Collections**

**Rhino.Geometry.Intersect**

**Rhino.Geometry.MeshRefinements**

**Rhino.Geometry.Morphs**

**Rhino.Input**

Classes related to getting user input for things like points, objects, and
numbers

**Rhino.Input.Custom**

**Rhino.NodeInCode**

**Rhino.ObjectManager**

**Rhino.PlugIns**

**Rhino.Render**

**Rhino.Render.ChangeQueue**

**Rhino.Render.ChildSlotNames**

**Rhino.Render.CustomRenderMeshes**

**Rhino.Render.DataSources**

**Rhino.Render.Fields**

**Rhino.Render.ParameterNames**

**Rhino.Render.PostEffects**

**Rhino.Render.UI**

**Rhino.Runtime**

**Rhino.Runtime.InProcess**

**Rhino.Runtime.InteropWrappers**

**Rhino.Runtime.Notifications**

**Rhino.Runtime.RhinoAccounts**

**Rhino.UI**

**Rhino.UI.Controls**

**Rhino.UI.Controls.DataSource**

**Rhino.UI.Controls.ThumbnailUI**

**Rhino.UI.Controls.Thumbnaillist**

**Rhino.UI.Gumball**

**dotnetstart**