---
url: https://developer.rhino3d.com/api/grasshopper/html/99cd32c8-7c1f-4f9a-87ea-76b032de7f70.htm
scraped_at: 2025-09-08T16:10:28.777032
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Examples

[Visual Basic .NET](../html/b883d0c0-4947-48bc-8e9e-492a6d6c2a06.htm "Visual
Basic .NET")

[Simple Component (VB)](../html/b883d0c0-4947-48bc-8e9e-492a6d6c2a06.htm
"Simple Component \(VB\)")

[Simple Mathematics (VB)](../html/2824c770-2673-49a3-8683-1a70bc0349cc.htm
"Simple Mathematics \(VB\)")

[Simple Geometry (VB)](../html/4306b177-1bf1-41bc-ac0e-2f6869d02365.htm
"Simple Geometry \(VB\)")

[Simple Data Types (VB)](../html/f9aa207f-3d19-414c-af01-1e5ad42a8cab.htm
"Simple Data Types \(VB\)")

[Simple Parameters (VB)](../html/0edd8dc9-32a7-40aa-b217-8e01e35e58bc.htm
"Simple Parameters \(VB\)")

[List Component (VB)](../html/4db493ec-0bb3-4b73-943a-fdff03863e1d.htm "List
Component \(VB\)")

[Extending the GUI (VB)](../html/99cd32c8-7c1f-4f9a-87ea-76b032de7f70.htm
"Extending the GUI \(VB\)")

[Custom Attributes (VB)](../html/ad6e93fe-e1c8-451e-a6d0-77cb8dd4516d.htm
"Custom Attributes \(VB\)")

[Custom Component Options
(VB)](../html/434018c0-6110-4478-bf2a-dcd099d8b8b2.htm "Custom Component
Options \(VB\)")

!Click or drag to
resize

# Extending the GUI (VB)

---

  * Introduction
  * Default Functionality and GUI
  * Menus
  * Interaction
  * Display

This article describes how to extend the default behaviour, functionality and
graphical user interface (GUI) of Grasshopper document objects. We'll focus on
components as you should be familiar with those from earlier topics, but the
same logic also applies to Parameters and custom objects.

Default Functionality and GUI

When you derive a class from
GH_Component or
GH_ParamT you get a lot of
functionality and GUI for free. It is quite important that all the objects in
Grasshopper behave in a consistent and predictable fashion so you typically
don't need to override this default behaviour. However there can be cases
where changing the default Grasshopper GUI is the best solution. Overriding
the GUI is not exactly a trivial task, there are a lot of different facets to
this and I'll discuss the most important ones in this topic.

There are three common ways in which the default GUI can be altered:

  * Menus
  * Interaction
  * Display

Menus

It is possibe to insert items into the default pop-up menus of objects, or
even to completely alter the menu layout. If your component for example can
run in two different modes, you can choose to expose an additional GUI option
instead of an input parameter. These modes can then be toggled via the
component pop-up menu.

At the lowest level, pop-up menus are generated by the canvas when a right
mouse button click is detected over a component or parameter. The menu by
default contains no items and it is the responsibility of said component or
parameter to populate the menu. The top-level method which is in charge of
this is
AppendMenuItems
which is defined inside IGH_DocumentObject and thus propagates to all objects
on the canvas.

The GH_DocumentObject abstract class does not create any menu items, so unless
this function is overridden, there will be no popup menu for a certain object.
However, it is unlikely you derive directly from GH_DocumentObject so this
should not be a problem. GH_ActiveObject, which is the base class for all
objects on the canvas that actually do something (Sketches and Scribbles don't
"do" anything, hence they derive directly from GH_DocumentObject), does
provide a default implementation of AppendMenuItems(). The default layout of
popup menus is:

  * NickName

  * Preview

  * Enabled

  * Bake

  * Warnings

  * Errors

  * Help

Although if the object in question does not support previews or baking then
those items will be missing from the final menu. When overridden,
AppendMenuItems() allows you to completely replace the default menu:

VB

Copy

    Public Overrides Function AppendMenuItems(ByVal menu As ToolStripDropDown) As Boolean
      Menu_AppendGenericMenuItem(menu, "First item")
      Menu_AppendGenericMenuItem(menu, "Second item")
      Menu_AppendGenericMenuItem(menu, "Third item")
      Menu_AppendSeparator(menu)
      Menu_AppendGenericMenuItem(menu, "Fourth item")
      Menu_AppendGenericMenuItem(menu, "Fifth item")
      Menu_AppendGenericMenuItem(menu, "Sixth item")

      'Return True, otherwise the menu won't be shown.
      Return True
    End Function

If you want to insert additional items into the menu it would be very annoying
if you had to recreate this default menu layout from scratch every single
time. So eventhough you can override AppendMenuItems() it is recommended you
instead override AppendAdditionalMenuItems() which allows you to insert custom
menu items between Errors and Help without losing the standard functionality:

VB

Copy

    Public Overrides Sub AppendAdditionalMenuItems(ByVal menu As ToolStripDropDown)
      MyBase.AppendAdditionalMenuItems(menu)

      Menu_AppendGenericMenuItem(menu, "First item")
      Menu_AppendGenericMenuItem(menu, "Second item")
      Menu_AppendGenericMenuItem(menu, "Third item")
      Menu_AppendSeparator(menu)
      Menu_AppendGenericMenuItem(menu, "Fourth item")
      Menu_AppendGenericMenuItem(menu, "Fifth item")
      Menu_AppendGenericMenuItem(menu, "Sixth item")
    End Sub

GH_Param(Of T) for example derives from GH_ActiveObject and re-implements
AppendAdditionalMenuItems() in order to supply the Wire Display, Disconnect,
Reverse, Flatten and Graft menu items that are present in all parameters.
GH_Component, likewise, derives from GH_ActiveObject and it re-implements
AppendAdditionalMenuItems() in order to insert the Shortest List, Longest
List, Cross Reference and the parameter submenus.

Long story short; if you wish to insert additional menu items then either re-
implement AppendAdditionalMenuItems() if you derive from GH_Param(Of T) or re-
implement AppendAdditionalComponentMenuItems() if you derive from
GH_Component:

VB

Copy

    'If you implement IGH_Param, then override this method. If you implement IGH_Component,
    'then override AppendAdditionalComponentMenuItems instead.
    Protected Overrides Sub AppendAdditionalMenuItems(ByVal menu As ToolstripDropDown)
      'Place a call to the base class to ensure the default parameter menu
      'is still there and operational.
      MyBase.AppendAdditinalMenuItems(menu)

      'Now insert your own custom menu items.
      Menu_AppendGenericMenuItem(menu, "My Custom Menu Item", Addressof Menu_MyCustomItemClicked)
    End Sub

    Private Sub Menu_MyCustomItemClicked(ByVal sender As Object, ByVal e As EventArgs)
      Rhino.RhinoApp.WriteLine("Alcohol doesn't affect me...")
    End Sub

There's a lot of menu utility functions provided by GH_DocumentObject. They
all start with "Menu_" and they'll make it much easier to insert formatted
menu items. But of course nothing is stopping you from using typical
System.Windows.Forms plumbing to extend the pop-up menu.

Interaction

You can also choose to handle specific mouse and keyboard events. You could
for example choose to respond to a mouse double-click event on your component.
Complicated objects such as Gradients and Graph Mappers handle all sorts of
mouse events to provide grip-dragging functionality directly within the
Grasshopper canvas. todo: finish this section

Display

Finally, it is possible to override the way an object displays itself on the
canvas. These alterations can be minor, mere additions to the default display,
or they can be radically different (as with the Gradient and Graph Mapper
objects). For a detailed explanation regarding display overrides, see the
Custom Attributes topic.

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com