---
url: https://developer.rhino3d.com/api/grasshopper/html/d113a9f0-6e27-46df-8316-2079c44382ac.htm#!
scraped_at: 2025-09-08T16:10:13.688637
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Examples

[Visual Basic .NET](../html/b883d0c0-4947-48bc-8e9e-492a6d6c2a06.htm "Visual
Basic .NET")

C#

!Click or drag to
resize

# Examples

---

This section of the Grasshopper SDK Documentation features code examples for
typical 3rd party development.

Components

My First Component (VB,
C#)

Simple Mathematics (VB,
C#)

Simple Geometry (VB,
C#)

Advanced Geometry (VB, C#)

Reading and Writing Lists (VB,
C#)

Reading and Writing Trees (VB, C#)

Custom Component Options (VB,
C#)

Variable Parameters (VB, C#)

Custom Previews (VB, C#)

Parameters and Data

Simple Parameters (VB,
C#)

Simple Data Types (VB,
C#)

GUI

Extending the GUI (VB,
C#)

Custom Attributes (VB,
C#)

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com