---
url: https://developer.rhino3d.com/api/grasshopper/html/d5ac95cc-3592-49a7-9162-d1bd981fb6c5.htm#!
scraped_at: 2025-09-08T16:24:57.469420
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Development

[GHA Assembly Wizards](../html/d5ac95cc-3592-49a7-9162-d1bd981fb6c5.htm "GHA
Assembly Wizards")

[Assembly Hierarchy](../html/bc188193-19ff-4ae5-a3ed-2e78c34a306e.htm
"Assembly Hierarchy")

[Project Setup (VB.NET)](../html/99f64b89-5975-4ebe-adc6-24da038e915f.htm
"Project Setup \(VB.NET\)")

[Project Setup (C#)](../html/f00ac74b-492c-44fe-8da3-b28265dc820f.htm "Project
Setup \(C#\)")

[Project Setup (VS.Express)](../html/71bed5cf-25c6-4d89-b50a-cff22efbda62.htm
"Project Setup \(VS.Express\)")

!Click or drag to
resize

# GHA Assembly Wizards

---

Giulio Piacentino has written an excellent assembly wizard for GHA projects
which is hosted on the Microsoft Visual Studio
Gallery.
This wizard requires Visual Studio 2010, but is a far superior way to create a
GHA project than following the manual steps outlined below.

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com