---
url: https://developer.rhino3d.com/api/grasshopper/html/N_Grasshopper_Kernel.htm#!
scraped_at: 2025-09-08T16:15:16.033119
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_ActiveObject Class](../html/T_Grasshopper_Kernel_GH_ActiveObject.htm
"GH_ActiveObject Class")

GH_Alias Class

[GH_Arrange Enumeration](../html/T_Grasshopper_Kernel_GH_Arrange.htm
"GH_Arrange Enumeration")

[GH_AssemblyFolderInfo
Structure](../html/T_Grasshopper_Kernel_GH_AssemblyFolderInfo.htm
"GH_AssemblyFolderInfo Structure")

[GH_AssemblyInfo Class](../html/T_Grasshopper_Kernel_GH_AssemblyInfo.htm
"GH_AssemblyInfo Class")

[GH_AssemblyInfoStub
Class](../html/T_Grasshopper_Kernel_GH_AssemblyInfoStub.htm
"GH_AssemblyInfoStub Class")

[GH_AssemblyPriority
Class](../html/T_Grasshopper_Kernel_GH_AssemblyPriority.htm
"GH_AssemblyPriority Class")

[GH_Attributes(T) Class](../html/T_Grasshopper_Kernel_GH_Attributes_1.htm
"GH_Attributes\(T\) Class")

[GH_AttributesChangedEventArgs
Class](../html/T_Grasshopper_Kernel_GH_AttributesChangedEventArgs.htm
"GH_AttributesChangedEventArgs Class")

[GH_Author Class](../html/T_Grasshopper_Kernel_GH_Author.htm "GH_Author
Class")

[GH_AutoSaveSettings
Class](../html/T_Grasshopper_Kernel_GH_AutoSaveSettings.htm
"GH_AutoSaveSettings Class")

[GH_AutoSaveSettings.AutoSaveFileFormatChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_AutoSaveSettings_AutoSaveFileFormatChangedEventHandler.htm
"GH_AutoSaveSettings.AutoSaveFileFormatChangedEventHandler Delegate")

[GH_AutoSaveSettings.EnableAutoSaveChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_AutoSaveSettings_EnableAutoSaveChangedEventHandler.htm
"GH_AutoSaveSettings.EnableAutoSaveChangedEventHandler Delegate")

[GH_AutoSaveSettings.SaveOnDataFlatteningChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_AutoSaveSettings_SaveOnDataFlatteningChangedEventHandler.htm
"GH_AutoSaveSettings.SaveOnDataFlatteningChangedEventHandler Delegate")

[GH_AutoSaveSettings.SaveOnDocumentUnloadChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_AutoSaveSettings_SaveOnDocumentUnloadChangedEventHandler.htm
"GH_AutoSaveSettings.SaveOnDocumentUnloadChangedEventHandler Delegate")

[GH_AutoSaveSettings.SaveOnObjectAddedChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_AutoSaveSettings_SaveOnObjectAddedChangedEventHandler.htm
"GH_AutoSaveSettings.SaveOnObjectAddedChangedEventHandler Delegate")

[GH_AutoSaveSettings.SaveOnObjectChangeChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_AutoSaveSettings_SaveOnObjectChangeChangedEventHandler.htm
"GH_AutoSaveSettings.SaveOnObjectChangeChangedEventHandler Delegate")

[GH_AutoSaveSettings.SaveOnObjectRemovedChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_AutoSaveSettings_SaveOnObjectRemovedChangedEventHandler.htm
"GH_AutoSaveSettings.SaveOnObjectRemovedChangedEventHandler Delegate")

[GH_AutoSaveSettings.SaveOnWireEventChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_AutoSaveSettings_SaveOnWireEventChangedEventHandler.htm
"GH_AutoSaveSettings.SaveOnWireEventChangedEventHandler Delegate")

[GH_AutoSaveTrigger
Enumeration](../html/T_Grasshopper_Kernel_GH_AutoSaveTrigger.htm
"GH_AutoSaveTrigger Enumeration")

[GH_BakeUtility Class](../html/T_Grasshopper_Kernel_GH_BakeUtility.htm
"GH_BakeUtility Class")

[GH_BitmapChannel
Enumeration](../html/T_Grasshopper_Kernel_GH_BitmapChannel.htm
"GH_BitmapChannel Enumeration")

[GH_CharPatternParamNameConstructor
Class](../html/T_Grasshopper_Kernel_GH_CharPatternParamNameConstructor.htm
"GH_CharPatternParamNameConstructor Class")

[GH_ClipboardType
Enumeration](../html/T_Grasshopper_Kernel_GH_ClipboardType.htm
"GH_ClipboardType Enumeration")

[GH_Component Class](../html/T_Grasshopper_Kernel_GH_Component.htm
"GH_Component Class")

[GH_Component.GH_InputParamManager
Class](../html/T_Grasshopper_Kernel_GH_Component_GH_InputParamManager.htm
"GH_Component.GH_InputParamManager Class")

[GH_Component.GH_OutputParamManager
Class](../html/T_Grasshopper_Kernel_GH_Component_GH_OutputParamManager.htm
"GH_Component.GH_OutputParamManager Class")

[GH_ComponentPaletteStyle
Enumeration](../html/T_Grasshopper_Kernel_GH_ComponentPaletteStyle.htm
"GH_ComponentPaletteStyle Enumeration")

[GH_ComponentParamServer
Class](../html/T_Grasshopper_Kernel_GH_ComponentParamServer.htm
"GH_ComponentParamServer Class")

[GH_ComponentParamServer.IGH_SyncObject
Interface](../html/T_Grasshopper_Kernel_GH_ComponentParamServer_IGH_SyncObject.htm
"GH_ComponentParamServer.IGH_SyncObject Interface")

[GH_ComponentParamServer.NullParamAttributes
Class](../html/T_Grasshopper_Kernel_GH_ComponentParamServer_NullParamAttributes.htm
"GH_ComponentParamServer.NullParamAttributes Class")

[GH_ComponentParamServer.ParameterChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_ComponentParamServer_ParameterChangedEventHandler.htm
"GH_ComponentParamServer.ParameterChangedEventHandler Delegate")

[GH_ComponentParamServer.ParameterNickNameChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_ComponentParamServer_ParameterNickNameChangedEventHandler.htm
"GH_ComponentParamServer.ParameterNickNameChangedEventHandler Delegate")

[GH_ComponentParamServer.ParameterSourcesChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_ComponentParamServer_ParameterSourcesChangedEventHandler.htm
"GH_ComponentParamServer.ParameterSourcesChangedEventHandler Delegate")

[GH_ComponentServer Class](../html/T_Grasshopper_Kernel_GH_ComponentServer.htm
"GH_ComponentServer Class")

[GH_ComponentServer.GHAFileLoadedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_ComponentServer_GHAFileLoadedEventHandler.htm
"GH_ComponentServer.GHAFileLoadedEventHandler Delegate")

[GH_ConnectivityDiagram
Class](../html/T_Grasshopper_Kernel_GH_ConnectivityDiagram.htm
"GH_ConnectivityDiagram Class")

[GH_ConnectivityDisparity
Class](../html/T_Grasshopper_Kernel_GH_ConnectivityDisparity.htm
"GH_ConnectivityDisparity Class")

[GH_ConnectivityNode
Class](../html/T_Grasshopper_Kernel_GH_ConnectivityNode.htm
"GH_ConnectivityNode Class")

[GH_Conversion Enumeration](../html/T_Grasshopper_Kernel_GH_Conversion.htm
"GH_Conversion Enumeration")

[GH_Convert Class](../html/T_Grasshopper_Kernel_GH_Convert.htm "GH_Convert
Class")

[GH_CustomEventServer
Class](../html/T_Grasshopper_Kernel_GH_CustomEventServer.htm
"GH_CustomEventServer Class")

[GH_DataComparison
Enumeration](../html/T_Grasshopper_Kernel_GH_DataComparison.htm
"GH_DataComparison Enumeration")

[GH_DataMapping Enumeration](../html/T_Grasshopper_Kernel_GH_DataMapping.htm
"GH_DataMapping Enumeration")

[GH_DebugDescriptionWriter
Class](../html/T_Grasshopper_Kernel_GH_DebugDescriptionWriter.htm
"GH_DebugDescriptionWriter Class")

[GH_DisplayExpiredEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DisplayExpiredEventArgs.htm
"GH_DisplayExpiredEventArgs Class")

[GH_DocContextEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DocContextEventArgs.htm
"GH_DocContextEventArgs Class")

[GH_DocEnabledEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DocEnabledEventArgs.htm
"GH_DocEnabledEventArgs Class")

[GH_DocFilePathEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DocFilePathEventArgs.htm
"GH_DocFilePathEventArgs Class")

[GH_DocModifiedEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DocModifiedEventArgs.htm
"GH_DocModifiedEventArgs Class")

[GH_DocObjectEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DocObjectEventArgs.htm
"GH_DocObjectEventArgs Class")

[GH_DocSettingsEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DocSettingsEventArgs.htm
"GH_DocSettingsEventArgs Class")

[GH_Document Class](../html/T_Grasshopper_Kernel_GH_Document.htm "GH_Document
Class")

[GH_Document.ContextChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_ContextChangedEventHandler.htm
"GH_Document.ContextChangedEventHandler Delegate")

[GH_Document.DefaultPreviewColourChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_DefaultPreviewColourChangedEventHandler.htm
"GH_Document.DefaultPreviewColourChangedEventHandler Delegate")

[GH_Document.DefaultSelectedPreviewColourChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_DefaultSelectedPreviewColourChangedEventHandler.htm
"GH_Document.DefaultSelectedPreviewColourChangedEventHandler Delegate")

[GH_Document.EnabledChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_EnabledChangedEventHandler.htm
"GH_Document.EnabledChangedEventHandler Delegate")

[GH_Document.EnableSolutionsChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_EnableSolutionsChangedEventHandler.htm
"GH_Document.EnableSolutionsChangedEventHandler Delegate")

[GH_Document.FilePathChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_FilePathChangedEventHandler.htm
"GH_Document.FilePathChangedEventHandler Delegate")

[GH_Document.GH_ActiveObjectFilter
Delegate](../html/T_Grasshopper_Kernel_GH_Document_GH_ActiveObjectFilter.htm
"GH_Document.GH_ActiveObjectFilter Delegate")

[GH_Document.GH_ScheduleDelegate
Delegate](../html/T_Grasshopper_Kernel_GH_Document_GH_ScheduleDelegate.htm
"GH_Document.GH_ScheduleDelegate Delegate")

[GH_Document.ModifiedChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_ModifiedChangedEventHandler.htm
"GH_Document.ModifiedChangedEventHandler Delegate")

[GH_Document.ObjectsAddedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_ObjectsAddedEventHandler.htm
"GH_Document.ObjectsAddedEventHandler Delegate")

[GH_Document.ObjectsDeletedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_ObjectsDeletedEventHandler.htm
"GH_Document.ObjectsDeletedEventHandler Delegate")

[GH_Document.SettingsChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_SettingsChangedEventHandler.htm
"GH_Document.SettingsChangedEventHandler Delegate")

[GH_Document.SolutionEndEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_SolutionEndEventHandler.htm
"GH_Document.SolutionEndEventHandler Delegate")

[GH_Document.SolutionStartEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_SolutionStartEventHandler.htm
"GH_Document.SolutionStartEventHandler Delegate")

[GH_Document.UndoStateChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_Document_UndoStateChangedEventHandler.htm
"GH_Document.UndoStateChangedEventHandler Delegate")

[GH_DocumentAssociations
Class](../html/T_Grasshopper_Kernel_GH_DocumentAssociations.htm
"GH_DocumentAssociations Class")

[GH_DocumentContext
Enumeration](../html/T_Grasshopper_Kernel_GH_DocumentContext.htm
"GH_DocumentContext Enumeration")

[GH_DocumentEventServer
Class](../html/T_Grasshopper_Kernel_GH_DocumentEventServer.htm
"GH_DocumentEventServer Class")

[GH_DocumentIO Class](../html/T_Grasshopper_Kernel_GH_DocumentIO.htm
"GH_DocumentIO Class")

[GH_DocumentObject Class](../html/T_Grasshopper_Kernel_GH_DocumentObject.htm
"GH_DocumentObject Class")

[GH_DocumentObject.ColourEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_DocumentObject_ColourEventHandler.htm
"GH_DocumentObject.ColourEventHandler Delegate")

[GH_DocumentRank Enumeration](../html/T_Grasshopper_Kernel_GH_DocumentRank.htm
"GH_DocumentRank Enumeration")

[GH_DocumentServer Class](../html/T_Grasshopper_Kernel_GH_DocumentServer.htm
"GH_DocumentServer Class")

[GH_DocumentServer.DocumentAddedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_DocumentServer_DocumentAddedEventHandler.htm
"GH_DocumentServer.DocumentAddedEventHandler Delegate")

[GH_DocumentServer.DocumentRemovedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_DocumentServer_DocumentRemovedEventHandler.htm
"GH_DocumentServer.DocumentRemovedEventHandler Delegate")

[GH_DocumentSettings
Enumeration](../html/T_Grasshopper_Kernel_GH_DocumentSettings.htm
"GH_DocumentSettings Enumeration")

[GH_DocumentTree Class](../html/T_Grasshopper_Kernel_GH_DocumentTree.htm
"GH_DocumentTree Class")

[GH_DocumentTreeNode
Class](../html/T_Grasshopper_Kernel_GH_DocumentTreeNode.htm
"GH_DocumentTreeNode Class")

[GH_DocUndoEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DocUndoEventArgs.htm
"GH_DocUndoEventArgs Class")

[GH_Exposure Enumeration](../html/T_Grasshopper_Kernel_GH_Exposure.htm
"GH_Exposure Enumeration")

[GH_ExternalFile Class](../html/T_Grasshopper_Kernel_GH_ExternalFile.htm
"GH_ExternalFile Class")

[GH_ExternalFileType
Enumeration](../html/T_Grasshopper_Kernel_GH_ExternalFileType.htm
"GH_ExternalFileType Enumeration")

[GH_FileSystemEventServer
Class](../html/T_Grasshopper_Kernel_GH_FileSystemEventServer.htm
"GH_FileSystemEventServer Class")

[GH_FileSystemEventServer.FileEvent
Delegate](../html/T_Grasshopper_Kernel_GH_FileSystemEventServer_FileEvent.htm
"GH_FileSystemEventServer.FileEvent Delegate")

[GH_FileWatcher Class](../html/T_Grasshopper_Kernel_GH_FileWatcher.htm
"GH_FileWatcher Class")

[GH_FileWatcher.FileChanged
Delegate](../html/T_Grasshopper_Kernel_GH_FileWatcher_FileChanged.htm
"GH_FileWatcher.FileChanged Delegate")

[GH_FileWatcher.FileChangedSimple
Delegate](../html/T_Grasshopper_Kernel_GH_FileWatcher_FileChangedSimple.htm
"GH_FileWatcher.FileChangedSimple Delegate")

[GH_FileWatcherEvents
Enumeration](../html/T_Grasshopper_Kernel_GH_FileWatcherEvents.htm
"GH_FileWatcherEvents Enumeration")

[GH_Filter Enumeration](../html/T_Grasshopper_Kernel_GH_Filter.htm "GH_Filter
Enumeration")

[GH_FontServer Class](../html/T_Grasshopper_Kernel_GH_FontServer.htm
"GH_FontServer Class")

[GH_FontServer.ConsoleFamilyChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_FontServer_ConsoleFamilyChangedEventHandler.htm
"GH_FontServer.ConsoleFamilyChangedEventHandler Delegate")

[GH_FontServer.ScriptFamilyChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_FontServer_ScriptFamilyChangedEventHandler.htm
"GH_FontServer.ScriptFamilyChangedEventHandler Delegate")

[GH_FontServer.StandardFamilyChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_GH_FontServer_StandardFamilyChangedEventHandler.htm
"GH_FontServer.StandardFamilyChangedEventHandler Delegate")

[GH_Format Class](../html/T_Grasshopper_Kernel_GH_Format.htm "GH_Format
Class")

[GH_GetterResult Enumeration](../html/T_Grasshopper_Kernel_GH_GetterResult.htm
"GH_GetterResult Enumeration")

[GH_GHALoadingEventArgs
Class](../html/T_Grasshopper_Kernel_GH_GHALoadingEventArgs.htm
"GH_GHALoadingEventArgs Class")

[GH_GHXHarvester Class](../html/T_Grasshopper_Kernel_GH_GHXHarvester.htm
"GH_GHXHarvester Class")

[GH_GuidConflictSolution
Enumeration](../html/T_Grasshopper_Kernel_GH_GuidConflictSolution.htm
"GH_GuidConflictSolution Enumeration")

[GH_IconDisplayMode
Enumeration](../html/T_Grasshopper_Kernel_GH_IconDisplayMode.htm
"GH_IconDisplayMode Enumeration")

[GH_InstanceDescription
Class](../html/T_Grasshopper_Kernel_GH_InstanceDescription.htm
"GH_InstanceDescription Class")

[GH_LibraryLicense
Enumeration](../html/T_Grasshopper_Kernel_GH_LibraryLicense.htm
"GH_LibraryLicense Enumeration")

[GH_LineParser Class](../html/T_Grasshopper_Kernel_GH_LineParser.htm
"GH_LineParser Class")

[GH_LineParserAction
Enumeration](../html/T_Grasshopper_Kernel_GH_LineParserAction.htm
"GH_LineParserAction Enumeration")

[GH_ListUtil Class](../html/T_Grasshopper_Kernel_GH_ListUtil.htm "GH_ListUtil
Class")

[GH_LoadingAttribute
Class](../html/T_Grasshopper_Kernel_GH_LoadingAttribute.htm
"GH_LoadingAttribute Class")

[GH_LoadingDemand
Enumeration](../html/T_Grasshopper_Kernel_GH_LoadingDemand.htm
"GH_LoadingDemand Enumeration")

[GH_LoadingInstruction
Enumeration](../html/T_Grasshopper_Kernel_GH_LoadingInstruction.htm
"GH_LoadingInstruction Enumeration")

[GH_LoadingMechanism
Enumeration](../html/T_Grasshopper_Kernel_GH_LoadingMechanism.htm
"GH_LoadingMechanism Enumeration")

[GH_MatchLevel Enumeration](../html/T_Grasshopper_Kernel_GH_MatchLevel.htm
"GH_MatchLevel Enumeration")

[GH_MatchWeight Enumeration](../html/T_Grasshopper_Kernel_GH_MatchWeight.htm
"GH_MatchWeight Enumeration")

[GH_MemoryBitmap Class](../html/T_Grasshopper_Kernel_GH_MemoryBitmap.htm
"GH_MemoryBitmap Class")

[GH_ObjectChangedEventArgs
Class](../html/T_Grasshopper_Kernel_GH_ObjectChangedEventArgs.htm
"GH_ObjectChangedEventArgs Class")

[GH_ObjectEventType
Enumeration](../html/T_Grasshopper_Kernel_GH_ObjectEventType.htm
"GH_ObjectEventType Enumeration")

[GH_ObjectSpecies
Enumeration](../html/T_Grasshopper_Kernel_GH_ObjectSpecies.htm
"GH_ObjectSpecies Enumeration")

[GH_ObjectType Enumeration](../html/T_Grasshopper_Kernel_GH_ObjectType.htm
"GH_ObjectType Enumeration")

[GH_Param(T) Class](../html/T_Grasshopper_Kernel_GH_Param_1.htm "GH_Param\(T\)
Class")

[GH_ParamAccess Enumeration](../html/T_Grasshopper_Kernel_GH_ParamAccess.htm
"GH_ParamAccess Enumeration")

[GH_ParamData Enumeration](../html/T_Grasshopper_Kernel_GH_ParamData.htm
"GH_ParamData Enumeration")

[GH_ParameterContext
Class](../html/T_Grasshopper_Kernel_GH_ParameterContext.htm
"GH_ParameterContext Class")

[GH_ParameterSide
Enumeration](../html/T_Grasshopper_Kernel_GH_ParameterSide.htm
"GH_ParameterSide Enumeration")

[GH_ParamHashFields
Enumeration](../html/T_Grasshopper_Kernel_GH_ParamHashFields.htm
"GH_ParamHashFields Enumeration")

[GH_ParamKind Enumeration](../html/T_Grasshopper_Kernel_GH_ParamKind.htm
"GH_ParamKind Enumeration")

[GH_ParamServerEventArgs
Class](../html/T_Grasshopper_Kernel_GH_ParamServerEventArgs.htm
"GH_ParamServerEventArgs Class")

[GH_ParamWireDisplay
Enumeration](../html/T_Grasshopper_Kernel_GH_ParamWireDisplay.htm
"GH_ParamWireDisplay Enumeration")

[GH_PatternMatching Class](../html/T_Grasshopper_Kernel_GH_PatternMatching.htm
"GH_PatternMatching Class")

[GH_PatternMatching.MatchingMode
Enumeration](../html/T_Grasshopper_Kernel_GH_PatternMatching_MatchingMode.htm
"GH_PatternMatching.MatchingMode Enumeration")

[GH_PersistentGeometryParam(T)
Class](../html/T_Grasshopper_Kernel_GH_PersistentGeometryParam_1.htm
"GH_PersistentGeometryParam\(T\) Class")

[GH_PersistentParam(T)
Class](../html/T_Grasshopper_Kernel_GH_PersistentParam_1.htm
"GH_PersistentParam\(T\) Class")

[GH_PersistentReferenceParam(T)
Class](../html/T_Grasshopper_Kernel_GH_PersistentReferenceParam_1.htm
"GH_PersistentReferenceParam\(T\) Class")

[GH_PickBox Enumeration](../html/T_Grasshopper_Kernel_GH_PickBox.htm
"GH_PickBox Enumeration")

[GH_PingDocumentEventArgs
Class](../html/T_Grasshopper_Kernel_GH_PingDocumentEventArgs.htm
"GH_PingDocumentEventArgs Class")

[GH_PluginFolderType
Enumeration](../html/T_Grasshopper_Kernel_GH_PluginFolderType.htm
"GH_PluginFolderType Enumeration")

[GH_PreviewArgs Class](../html/T_Grasshopper_Kernel_GH_PreviewArgs.htm
"GH_PreviewArgs Class")

[GH_PreviewBoundary Class](../html/T_Grasshopper_Kernel_GH_PreviewBoundary.htm
"GH_PreviewBoundary Class")

[GH_PreviewExpiredEventArgs
Class](../html/T_Grasshopper_Kernel_GH_PreviewExpiredEventArgs.htm
"GH_PreviewExpiredEventArgs Class")

[GH_PreviewFilter
Enumeration](../html/T_Grasshopper_Kernel_GH_PreviewFilter.htm
"GH_PreviewFilter Enumeration")

[GH_PreviewMesh Enumeration](../html/T_Grasshopper_Kernel_GH_PreviewMesh.htm
"GH_PreviewMesh Enumeration")

[GH_PreviewMeshArgs Class](../html/T_Grasshopper_Kernel_GH_PreviewMeshArgs.htm
"GH_PreviewMeshArgs Class")

[GH_PreviewMode Enumeration](../html/T_Grasshopper_Kernel_GH_PreviewMode.htm
"GH_PreviewMode Enumeration")

[GH_PreviewUtil Class](../html/T_Grasshopper_Kernel_GH_PreviewUtil.htm
"GH_PreviewUtil Class")

[GH_PreviewWireArgs Class](../html/T_Grasshopper_Kernel_GH_PreviewWireArgs.htm
"GH_PreviewWireArgs Class")

[GH_PrincipalState
Enumeration](../html/T_Grasshopper_Kernel_GH_PrincipalState.htm
"GH_PrincipalState Enumeration")

[GH_ProcessStep Enumeration](../html/T_Grasshopper_Kernel_GH_ProcessStep.htm
"GH_ProcessStep Enumeration")

[GH_ProfilerMode Enumeration](../html/T_Grasshopper_Kernel_GH_ProfilerMode.htm
"GH_ProfilerMode Enumeration")

[GH_RelevantObjectData
Class](../html/T_Grasshopper_Kernel_GH_RelevantObjectData.htm
"GH_RelevantObjectData Class")

[GH_RelevantObjectFilter
Enumeration](../html/T_Grasshopper_Kernel_GH_RelevantObjectFilter.htm
"GH_RelevantObjectFilter Enumeration")

[GH_RenderArgs Class](../html/T_Grasshopper_Kernel_GH_RenderArgs.htm
"GH_RenderArgs Class")

[GH_RuntimeMessage Class](../html/T_Grasshopper_Kernel_GH_RuntimeMessage.htm
"GH_RuntimeMessage Class")

[GH_RuntimeMessageLevel
Enumeration](../html/T_Grasshopper_Kernel_GH_RuntimeMessageLevel.htm
"GH_RuntimeMessageLevel Enumeration")

[GH_SelectionState
Enumeration](../html/T_Grasshopper_Kernel_GH_SelectionState.htm
"GH_SelectionState Enumeration")

[GH_SelectionTopology
Enumeration](../html/T_Grasshopper_Kernel_GH_SelectionTopology.htm
"GH_SelectionTopology Enumeration")

[GH_SettingsServer Class](../html/T_Grasshopper_Kernel_GH_SettingsServer.htm
"GH_SettingsServer Class")

[GH_SettingsType Enumeration](../html/T_Grasshopper_Kernel_GH_SettingsType.htm
"GH_SettingsType Enumeration")

[GH_SolutionEventArgs
Class](../html/T_Grasshopper_Kernel_GH_SolutionEventArgs.htm
"GH_SolutionEventArgs Class")

[GH_SolutionExpiredEventArgs
Class](../html/T_Grasshopper_Kernel_GH_SolutionExpiredEventArgs.htm
"GH_SolutionExpiredEventArgs Class")

[GH_SolutionMode Enumeration](../html/T_Grasshopper_Kernel_GH_SolutionMode.htm
"GH_SolutionMode Enumeration")

[GH_SolutionPhase
Enumeration](../html/T_Grasshopper_Kernel_GH_SolutionPhase.htm
"GH_SolutionPhase Enumeration")

[GH_SolutionSpan Structure](../html/T_Grasshopper_Kernel_GH_SolutionSpan.htm
"GH_SolutionSpan Structure")

GH_State Class

[GH_StateServer Class](../html/T_Grasshopper_Kernel_GH_StateServer.htm
"GH_StateServer Class")

[GH_StateTag Class](../html/T_Grasshopper_Kernel_GH_StateTag.htm "GH_StateTag
Class")

[GH_StateTag.DrawCallback
Delegate](../html/T_Grasshopper_Kernel_GH_StateTag_DrawCallback.htm
"GH_StateTag.DrawCallback Delegate")

[GH_StateTagLayoutDirection
Enumeration](../html/T_Grasshopper_Kernel_GH_StateTagLayoutDirection.htm
"GH_StateTagLayoutDirection Enumeration")

[GH_StateTagList Class](../html/T_Grasshopper_Kernel_GH_StateTagList.htm
"GH_StateTagList Class")

[GH_TaskCapableComponent(T)
Class](../html/T_Grasshopper_Kernel_GH_TaskCapableComponent_1.htm
"GH_TaskCapableComponent\(T\) Class")

[GH_TimeKind Enumeration](../html/T_Grasshopper_Kernel_GH_TimeKind.htm
"GH_TimeKind Enumeration")

[GH_TypeLib Class](../html/T_Grasshopper_Kernel_GH_TypeLib.htm "GH_TypeLib
Class")

[GH_UndoOperation
Enumeration](../html/T_Grasshopper_Kernel_GH_UndoOperation.htm
"GH_UndoOperation Enumeration")

[GH_UpgradeUtil Class](../html/T_Grasshopper_Kernel_GH_UpgradeUtil.htm
"GH_UpgradeUtil Class")

[GH_UserObject Class](../html/T_Grasshopper_Kernel_GH_UserObject.htm
"GH_UserObject Class")

[GH_ValueProxy(T) Class](../html/T_Grasshopper_Kernel_GH_ValueProxy_1.htm
"GH_ValueProxy\(T\) Class")

[GH_ZuiAction Class](../html/T_Grasshopper_Kernel_GH_ZuiAction.htm
"GH_ZuiAction Class")

[IGH_ActiveObject Interface](../html/T_Grasshopper_Kernel_IGH_ActiveObject.htm
"IGH_ActiveObject Interface")

[IGH_Attributes Interface](../html/T_Grasshopper_Kernel_IGH_Attributes.htm
"IGH_Attributes Interface")

[IGH_Author Interface](../html/T_Grasshopper_Kernel_IGH_Author.htm "IGH_Author
Interface")

[IGH_BakeAwareData
Interface](../html/T_Grasshopper_Kernel_IGH_BakeAwareData.htm
"IGH_BakeAwareData Interface")

[IGH_BakeAwareObject
Interface](../html/T_Grasshopper_Kernel_IGH_BakeAwareObject.htm
"IGH_BakeAwareObject Interface")

[IGH_Component Interface](../html/T_Grasshopper_Kernel_IGH_Component.htm
"IGH_Component Interface")

[IGH_ContextualComponent
Interface](../html/T_Grasshopper_Kernel_IGH_ContextualComponent.htm
"IGH_ContextualComponent Interface")

[IGH_ContextualParameter
Interface](../html/T_Grasshopper_Kernel_IGH_ContextualParameter.htm
"IGH_ContextualParameter Interface")

[IGH_ContextualParameter2
Interface](../html/T_Grasshopper_Kernel_IGH_ContextualParameter2.htm
"IGH_ContextualParameter2 Interface")

[IGH_DataAccess Interface](../html/T_Grasshopper_Kernel_IGH_DataAccess.htm
"IGH_DataAccess Interface")

[IGH_DebugDescription
Interface](../html/T_Grasshopper_Kernel_IGH_DebugDescription.htm
"IGH_DebugDescription Interface")

[IGH_DocumentObject
Interface](../html/T_Grasshopper_Kernel_IGH_DocumentObject.htm
"IGH_DocumentObject Interface")

[IGH_DocumentObject.AttributesChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_IGH_DocumentObject_AttributesChangedEventHandler.htm
"IGH_DocumentObject.AttributesChangedEventHandler Delegate")

[IGH_DocumentObject.DisplayExpiredEventHandler
Delegate](../html/T_Grasshopper_Kernel_IGH_DocumentObject_DisplayExpiredEventHandler.htm
"IGH_DocumentObject.DisplayExpiredEventHandler Delegate")

[IGH_DocumentObject.ObjectChangedEventHandler
Delegate](../html/T_Grasshopper_Kernel_IGH_DocumentObject_ObjectChangedEventHandler.htm
"IGH_DocumentObject.ObjectChangedEventHandler Delegate")

[IGH_DocumentObject.PingDocumentEventHandler
Delegate](../html/T_Grasshopper_Kernel_IGH_DocumentObject_PingDocumentEventHandler.htm
"IGH_DocumentObject.PingDocumentEventHandler Delegate")

[IGH_DocumentObject.PreviewExpiredEventHandler
Delegate](../html/T_Grasshopper_Kernel_IGH_DocumentObject_PreviewExpiredEventHandler.htm
"IGH_DocumentObject.PreviewExpiredEventHandler Delegate")

[IGH_DocumentObject.SolutionExpiredEventHandler
Delegate](../html/T_Grasshopper_Kernel_IGH_DocumentObject_SolutionExpiredEventHandler.htm
"IGH_DocumentObject.SolutionExpiredEventHandler Delegate")

[IGH_DocumentOwner
Interface](../html/T_Grasshopper_Kernel_IGH_DocumentOwner.htm
"IGH_DocumentOwner Interface")

[IGH_EventConsumer
Interface](../html/T_Grasshopper_Kernel_IGH_EventConsumer.htm
"IGH_EventConsumer Interface")

[IGH_InitCodeAware
Interface](../html/T_Grasshopper_Kernel_IGH_InitCodeAware.htm
"IGH_InitCodeAware Interface")

[IGH_InstanceDescription
Interface](../html/T_Grasshopper_Kernel_IGH_InstanceDescription.htm
"IGH_InstanceDescription Interface")

[IGH_InstanceGuidDependent
Interface](../html/T_Grasshopper_Kernel_IGH_InstanceGuidDependent.htm
"IGH_InstanceGuidDependent Interface")

[IGH_ObjectProxy Interface](../html/T_Grasshopper_Kernel_IGH_ObjectProxy.htm
"IGH_ObjectProxy Interface")

[IGH_Param Interface](../html/T_Grasshopper_Kernel_IGH_Param.htm "IGH_Param
Interface")

[IGH_PreviewArgs Interface](../html/T_Grasshopper_Kernel_IGH_PreviewArgs.htm
"IGH_PreviewArgs Interface")

[IGH_PreviewData Interface](../html/T_Grasshopper_Kernel_IGH_PreviewData.htm
"IGH_PreviewData Interface")

[IGH_PreviewMeshData
Interface](../html/T_Grasshopper_Kernel_IGH_PreviewMeshData.htm
"IGH_PreviewMeshData Interface")

[IGH_PreviewObject
Interface](../html/T_Grasshopper_Kernel_IGH_PreviewObject.htm
"IGH_PreviewObject Interface")

[IGH_RenderAwareData
Interface](../html/T_Grasshopper_Kernel_IGH_RenderAwareData.htm
"IGH_RenderAwareData Interface")

[IGH_StateAwareObject
Interface](../html/T_Grasshopper_Kernel_IGH_StateAwareObject.htm
"IGH_StateAwareObject Interface")

[IGH_StateTag Interface](../html/T_Grasshopper_Kernel_IGH_StateTag.htm
"IGH_StateTag Interface")

[IGH_TaskCapableComponent
Interface](../html/T_Grasshopper_Kernel_IGH_TaskCapableComponent.htm
"IGH_TaskCapableComponent Interface")

[IGH_UpgradeObject
Interface](../html/T_Grasshopper_Kernel_IGH_UpgradeObject.htm
"IGH_UpgradeObject Interface")

[IGH_UserPromptAware
Interface](../html/T_Grasshopper_Kernel_IGH_UserPromptAware.htm
"IGH_UserPromptAware Interface")

[IGH_ValueProxy Interface](../html/T_Grasshopper_Kernel_IGH_ValueProxy.htm
"IGH_ValueProxy Interface")

[IGH_VariableParameterComponent
Interface](../html/T_Grasshopper_Kernel_IGH_VariableParameterComponent.htm
"IGH_VariableParameterComponent Interface")

[IGH_ZuiAction Interface](../html/T_Grasshopper_Kernel_IGH_ZuiAction.htm
"IGH_ZuiAction Interface")

[IRcpAwareObject Interface](../html/T_Grasshopper_Kernel_IRcpAwareObject.htm
"IRcpAwareObject Interface")

!Click or drag to
resize

# Grasshopper.Kernel Namespace

---

The Kernel namespace contains all the classes that make up the logical
backbone of the plug-in.

Classes

| Class| Description
---|---|---
|
GH_ActiveObject|  Basic
implementation of IGH_ActiveObject interface. Derive from this class rather
than implementing IGH_ActiveObject to make your life easier.
|
GH_Alias|  Represents a single
alias|target combo.
|
GH_AssemblyInfo|  Implement this
interface once (and once only) in a GHA project if you wish to add additional
information about your library to Grasshopper. Note you must supply an empty
constructor.
|
GH_AssemblyInfoStub|  Provides
basic properties for a GHA assembly that does not expose a type that derives
from GH_AssemblyInfo. This type is created automatically when a
GH_AssemblyInfo type is not found in an assembly.
|
GH_AssemblyPriority|  Derive
from this class if you wish to perform additional steps before any of your
components are loaded. Any class in your project which inherits from
GH_AssemblyPriority and which has an empty constructor will be instantiated
prior to any GH_Component or IGH_DocumentObject classes.
|
GH_AttributesT|  Derive from this
class rather than implementing IGH_Attributes from scratch.
|
GH_AttributesChangedEventArgs|
Event arguments passed during AttributesChanged events.
|
GH_Author|  Maintains author information
such as name, company, copyright, address etc.
|
GH_AutoSaveSettings|  Provides
access to all AutoSave event flags.
|
GH_BakeUtility|  A utility class
for baking. We heavily recommend you use this for any baking, as it handles
invalid objects correctly.
|
GH_CharPatternParamNameConstructor|
**Obsolete.**
|
GH_Component|  Inherit from this
class if you wish to create a custom component. Note that you **must** provide
a public, empty constructor which calls the base class constructor.
|
GH_ComponentGH_InputParamManager|
This class is used during Component construction to add input parameters.
|
GH_ComponentGH_OutputParamManager|
This class is used during Component construction to add output parameters.
|
GH_ComponentParamServer|
Wraps all members and functions needed for GH_Component to manage its input
and output parameters.
|
GH_ComponentParamServerNullParamAttributes|
|
GH_ComponentServer|  Maintains
proxies for all components, parameters and other object types as defined in
all grasshopper assemblies.
|
GH_ConnectivityDiagram|
Represents a complete connectivity diagram (topology) of a GH_Document. A
connectivity diagram is basically an undirected network of all the wires in a
document.
|
GH_ConnectivityDisparity|
Maintains two connectivity diagrams, one of which is a subset of the other.
|
GH_ConnectivityNode|
Represents a single node in a Grasshopper connectivity diagram. A single node
represents a single IGH_Param instance.
|
GH_Convert|  Provides static converters
for different data types inside Grasshopper. This class both has specific and
generic converters.
|
GH_CustomEventServer|
RhinoCommon only event server.
|
GH_DebugDescriptionWriter|
Writer object used to create debug logs.
|
GH_DisplayExpiredEventArgs|
Arguments for display events.
|
GH_DocContextEventArgs|
These arguments are passed along with SettingsChanged events on GH_Document.
|
GH_DocEnabledEventArgs|
These arguments are passed along with SettingsChanged events on GH_Document.
|
GH_DocFilePathEventArgs|
These arguments are passed along with FilePathChanged events on GH_Document.
|
GH_DocModifiedEventArgs|
These arguments are passed along with ModifiedChanged events on GH_Document.
|
GH_DocObjectEventArgs|
These arguments are passed along with ObjectsAdded and ObjectsRemoved events
on GH_Document.
|
GH_DocSettingsEventArgs|
These arguments are passed along with SettingsChanged events on GH_Document.
|
GH_Document|  Represents a single
Grasshopper document.
|
GH_DocumentAssociations|
|
GH_DocumentEventServer|
RhinoCommon only event server.
|
GH_DocumentIO|  Provides basic IO
operations for GH_Documents.
|
GH_DocumentObject|  Standard
implementation of IGH_DocumentObject.
|
GH_DocumentServer|  Manages and
maintains a collection of GH_Documents.
|
GH_DocumentTree|  Represents a
hierarchical tree of documents that are subsidiary to one another.
|
GH_DocumentTreeNode|
Represents a single node in a document tree.
|
GH_DocUndoEventArgs|  These
arguments are passed along with UndoStateChanged events on GH_Document.
|
GH_ExternalFile|  Represents
information about external files to be loaded.
|
GH_FileSystemEventServer|
Provides a easy-to-use way to keep tabs on files.
|
GH_FileWatcher|  Provides easy
mechanisms to monitor changes to the local File System.
|
GH_FontServer|  Maintains a
collection of standard fonts and mays to measure them.
|
GH_Format|  Provides standard
Grasshopper formatting functions.
|
GH_GHALoadingEventArgs|
Event arguments used in the GH_GHALoaded event on GH_ComponentServer.
|
GH_GHXHarvester|  Provides static
methods for harvesting data from GHX and GH files.
|
GH_InstanceDescription|
Base implementation of IGH_InstanceDescription. Consider deriving from this
class rather than implementing IGH_InstanceDescription from scratch.
|
GH_LineParser|  Provides basic
functionality for the custom ReadFile component script parsing.
|
GH_ListUtil|  Provides utilities for
dealing with list of Data from input parameters.
|
GH_LoadingAttribute|  Assembly
loading behaviour attribute.
|
GH_MemoryBitmap|  Utility class
for ultra-fast bitmap sampling and filters.
|
GH_ObjectChangedEventArgs|
Event arguments passed during ObjectChanged events.
|
GH_ParamT|  Base implementation of
IGH_Param. Derive from this class rather than implementing IGH_Param from
scratch. If your parameter can store persistent data, derive from
GH_PersistentParam(Of T) instead.
|
GH_ParameterContext|  Data
passed to IGH_ContextualParameter.AutoAssignContextualData to help define a
context state of Rhino/Grasshopper
|
GH_ParamServerEventArgs|
Arguments used in events for the GH_ComponentParamServer type.
|
GH_PatternMatching|
|
GH_PersistentGeometryParamT|
Derives from GH_PersistentParam(Of T), but adds some useful functions for
dealing with geometric data types.
|
GH_PersistentParamT|
Implementation of GH_Param(Of T) that supports persistent data.
|
GH_PersistentReferenceParamT|
|
GH_PingDocumentEventArgs|
Event arguments passed during PingDocument events.
|
GH_PreviewArgs|  This class is
passed to Objects that implement IGH_PreviewObject during drawing operations.
|
GH_PreviewBoundary|  A closed
boundary for filtering previewed objects.
|
GH_PreviewExpiredEventArgs|
Arguments for preview events.
|
GH_PreviewMeshArgs|  This class
is passed to objects that implement IGH_PreviewData during mesh drawing
operations.
|
GH_PreviewUtil|  This class exposes
functionality that makes it easy to draw temporary geometry in Rhino
viewports.
|
GH_PreviewWireArgs|  This class
is passed to objects that implement IGH_PreviewData during wire drawing
operations.
|
GH_RelevantObjectData|
Contains information about relevant objects at a specific canvas location.
|
GH_RenderArgs|  This class is passed
to objects that implement IGH_RenderAwareData or IGH_RenderAwareObject during
render queue operations.
|
GH_RuntimeMessage|  Contains all
fields that together define a RuntimeMessage. Runtime Messages are created and
recorded by document objects during Grasshopper solutions.
|
GH_SettingsServer|  A single
instance of this class is maintained at module level under the accessor
"Settings".
|
GH_SolutionEventArgs|  Event
arguments used for Document Solution events.
|
GH_SolutionExpiredEventArgs|
Arguments for solution events.
|
GH_State|  Represents a single recorded
document state. A state contains values for an arbitrary set of objects inside
the document.
|
GH_StateServer|  Maintains all the
recorded states for this document.
|
GH_StateTag|  Abstract implementation
of the IGH_StateTag interface. Derive from this class rather than implementing
IGH_StateTag.
|
GH_StateTagList|  Maintains a
collection of IGH_StateTag objects.
|
GH_TaskCapableComponentT|
Abstract implementation of IGH_TaskCapableComponent. Inherit from this class
instead of implementing IGH_TaskCapableComponent directly.
|
GH_TypeLib|  Utility module that caches
a number of oft-used types and type-ids for quick access. Do not change any of
the values in this module or you'll wreck casting and conversion logic.
|
GH_UpgradeUtil|  Exposes several
utility functions for migrating parameters and wires between components useful
while upgrading components.
|
GH_UserObject|  Represents a custom
user object. A User Object is an existing IGH_DocumentObject with overridden
icon, instance description and exposure.
|
GH_ValueProxyT|  Represents the
abstract base implementation of the IGH_ValueProxy interface.
|
GH_ZuiAction|  Basic implementation
of IGH_ZuiAction.

Structures

| Structure| Description
---|---|---
|
GH_AssemblyFolderInfo|
Represents a folder from which GHA files are loaded.
|
GH_SolutionSpan|  Represents the
time interval for a GH_Document solution.

Interfaces

| Interface| Description
---|---|---
|
GH_ComponentParamServerIGH_SyncObject|
Synch object for tracking long term changes to the parameter server.
|
IGH_ActiveObject|  Base interface
for all objects on the canvas that participate in solutions
|
IGH_Attributes|  Base interface for
all Attributes. Attributes are the visual portion of GH_DocumentObjects. They
handle display, mouse events, layout, context menus etc. etc. You should
consider inheriting from GH_Attributes or some other abstract class instead of
implementing this interface from scratch.
|
IGH_Author|  Provides of collection of
basic author details.
|
IGH_BakeAwareData|  Implement
this interface in your IGH_Goo data type if you want to be included in baking
operations.
|
IGH_BakeAwareObject|
Implement this interface on your IGH_ActiveObject if you want to participate
in the Bake GUI.
|
IGH_Component|  Base interface for
all GH_Component types. Do not implement this interface from scratch, inherit
from GH_Component instead.
|
IGH_ContextualComponent|
Base interface for contextual components. This makes accessing non-strongly-
typed functionality easier.
|
IGH_ContextualParameter|
Base interface for contextual parameters. This makes accessing non-strongly-
typed functionality easier.
|
IGH_ContextualParameter2|
Version 2 of Base interface for contextual parameters. This makes accessing
non-strongly-typed functionality easier.
|
IGH_DataAccess|  Provides access to
component parameters, in order to retrieve and assign data during solutions.
|
IGH_DebugDescription|
Implement this interface to participate in Debug Logging.
|
IGH_DocumentObject|  Base
interface for objects that want to play on the Canvas. Do not implement this
interface from scratch. Either inherit from GH_DocumentObject or one of the
other partially finished types such as GH_ActiveObject, GH_Param(Of T) or
GH_Component.
|
IGH_DocumentOwner|  Implement
this interface if you want to be the owner assigned to a document in the
Grasshopper documentserver.
|
IGH_EventConsumer|  Implement
this interface if you want to inter-operate with a GH_EventServer.
|
IGH_InitCodeAware|  Implement
this interface in your IGH_DocumentObject class if you want to handle
initialization codes from Canvas Search boxes.
|
IGH_InstanceDescription|
Base interface for all objects that participate in the Grasshopper GUI.
|
IGH_InstanceGuidDependent|
Implement this interface in your IGH_DocumentObject class if you want to be
informed when the InstanceGuids of objects in the document are mutated.
|
IGH_ObjectProxy|  Provides proxy
data for all Grasshopper components and parameters.
|
IGH_Param|  Base interface for all
Parameter types in Grasshopper. Do not implement this interface from scratch,
derive from GH_Param or GH_PersistentParam instead.
|
IGH_PreviewArgs|  Preview display
arguments for IGH_PreviewObjects.
|
IGH_PreviewData|  All IGH_Goo
types that wish to participate in Viewport redraws must implement this
interface.
|
IGH_PreviewMeshData|
Implement this interface if your data deals with preview meshes.
|
IGH_PreviewObject|  All
IGH_DocumentObjects that wish to participate in Viewport redraws must
implement this interface.
|
IGH_RenderAwareData|
Implement this interface in your IGH_Goo type if it may have render geometry.
|
IGH_StateAwareObject|
Implement this interface if you want to be included in state saving/loading.
|
IGH_StateTag|  A StateTag is a visual
feedback mechanism that reflects a certain local setting of an Object.
|
IGH_TaskCapableComponent|
GH_Component that can choose to support the use of Tasks to compute solutions
When UseTasks returns true, the component has it's SolveInstance enumeration
called twice. The first pass (InPreSolve=True) is intended solely for
collecting data and starting calculation tasks. The second pass
(InPreSolve=False) takes results or the tasks and sets the output.
|
IGH_UpgradeObject|  Create a
class with an empty constructor that implements this interface if you want to
provide an upgrade mechanism.
|
IGH_UserPromptAware|
Implement this interface in your IGH_Param if you want to allow users to set
data either through the menu or by double clicking.
|
IGH_ValueProxy|
|
IGH_VariableParameterComponent|
Implement this interface in your component if you want to enable variable
parameter UI.
|
IGH_ZuiAction|  Represents a single
action which is only visible on screen above a certain zoom level.
|
IRcpAwareObject|  Implement this
interface in a parameter or component if you want to be publishable on the
remote control panel.

Delegates

| Delegate| Description
---|---|---
|
GH_AutoSaveSettingsAutoSaveFileFormatChangedEventHandler|
|
GH_AutoSaveSettingsEnableAutoSaveChangedEventHandler|
|
GH_AutoSaveSettingsSaveOnDataFlatteningChangedEventHandler|
|
GH_AutoSaveSettingsSaveOnDocumentUnloadChangedEventHandler|
|
GH_AutoSaveSettingsSaveOnObjectAddedChangedEventHandler|
|
GH_AutoSaveSettingsSaveOnObjectChangeChangedEventHandler|
|
GH_AutoSaveSettingsSaveOnObjectRemovedChangedEventHandler|
|
GH_AutoSaveSettingsSaveOnWireEventChangedEventHandler|
|
GH_ComponentParamServerParameterChangedEventHandler|
|
GH_ComponentParamServerParameterNickNameChangedEventHandler|
|
GH_ComponentParamServerParameterSourcesChangedEventHandler|
|
GH_ComponentServerGHAFileLoadedEventHandler|
|
GH_DocumentContextChangedEventHandler|
|
GH_DocumentDefaultPreviewColourChangedEventHandler|
|
GH_DocumentDefaultSelectedPreviewColourChangedEventHandler|
|
GH_DocumentEnabledChangedEventHandler|
|
GH_DocumentEnableSolutionsChangedEventHandler|
|
GH_DocumentFilePathChangedEventHandler|
|
GH_DocumentGH_ActiveObjectFilter|
|
GH_DocumentGH_ScheduleDelegate|
Callback signature for Scheduled Solutions.
|
GH_DocumentModifiedChangedEventHandler|
|
GH_DocumentObjectsAddedEventHandler|
|
GH_DocumentObjectsDeletedEventHandler|
|
GH_DocumentSettingsChangedEventHandler|
|
GH_DocumentSolutionEndEventHandler|
|
GH_DocumentSolutionStartEventHandler|
|
GH_DocumentUndoStateChangedEventHandler|
|
GH_DocumentObjectColourEventHandler|
|
GH_DocumentServerDocumentAddedEventHandler|
|
GH_DocumentServerDocumentRemovedEventHandler|
|
GH_FileSystemEventServerFileEvent|
This delegate is called when changes to a certain file occur.
|
GH_FileWatcherFileChanged|
Delegate method for file change callbacks.
|
GH_FileWatcherFileChangedSimple|
Delegate method for file change callbacks.
|
GH_FontServerConsoleFamilyChangedEventHandler|
|
GH_FontServerScriptFamilyChangedEventHandler|
|
GH_FontServerStandardFamilyChangedEventHandler|
|
GH_StateTagDrawCallback|
Drawing delegate.
|
IGH_DocumentObjectAttributesChangedEventHandler|
|
IGH_DocumentObjectDisplayExpiredEventHandler|
|
IGH_DocumentObjectObjectChangedEventHandler|
|
IGH_DocumentObjectPingDocumentEventHandler|
|
IGH_DocumentObjectPreviewExpiredEventHandler|
|
IGH_DocumentObjectSolutionExpiredEventHandler|

Enumerations

| Enumeration| Description
---|---|---
|
GH_Arrange|  Enumerates possible types
of object arrangement.
|
GH_AutoSaveTrigger|  Different
types of events that can cause an AutoSave.
|
GH_BitmapChannel|  Lists all
possible channels for 24 and 32 bit bitmaps.
|
GH_ClipboardType|  Enumerates all
possible clipboards for GH_DocumentIO operations.
|
GH_ComponentPaletteStyle|
|
GH_Conversion|  Level flag for
conversion algorithms.
|
GH_DataComparison|  Enumerates
all possible Data Matching algorithms for Components.
|
GH_DataMapping|  Enumerates all
parameter data mapping types.
|
GH_DocumentContext|  Enumerates
all possible (de)activation contexts for documents.
|
GH_DocumentRank|  Enumerates all
possible document rankings.
|
GH_DocumentSettings|
Enumerates all possible types of settings for a GH_Document.
|
GH_Exposure|  Lists the different
kinds of GUI exposure an object can have.
|
GH_ExternalFileType|
Enumerates the possible external files that Grasshopper is interested in.
|
GH_FileWatcherEvents|
Enumerates all possible file watcher events. These can be combined.
|
GH_Filter|  Enumerates all object Search
filters.
|
GH_GetterResult|  Enumerates
typical getter results.
|
GH_GuidConflictSolution|
Contains a list of all possible Assembly GUID conflict solutions
|
GH_IconDisplayMode|  Lists all
display modes that individual objects can have.
|
GH_LibraryLicense|  Enumerates
the possible library types for GHA assemblies.
|
GH_LineParserAction|
Enumerates the possible actions a line parser can invoke.
|
GH_LoadingDemand|  Enumerates all
assembly loading behaviour demands.
|
GH_LoadingInstruction|
Enumerates all external GHA loading process instructions.
|
GH_LoadingMechanism|
Enumerates all assembly loading mechanisms.
|
GH_MatchLevel|  All possible string
matching schemes.
|
GH_MatchWeight|  Weighting factors
of string matches.
|
GH_ObjectEventType|  Represents
common changes which can cause the ObjectChanged event to be raised.
|
GH_ObjectSpecies|  Contains all
object species.
|
GH_ObjectType|  Enumerates all types
of object that can be referenced by a GH_ObjectProxy instance.
|
GH_ParamAccess|  Enumerates the
types of access that parameters support.
|
GH_ParamData|  Enumerates the
possible states of being for data inside a parameter.
|
GH_ParameterSide|  Enumerates
possible sides for variable parameters.
|
GH_ParamHashFields|  Enumerates
all accepted fields for hashing parameter data.
|
GH_ParamKind|  Enumerates the
different guises of parameter
|
GH_ParamWireDisplay|
Enumerates the possible wire display types for parameters.
|
GH_PatternMatchingMatchingMode|
|
GH_PickBox|  Represents the different
ways in which picking rectangles can behave.
|
GH_PluginFolderType|
Enumerates the possible folder types for GH_AssemblyFolderInfo
|
GH_PreviewFilter|  Lists all
possible Grasshopper preview filters.
|
GH_PreviewMesh|  Enumerates
possible meshing parameters for documents.
|
GH_PreviewMode|  Lists all possible
Grasshopper preview modes.
|
GH_PrincipalState|  Enumerates
the different possible states in which the masterness of a parameter can
occur.
|
GH_ProcessStep|  Enumerates all
possible solution states in which the document can be.
|
GH_ProfilerMode|  Lists all
profiler modes.
|
GH_RelevantObjectFilter|
Enumerates the possible filters to use in relevant object searches.
|
GH_RuntimeMessageLevel|
Indicates the severity of a runtime message.
|
GH_SelectionState|  Enumerates
the possible effects of a specific selection operation.
|
GH_SelectionTopology|
Enumerates the possible selection topologies.
|
GH_SettingsType|  Lists all the
data types available in the GH_SettingsServer class.
|
GH_SolutionMode|  Enumerates all
solution modes.
|
GH_SolutionPhase|  The Phase
flags are used to track object states during solutions.
|
GH_StateTagLayoutDirection|
Enumerates the possible layout directions for parameter state tags.
|
GH_TimeKind|  Enumerates the possible
kinds that a System.DateTime value can imply.
|
GH_UndoOperation|  Enumerates all
possible types of undo operation.

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com