---
url: https://developer.rhino3d.com/api/grasshopper/html/N_Grasshopper_GUI.htm#!
scraped_at: 2025-09-08T16:12:08.187594
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_AnimationPhase
Enumeration](../html/T_Grasshopper_GUI_GH_AnimationPhase.htm
"GH_AnimationPhase Enumeration")

[GH_Animator Class](../html/T_Grasshopper_GUI_GH_Animator.htm "GH_Animator
Class")

[GH_Animator(T) Class](../html/T_Grasshopper_GUI_GH_Animator_1.htm
"GH_Animator\(T\) Class")

[GH_Animator(T).Interpolate
Delegate](../html/T_Grasshopper_GUI_GH_Animator_1_Interpolate.htm
"GH_Animator\(T\).Interpolate Delegate")

[GH_AsynchFileData Class](../html/T_Grasshopper_GUI_GH_AsynchFileData.htm
"GH_AsynchFileData Class")

[GH_AsynchFileData.FileChangedDelegate
Delegate](../html/T_Grasshopper_GUI_GH_AsynchFileData_FileChangedDelegate.htm
"GH_AsynchFileData.FileChangedDelegate Delegate")

[GH_BezierSolver Class](../html/T_Grasshopper_GUI_GH_BezierSolver.htm
"GH_BezierSolver Class")

[GH_CanvasMouseEvent Class](../html/T_Grasshopper_GUI_GH_CanvasMouseEvent.htm
"GH_CanvasMouseEvent Class")

[GH_CanvasObjectMouseDownEventArgs
Class](../html/T_Grasshopper_GUI_GH_CanvasObjectMouseDownEventArgs.htm
"GH_CanvasObjectMouseDownEventArgs Class")

[GH_ColourPicker Class](../html/T_Grasshopper_GUI_GH_ColourPicker.htm
"GH_ColourPicker Class")

[GH_ColourPicker.ColourChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_ColourPicker_ColourChangedEventHandler.htm
"GH_ColourPicker.ColourChangedEventHandler Delegate")

[GH_ColourSwatchEventArgs
Class](../html/T_Grasshopper_GUI_GH_ColourSwatchEventArgs.htm
"GH_ColourSwatchEventArgs Class")

[GH_Constraint Enumeration](../html/T_Grasshopper_GUI_GH_Constraint.htm
"GH_Constraint Enumeration")

[GH_CursorServer Class](../html/T_Grasshopper_GUI_GH_CursorServer.htm
"GH_CursorServer Class")

[GH_DebugLogForm Class](../html/T_Grasshopper_GUI_GH_DebugLogForm.htm
"GH_DebugLogForm Class")

[GH_DigitScroller Class](../html/T_Grasshopper_GUI_GH_DigitScroller.htm
"GH_DigitScroller Class")

[GH_DigitScroller.ValueChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_DigitScroller_ValueChangedEventHandler.htm
"GH_DigitScroller.ValueChangedEventHandler Delegate")

[GH_DocumentEditor Class](../html/T_Grasshopper_GUI_GH_DocumentEditor.htm
"GH_DocumentEditor Class")

[GH_DocumentEditor.AggregateShortcutMenuItemsEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_DocumentEditor_AggregateShortcutMenuItemsEventHandler.htm
"GH_DocumentEditor.AggregateShortcutMenuItemsEventHandler Delegate")

[GH_DocumentEditor.EditorFoldStateChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_DocumentEditor_EditorFoldStateChangedEventHandler.htm
"GH_DocumentEditor.EditorFoldStateChangedEventHandler Delegate")

[GH_DoubleBufferedPanel
Class](../html/T_Grasshopper_GUI_GH_DoubleBufferedPanel.htm
"GH_DoubleBufferedPanel Class")

[GH_DragInfo Class](../html/T_Grasshopper_GUI_GH_DragInfo.htm "GH_DragInfo
Class")

[GH_EtoUtil Class](../html/T_Grasshopper_GUI_GH_EtoUtil.htm "GH_EtoUtil
Class")

[GH_ExternalFileConflictDialog
Class](../html/T_Grasshopper_GUI_GH_ExternalFileConflictDialog.htm
"GH_ExternalFileConflictDialog Class")

[GH_FadeAnimation Class](../html/T_Grasshopper_GUI_GH_FadeAnimation.htm
"GH_FadeAnimation Class")

[GH_FadePhase Enumeration](../html/T_Grasshopper_GUI_GH_FadePhase.htm
"GH_FadePhase Enumeration")

[GH_FontControl Class](../html/T_Grasshopper_GUI_GH_FontControl.htm
"GH_FontControl Class")

[GH_FontList Class](../html/T_Grasshopper_GUI_GH_FontList.htm "GH_FontList
Class")

[GH_FontPicker Class](../html/T_Grasshopper_GUI_GH_FontPicker.htm
"GH_FontPicker Class")

[GH_FontScroller Class](../html/T_Grasshopper_GUI_GH_FontScroller.htm
"GH_FontScroller Class")

[GH_FontScroller.PostPaint
Delegate](../html/T_Grasshopper_GUI_GH_FontScroller_PostPaint.htm
"GH_FontScroller.PostPaint Delegate")

[GH_FormShepard Class](../html/T_Grasshopper_GUI_GH_FormShepard.htm
"GH_FormShepard Class")

[GH_GDI_Util Class](../html/T_Grasshopper_GUI_GH_GDI_Util.htm "GH_GDI_Util
Class")

[GH_GeometricFont Class](../html/T_Grasshopper_GUI_GH_GeometricFont.htm
"GH_GeometricFont Class")

[GH_GraphicsUtil Class](../html/T_Grasshopper_GUI_GH_GraphicsUtil.htm
"GH_GraphicsUtil Class")

[GH_HorizontalSeparator
Class](../html/T_Grasshopper_GUI_GH_HorizontalSeparator.htm
"GH_HorizontalSeparator Class")

[GH_IconLabel Class](../html/T_Grasshopper_GUI_GH_IconLabel.htm "GH_IconLabel
Class")

[GH_IconPicker Class](../html/T_Grasshopper_GUI_GH_IconPicker.htm
"GH_IconPicker Class")

[GH_Interpolation Enumeration](../html/T_Grasshopper_GUI_GH_Interpolation.htm
"GH_Interpolation Enumeration")

[GH_LoadProtectDialog
Class](../html/T_Grasshopper_GUI_GH_LoadProtectDialog.htm
"GH_LoadProtectDialog Class")

[GH_MaterialPreviewControl
Class](../html/T_Grasshopper_GUI_GH_MaterialPreviewControl.htm
"GH_MaterialPreviewControl Class")

[GH_MaterialPreviewControl.ColourChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_MaterialPreviewControl_ColourChangedEventHandler.htm
"GH_MaterialPreviewControl.ColourChangedEventHandler Delegate")

[GH_MaterialPreviewControl.MaterialImagePostPaintEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_MaterialPreviewControl_MaterialImagePostPaintEventHandler.htm
"GH_MaterialPreviewControl.MaterialImagePostPaintEventHandler Delegate")

[GH_MaterialPreviewControl.SelectedChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_MaterialPreviewControl_SelectedChangedEventHandler.htm
"GH_MaterialPreviewControl.SelectedChangedEventHandler Delegate")

[GH_MenuTextBox Class](../html/T_Grasshopper_GUI_GH_MenuTextBox.htm
"GH_MenuTextBox Class")

[GH_MenuTextBox.KeyDownEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_MenuTextBox_KeyDownEventHandler.htm
"GH_MenuTextBox.KeyDownEventHandler Delegate")

[GH_MenuTextBox.TextChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_MenuTextBox_TextChangedEventHandler.htm
"GH_MenuTextBox.TextChangedEventHandler Delegate")

[GH_MouseTracker Class](../html/T_Grasshopper_GUI_GH_MouseTracker.htm
"GH_MouseTracker Class")

[GH_NumberSliderSnappingEditor
Class](../html/T_Grasshopper_GUI_GH_NumberSliderSnappingEditor.htm
"GH_NumberSliderSnappingEditor Class")

[GH_PanelEditorControl
Class](../html/T_Grasshopper_GUI_GH_PanelEditorControl.htm
"GH_PanelEditorControl Class")

[GH_QuickImageEditor Class](../html/T_Grasshopper_GUI_GH_QuickImageEditor.htm
"GH_QuickImageEditor Class")

[GH_RotationalFrame
Structure](../html/T_Grasshopper_GUI_GH_RotationalFrame.htm
"GH_RotationalFrame Structure")

[GH_RotationalTuningData(T)
Class](../html/T_Grasshopper_GUI_GH_RotationalTuningData_1.htm
"GH_RotationalTuningData\(T\) Class")

[GH_SamplingSphere Class](../html/T_Grasshopper_GUI_GH_SamplingSphere.htm
"GH_SamplingSphere Class")

[GH_SeparatorDisplay
Enumeration](../html/T_Grasshopper_GUI_GH_SeparatorDisplay.htm
"GH_SeparatorDisplay Enumeration")

[GH_SettingsCategory Class](../html/T_Grasshopper_GUI_GH_SettingsCategory.htm
"GH_SettingsCategory Class")

GH_Slider Class

[GH_Slider.ValueChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_Slider_ValueChangedEventHandler.htm
"GH_Slider.ValueChangedEventHandler Delegate")

[GH_Slider_Obsolete Class](../html/T_Grasshopper_GUI_GH_Slider_Obsolete.htm
"GH_Slider_Obsolete Class")

[GH_Slider_Obsolete.ValueChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_Slider_Obsolete_ValueChangedEventHandler.htm
"GH_Slider_Obsolete.ValueChangedEventHandler Delegate")

[GH_SliderInputMode
Enumeration](../html/T_Grasshopper_GUI_GH_SliderInputMode.htm
"GH_SliderInputMode Enumeration")

[GH_StandardIcons Class](../html/T_Grasshopper_GUI_GH_StandardIcons.htm
"GH_StandardIcons Class")

[GH_Tooltip Class](../html/T_Grasshopper_GUI_GH_Tooltip.htm "GH_Tooltip
Class")

[GH_TooltipComponent Class](../html/T_Grasshopper_GUI_GH_TooltipComponent.htm
"GH_TooltipComponent Class")

[GH_TooltipComponent.PopulateTooltipEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_TooltipComponent_PopulateTooltipEventHandler.htm
"GH_TooltipComponent.PopulateTooltipEventHandler Delegate")

[GH_TooltipDisplayEventArgs
Class](../html/T_Grasshopper_GUI_GH_TooltipDisplayEventArgs.htm
"GH_TooltipDisplayEventArgs Class")

[GH_TrackerFrame Structure](../html/T_Grasshopper_GUI_GH_TrackerFrame.htm
"GH_TrackerFrame Structure")

[GH_UnrecognizedObjectsForm
Class](../html/T_Grasshopper_GUI_GH_UnrecognizedObjectsForm.htm
"GH_UnrecognizedObjectsForm Class")

[GH_VerticalScrollBar
Class](../html/T_Grasshopper_GUI_GH_VerticalScrollBar.htm
"GH_VerticalScrollBar Class")

[GH_VerticalScrollBar.ScrollRatioChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_VerticalScrollBar_ScrollRatioChangedEventHandler.htm
"GH_VerticalScrollBar.ScrollRatioChangedEventHandler Delegate")

[GH_VerticalSeparator
Class](../html/T_Grasshopper_GUI_GH_VerticalSeparator.htm
"GH_VerticalSeparator Class")

[GH_VoronoiWarningForm
Class](../html/T_Grasshopper_GUI_GH_VoronoiWarningForm.htm
"GH_VoronoiWarningForm Class")

[GH_WindowsControlUtil
Class](../html/T_Grasshopper_GUI_GH_WindowsControlUtil.htm
"GH_WindowsControlUtil Class")

[GH_WindowsFormUtil Class](../html/T_Grasshopper_GUI_GH_WindowsFormUtil.htm
"GH_WindowsFormUtil Class")

[GH_YakDownloadFormEto
Class](../html/T_Grasshopper_GUI_GH_YakDownloadFormEto.htm
"GH_YakDownloadFormEto Class")

[GH_YakDownloadFormEto.MissingObjectItem
Class](../html/T_Grasshopper_GUI_GH_YakDownloadFormEto_MissingObjectItem.htm
"GH_YakDownloadFormEto.MissingObjectItem Class")

[IGH_Embeddable Interface](../html/T_Grasshopper_GUI_IGH_Embeddable.htm
"IGH_Embeddable Interface")

[IGH_FileDropTarget
Interface](../html/T_Grasshopper_GUI_IGH_FileDropTarget.htm
"IGH_FileDropTarget Interface")

[IGH_SettingCategory
Interface](../html/T_Grasshopper_GUI_IGH_SettingCategory.htm
"IGH_SettingCategory Interface")

[IGH_SettingFrontend
Interface](../html/T_Grasshopper_GUI_IGH_SettingFrontend.htm
"IGH_SettingFrontend Interface")

[IGH_Tooltip Interface](../html/T_Grasshopper_GUI_IGH_Tooltip.htm "IGH_Tooltip
Interface")

!Click or drag to
resize

# Grasshopper.GUI Namespace

---

Namespace for all things GUI. This namespace contains practically all the
custom Form and Control classes used in Grasshopper, but it also contains many
utility functions and classes. Note that many specific classes have been
excluded from this helpfile as they are either very obtuse or overly specific.

Classes

| Class| Description
---|---|---
|
GH_Animator|  Provides static methods and
constructors GH_Animator(Of T).
|
GH_AnimatorT|  Provides methods for
animating values.
|
GH_AsynchFileData|  This class
provides asynchronous methods to keep tabs on a file.
|
GH_BezierSolver|  Class for
evaluating four-point bezier curves as used in GDI+
|
GH_CanvasMouseEvent|  Class used
in Canvas UI events.
|
GH_CanvasObjectMouseDownEventArgs|
Event arguments for the CanvasObjectMouseDown events.
|
GH_ColourPicker|  Provides the
standard Grasshopper Colour picker as a winforms Control.
|
GH_ColourSwatchEventArgs|
Event arguments used in the GH_ColourSwatchControl.ColourChanged event.
|
GH_CursorServer|  Class used to cache
and set cursors.
|
GH_DebugLogForm|
|
GH_DigitScroller|  Provides the
standard Grasshopper Digit scroller as a winforms Control.
|
GH_DocumentEditor|  The Grasshopper
main window.
|
GH_DoubleBufferedPanel|
Derives from Windows.Forms.Panel but overrides certain flags that improve on-
screen rendering. Use panel if you want to have a custom drawn control that is
under the control of the owner form.
|
GH_DragInfo|  Contains data used for UI
drag operations.
|
GH_EtoUtil|
|
GH_ExternalFileConflictDialog|
|
GH_FadeAnimation|  Utility class for
animating fade ZUI events on the canvas.
|
GH_FontControl|  Represents a control
that offers both Font preview and Picking methods.
|
GH_FontList|  Represents the installed
Font collection. This control allows both navigation and selection of Font
Families.
|
GH_FontPicker|
|
GH_FontScroller|  Represents a panel
with a scrolling collection of pangrams.
|
GH_FormShepard|  A Form shepard is
used to herde a bunch of floating forms. Important forms that potentially
spout child forms might choose to implement one.
|
GH_GDI_Util|  Contains some global
function for filleting corners of GDI objects.
|
GH_GeometricFont|  Exposes methods
for drawing geometric characters.
|
GH_GraphicsUtil|  Utility class with
static (Shared) functions that help with colour, shape and text rendering.
|
GH_HorizontalSeparator|  GUI
elements for creating visual separations.
|
GH_IconLabel|  A simple Icon with an
icon overlay plus highlight rectangle.
|
GH_IconPicker|  Provides a standard
icon selection interface.
|
GH_LoadProtectDialog|
|
GH_MaterialPreviewControl|
Offers a frontend for Grasshopper Material previews.
|
GH_MenuTextBox|  Utility control for
putting textboxes into menus.
|
GH_MouseTracker|  Record mouse-
movements over time.
|
GH_NumberSliderSnappingEditor|
|
GH_PanelEditorControl|
|
GH_QuickImageEditor|
|
GH_RotationalTuningDataT|
Utility class for keeping track of rotational mouse events.
|
GH_SamplingSphere|  Represents a
coloured sphere that can be sampled at various rotations.
|
GH_SettingsCategory|  Base
implementation of IGH_SettingsCategory. Derive from this class and provide an
empty constructor to play ball.
|
GH_Slider|  Provides a standard Grasshopper
slider as a winforms control.
|
GH_Slider_Obsolete|  General
purpose numeric slider.
|
GH_StandardIcons|  Provides access
to a set of standard icons.
|
GH_Tooltip|  Implements a custom Tooltip
class with advanced functionality. All methods and fields are Shared. There
can never be more than one GH_Tooltip.
|
GH_TooltipComponent|  This
component provides Grasshopper tooltip functionality through a winforms
Component.
|
GH_TooltipDisplayEventArgs|
Event arguments used in the Tooltip Component.
|
GH_UnrecognizedObjectsForm|
|
GH_VerticalScrollBar|  Scroll
bar control with floating point accuracy.
|
GH_VerticalSeparator|  GUI
elements for creating visual separations.
|
GH_VoronoiWarningForm|
|
GH_WindowsControlUtil|  Exposes
some static (Shared) utility functions for setting text-rendering properties
en masse.
|
GH_WindowsFormUtil|  Exposes some
static (Shared) utility functions for positioning custom windows.
|
GH_YakDownloadFormEto|
|
GH_YakDownloadFormEtoMissingObjectItem|

Structures

| Structure| Description
---|---|---
|
GH_RotationalFrame|  Represents a
single frame in a rotational tuning history.
|
GH_TrackerFrame|  Represents a single
frame in a mouse-tracker history. A frame represents all relevant mouse and
keyboard data at a given time.

Interfaces

| Interface| Description
---|---|---
|
IGH_Embeddable|  Implement this
interface in your custom control if you want to be called before a menu
commits or cancels.
|
IGH_FileDropTarget|  Implement
this interface in your IGH_DocumentObject if you want to participate in
Drag+Drop events.
|
IGH_SettingCategory|  Represents
a single category in the Settings UI. Implement this interface or derive from
GH_SettingsCategory to add a new Category to the Grasshopper Settings
interface.
|
IGH_SettingFrontend|  Represents
a single setting in the Settings UI. Implement this interface to participate
in the Grasshopper Settings interface.
|
IGH_Tooltip|  Accessor interface for the
Grasshopper Tooltip form.

Delegates

| Delegate| Description
---|---|---
|
GH_AnimatorTInterpolate|
Delegate for interpolating values.
|
GH_AsynchFileDataFileChangedDelegate|
|
GH_ColourPickerColourChangedEventHandler|
|
GH_DigitScrollerValueChangedEventHandler|
|
GH_DocumentEditorAggregateShortcutMenuItemsEventHandler|
|
GH_DocumentEditorEditorFoldStateChangedEventHandler|
|
GH_FontScrollerPostPaint|
|
GH_MaterialPreviewControlColourChangedEventHandler|
|
GH_MaterialPreviewControlMaterialImagePostPaintEventHandler|
|
GH_MaterialPreviewControlSelectedChangedEventHandler|
|
GH_MenuTextBoxKeyDownEventHandler|
|
GH_MenuTextBoxTextChangedEventHandler|
|
GH_SliderValueChangedEventHandler|
|
GH_Slider_ObsoleteValueChangedEventHandler|
|
GH_TooltipComponentPopulateTooltipEventHandler|
|
GH_VerticalScrollBarScrollRatioChangedEventHandler|

Enumerations

| Enumeration| Description
---|---|---
|
GH_AnimationPhase|  Enumerates the
possible phases in which an animation can occur.
|
GH_Constraint|  Constraints used during
UI dragging operations.
|
GH_FadePhase|  Enumerates the possible
states of a ZUI fade animation.
|
GH_Interpolation|  Enumerates the
possible animation progression types.
|
GH_SeparatorDisplay|  Enumerates
all possible display modes for horizontal and vertical separators.
|
GH_SliderInputMode|  Enumerates
all possible slider text input modes.

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com