---
url: https://developer.rhino3d.com/api/grasshopper/html/N_Grasshopper_Documentation.htm#!
scraped_at: 2025-09-08T16:11:53.097808
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Documentation](../html/N_Grasshopper_Documentation.htm
"Grasshopper.Documentation")

[GH_Audience Enumeration](../html/T_Grasshopper_Documentation_GH_Audience.htm
"GH_Audience Enumeration")

[GH_ContentCollection
Class](../html/T_Grasshopper_Documentation_GH_ContentCollection.htm
"GH_ContentCollection Class")

[GH_Format Class](../html/T_Grasshopper_Documentation_GH_Format.htm "GH_Format
Class")

[GH_GlossaryItem
Class](../html/T_Grasshopper_Documentation_GH_GlossaryItem.htm
"GH_GlossaryItem Class")

[GH_Link Class](../html/T_Grasshopper_Documentation_GH_Link.htm "GH_Link
Class")

[GH_List Class](../html/T_Grasshopper_Documentation_GH_List.htm "GH_List
Class")

[GH_Paragraph Class](../html/T_Grasshopper_Documentation_GH_Paragraph.htm
"GH_Paragraph Class")

[GH_Parser Class](../html/T_Grasshopper_Documentation_GH_Parser.htm "GH_Parser
Class")

[GH_RuntimeFile Class](../html/T_Grasshopper_Documentation_GH_RuntimeFile.htm
"GH_RuntimeFile Class")

[GH_Style Enumeration](../html/T_Grasshopper_Documentation_GH_Style.htm
"GH_Style Enumeration")

[GH_Target Enumeration](../html/T_Grasshopper_Documentation_GH_Target.htm
"GH_Target Enumeration")

[GH_Text Class](../html/T_Grasshopper_Documentation_GH_Text.htm "GH_Text
Class")

[GH_Topic Class](../html/T_Grasshopper_Documentation_GH_Topic.htm "GH_Topic
Class")

[IGH_Content Interface](../html/T_Grasshopper_Documentation_IGH_Content.htm
"IGH_Content Interface")

!Click or drag to
resize

# Grasshopper.Documentation Namespace

---

Classes

| Class| Description
---|---|---
|
GH_ContentCollection|
Represents an ordered collection of IGH_Content.
|
GH_Format|  Represents a piece of
formatted content.
|
GH_GlossaryItem|
Represents a single glossary entry in the Grasshopper help.
|
GH_Link|  Represents a link to
another location in the Help or some external address.
|
GH_List|  Represents a list of
items in the Grasshopper help.
|
GH_Paragraph|
|
GH_Parser|  Provides parsing
methods for the Grasshopper Markdown flavour.
|
GH_RuntimeFile|  Runtime
representation of a Grasshopper help file. A GH_RuntimeFile is nothing more
than a collection of keywords with associated content. This class does not
interpret a file or check its validity, it merely figures out the different
content section based on "Keyword:" entries.
|
GH_Text|  Represents a single
string.
|
GH_Topic|  Represents a single
topic in the Grasshopper help.

Interfaces

| Interface| Description
---|---|---
|
IGH_Content|  All parts that
make up documentation content must implement this interface.

Enumerations

| Enumeration| Description
---|---|---
|
GH_Audience|  Enumerates the
pre-defined target audiences used in the Grasshopper documentation.
|
GH_Style|  Enumerates possible
formatting for documentation content.
|
GH_Target|  Enumerates the
possible link targets in Grasshopper documentation.

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com