---
url: https://developer.rhino3d.com/api/grasshopper/html/Overload_Grasshopper_Kernel_GH_DocumentObject_Menu_AppendItem.htm
scraped_at: 2025-09-08T16:26:04.755507
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocumentObject Class](../html/T_Grasshopper_Kernel_GH_DocumentObject.htm
"GH_DocumentObject Class")

[GH_DocumentObject
Methods](../html/Methods_T_Grasshopper_Kernel_GH_DocumentObject.htm
"GH_DocumentObject Methods")

[Menu_AppendItem Method
](../html/Overload_Grasshopper_Kernel_GH_DocumentObject_Menu_AppendItem.htm
"Menu_AppendItem Method ")

[Menu_AppendItem Method (ToolStrip,
String)](../html/M_Grasshopper_Kernel_GH_DocumentObject_Menu_AppendItem.htm
"Menu_AppendItem Method \(ToolStrip, String\)")

[Menu_AppendItem Method (ToolStrip, String,
EventHandler)](../html/M_Grasshopper_Kernel_GH_DocumentObject_Menu_AppendItem_1.htm
"Menu_AppendItem Method \(ToolStrip, String, EventHandler\)")

[Menu_AppendItem Method (ToolStrip, String, EventHandler,
Boolean)](../html/M_Grasshopper_Kernel_GH_DocumentObject_Menu_AppendItem_2.htm
"Menu_AppendItem Method \(ToolStrip, String, EventHandler, Boolean\)")

[Menu_AppendItem Method (ToolStrip, String, EventHandler,
Image)](../html/M_Grasshopper_Kernel_GH_DocumentObject_Menu_AppendItem_4.htm
"Menu_AppendItem Method \(ToolStrip, String, EventHandler, Image\)")

[Menu_AppendItem Method (ToolStrip, String, EventHandler, Boolean,
Boolean)](../html/M_Grasshopper_Kernel_GH_DocumentObject_Menu_AppendItem_3.htm
"Menu_AppendItem Method \(ToolStrip, String, EventHandler, Boolean,
Boolean\)")

[Menu_AppendItem Method (ToolStrip, String, EventHandler, Image,
Object)](../html/M_Grasshopper_Kernel_GH_DocumentObject_Menu_AppendItem_6.htm
"Menu_AppendItem Method \(ToolStrip, String, EventHandler, Image, Object\)")

[Menu_AppendItem Method (ToolStrip, String, EventHandler, Image, Boolean,
Boolean)](../html/M_Grasshopper_Kernel_GH_DocumentObject_Menu_AppendItem_5.htm
"Menu_AppendItem Method \(ToolStrip, String, EventHandler, Image, Boolean,
Boolean\)")

!Click or drag to
resize

# GH_DocumentObjectMenu_AppendItem Method

---

Overload List

| Name| Description
---|---|---
|
Menu_AppendItem(ToolStrip,
String)|  Utility
function for appending generic menu items.
|
Menu_AppendItem(ToolStrip, String,
EventHandler)|
Utility function for appending generic menu items.
|
Menu_AppendItem(ToolStrip, String, EventHandler,
Boolean)|
Utility function for appending generic menu items.
|
Menu_AppendItem(ToolStrip, String, EventHandler,
Image)|
Utility function for appending generic menu items.
|
Menu_AppendItem(ToolStrip, String, EventHandler, Boolean,
Boolean)|
Utility function for appending generic menu items.
|
Menu_AppendItem(ToolStrip, String, EventHandler, Image,
Object)|
Utility function for appending generic menu items.
|
Menu_AppendItem(ToolStrip, String, EventHandler, Image, Boolean,
Boolean)|
Utility function for appending generic menu items.
Top

See Also

#### Reference

GH_DocumentObject Class

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com