---
url: https://developer.rhino3d.com/api/grasshopper/html/Overload_Grasshopper_Kernel_GH_DocumentObject_RecordUndoEvent.htm
scraped_at: 2025-09-08T16:26:05.768782
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocumentObject Class](../html/T_Grasshopper_Kernel_GH_DocumentObject.htm
"GH_DocumentObject Class")

[GH_DocumentObject
Methods](../html/Methods_T_Grasshopper_Kernel_GH_DocumentObject.htm
"GH_DocumentObject Methods")

[RecordUndoEvent Method
](../html/Overload_Grasshopper_Kernel_GH_DocumentObject_RecordUndoEvent.htm
"RecordUndoEvent Method ")

[RecordUndoEvent Method
(GH_UndoRecord)](../html/M_Grasshopper_Kernel_GH_DocumentObject_RecordUndoEvent.htm
"RecordUndoEvent Method \(GH_UndoRecord\)")

[RecordUndoEvent Method
(String)](../html/M_Grasshopper_Kernel_GH_DocumentObject_RecordUndoEvent_1.htm
"RecordUndoEvent Method \(String\)")

[RecordUndoEvent Method (String,
IGH_UndoAction)](../html/M_Grasshopper_Kernel_GH_DocumentObject_RecordUndoEvent_2.htm
"RecordUndoEvent Method \(String, IGH_UndoAction\)")

!Click or drag to
resize

# GH_DocumentObjectRecordUndoEvent Method

---

Overload List

| Name| Description
---|---|---
|
RecordUndoEvent(GH_UndoRecord)|
Record an entire undo record.
|
RecordUndoEvent(String)|
Record a generic object change undo event.
| RecordUndoEvent(String,
IGH_UndoAction)|
Record a specific object change undo event.
Top

See Also

#### Reference

GH_DocumentObject Class

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com