---
url: https://developer.rhino3d.com/api/grasshopper/html/P_Grasshopper_Kernel_IGH_DocumentObject_ComponentGuid.htm
scraped_at: 2025-09-08T16:25:15.552162
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_DocumentObject
Interface](../html/T_Grasshopper_Kernel_IGH_DocumentObject.htm
"IGH_DocumentObject Interface")

[IGH_DocumentObject
Properties](../html/Properties_T_Grasshopper_Kernel_IGH_DocumentObject.htm
"IGH_DocumentObject Properties")

[Attributes Property
](../html/P_Grasshopper_Kernel_IGH_DocumentObject_Attributes.htm "Attributes
Property ")

[ComponentGuid Property
](../html/P_Grasshopper_Kernel_IGH_DocumentObject_ComponentGuid.htm
"ComponentGuid Property ")

[Exposure Property
](../html/P_Grasshopper_Kernel_IGH_DocumentObject_Exposure.htm "Exposure
Property ")

[Icon_24x24 Property
](../html/P_Grasshopper_Kernel_IGH_DocumentObject_Icon_24x24.htm "Icon_24x24
Property ")

[Icon_24x24_Locked Property
](../html/P_Grasshopper_Kernel_IGH_DocumentObject_Icon_24x24_Locked.htm
"Icon_24x24_Locked Property ")

[IconDisplayMode Property
](../html/P_Grasshopper_Kernel_IGH_DocumentObject_IconDisplayMode.htm
"IconDisplayMode Property ")

[Obsolete Property
](../html/P_Grasshopper_Kernel_IGH_DocumentObject_Obsolete.htm "Obsolete
Property ")

!Click or drag to
resize

# IGH_DocumentObjectComponentGuid Property

---

Returns a consistent ID for this object type. Every object must supply a
unique and unchanging ID that is used to identify objects of the same type.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    Guid ComponentGuid { get; }

    ReadOnly Property ComponentGuid As Guid
    	Get

#### Property Value

Type: Guid

[Missing <value> documentation for
"P:Grasshopper.Kernel.IGH_DocumentObject.ComponentGuid"]

See Also

#### Reference

IGH_DocumentObject Interface

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com