---
url: https://developer.rhino3d.com/api/grasshopper/html/P_Grasshopper_Kernel_GH_Component_Message.htm
scraped_at: 2025-09-08T16:26:00.731863
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_Component Class](../html/T_Grasshopper_Kernel_GH_Component.htm
"GH_Component Class")

[GH_Component
Properties](../html/Properties_T_Grasshopper_Kernel_GH_Component.htm
"GH_Component Properties")

[ClippingBox Property
](../html/P_Grasshopper_Kernel_GH_Component_ClippingBox.htm "ClippingBox
Property ")

[HelpDescription Property
](../html/P_Grasshopper_Kernel_GH_Component_HelpDescription.htm
"HelpDescription Property ")

[Hidden Property ](../html/P_Grasshopper_Kernel_GH_Component_Hidden.htm
"Hidden Property ")

[InConstructor Property
](../html/P_Grasshopper_Kernel_GH_Component_InConstructor.htm "InConstructor
Property ")

[InstanceDescription Property
](../html/P_Grasshopper_Kernel_GH_Component_InstanceDescription.htm
"InstanceDescription Property ")

[IsBakeCapable Property
](../html/P_Grasshopper_Kernel_GH_Component_IsBakeCapable.htm "IsBakeCapable
Property ")

[IsDataProvider Property
](../html/P_Grasshopper_Kernel_GH_Component_IsDataProvider.htm "IsDataProvider
Property ")

[IsPreviewCapable Property
](../html/P_Grasshopper_Kernel_GH_Component_IsPreviewCapable.htm
"IsPreviewCapable Property ")

[IsValidPrincipalParameterIndex Property
](../html/P_Grasshopper_Kernel_GH_Component_IsValidPrincipalParameterIndex.htm
"IsValidPrincipalParameterIndex Property ")

[Locked Property ](../html/P_Grasshopper_Kernel_GH_Component_Locked.htm
"Locked Property ")

[Message Property ](../html/P_Grasshopper_Kernel_GH_Component_Message.htm
"Message Property ")

[Params Property ](../html/P_Grasshopper_Kernel_GH_Component_Params.htm
"Params Property ")

[PrincipalParameterIndex Property
](../html/P_Grasshopper_Kernel_GH_Component_PrincipalParameterIndex.htm
"PrincipalParameterIndex Property ")

[ProcessorTime Property
](../html/P_Grasshopper_Kernel_GH_Component_ProcessorTime.htm "ProcessorTime
Property ")

[RunCount Property ](../html/P_Grasshopper_Kernel_GH_Component_RunCount.htm
"RunCount Property ")

[RuntimeMessageLevel Property
](../html/P_Grasshopper_Kernel_GH_Component_RuntimeMessageLevel.htm
"RuntimeMessageLevel Property ")

!Click or drag to
resize

# GH_ComponentMessage Property

---

Gets or sets a custom message to be displayed underneath the component. This
message is not serialized and should be assigned on every solution anew.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public string Message { get; set; }

    Public Property Message As String
    	Get
    	Set

#### Property Value

Type: String

[Missing <value> documentation for
"P:Grasshopper.Kernel.GH_Component.Message"]

#### Implements

IGH_ComponentMessage

See Also

#### Reference

GH_Component Class

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com