---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Types_GH_Item.htm
scraped_at: 2025-09-08T16:10:54.918653
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Types

GH_Item Class

[GH_Item Constructor ](../html/Overload_GH_IO_Types_GH_Item__ctor.htm "GH_Item
Constructor ")

[GH_Item Properties](../html/Properties_T_GH_IO_Types_GH_Item.htm "GH_Item
Properties")

GH_Item Methods

!Click or drag to
resize

# GH_Item Class

---

Represents a single data item in a chunk.

Inheritance Hierarchy

SystemObject
GH_IO.TypesGH_Item

**Namespace:** GH_IO.Types
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public class GH_Item : GH_IBinarySupport, GH_IXmlSupport

    Public Class GH_Item
    	Implements GH_IBinarySupport, GH_IXmlSupport

The GH_Item type exposes the following members.

Constructors

| Name| Description
---|---|---
| GH_Item(String,
GH_BoundingBox)|  Construct a new instance
of GH_Item with the specified name and value.
| GH_Item(String,
GH_Interval1D)|  Construct a new instance
of GH_Item with the specified name and value.
| GH_Item(String,
GH_Interval2D)|  Construct a new instance
of GH_Item with the specified name and value.
| GH_Item(String,
GH_Line)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
GH_Plane)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
GH_Point2D)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
GH_Point3D)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
GH_Point4D)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
GH_Version)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Boolean)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Byte)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Byte)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
DateTime)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Decimal)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Double)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Double)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Bitmap)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Color)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Point)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
PointF)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Rectangle)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
RectangleF)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Size)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
SizeF)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Guid)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Int32)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Int64)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
Single)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String,
String)|  Construct a new instance of
GH_Item with the specified name and value.
| GH_Item(String, Int32,
GH_BoundingBox)|  Construct a new
instance of GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
GH_Interval1D)|  Construct a new instance
of GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
GH_Interval2D)|  Construct a new instance
of GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
GH_Line)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
GH_Plane)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
GH_Point2D)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
GH_Point3D)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
GH_Point4D)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
GH_Version)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Boolean)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Byte)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Byte)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
DateTime)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Decimal)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Double)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Double)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Bitmap)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Color)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Point)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
PointF)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Rectangle)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
RectangleF)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Size)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
SizeF)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Guid)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Int32)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Int64)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
Single)|  Construct a new instance of
GH_Item with the specified name, index and value.
| GH_Item(String, Int32,
String)|  Construct a new instance of
GH_Item with the specified name, index and value.
Top

Properties

| Name| Description
---|---|---
|
_bool|  Returns the internal data of this
item cast to a Boolean. If the data is not stored as a Boolean, a conversion
exception might be thrown.
|
_boundingbox|  Returns the internal
data of this item cast to a BoundingBox. If the data is not stored as a
BoundingBox, a conversion exception might be thrown.
|
_byte|  Returns the internal data of this
item cast to a Byte. If the data is not stored as a Byte, a conversion
exception might be thrown.
|
_bytearray|  Returns the internal data
of this item cast to a Byte array. If the data is not stored as a Byte array,
a conversion exception might be thrown.
|
_date|  Returns the internal data of this
item cast to a DateTime. If the data is not stored as a DateTime, a conversion
exception might be thrown.
|
_decimal|  Returns the internal data of
this item cast to a Decimal. If the data is not stored as a Decimal, a
conversion exception might be thrown.
|
_double|  Returns the internal data of
this item cast to a Double. If the data is not stored as a Double, a
conversion exception might be thrown.
|
_doublearray|  Returns the internal
data of this item cast to a Byte array. If the data is not stored as a Byte
array, a conversion exception might be thrown.
|
_drawing_bitmap|  Returns the
internal data of this item cast to a Bitmap. If the data is not stored as a
Bitmap, a conversion exception might be thrown.
|
_drawing_color|  Returns the
internal data of this item cast to a Color. If the data is not stored as a
Color, a conversion exception might be thrown.
|
_drawing_point|  Returns the
internal data of this item cast to a Point. If the data is not stored as a
Point, a conversion exception might be thrown.
|
_drawing_pointf|  Returns the
internal data of this item cast to a PointF. If the data is not stored as a
PointF, a conversion exception might be thrown.
|
_drawing_rectangle|  Returns
the internal data of this item cast to a Rectangle. If the data is not stored
as a Rectangle, a conversion exception might be thrown.
|
_drawing_rectanglef|  Returns
the internal data of this item cast to a RectangleF. If the data is not stored
as a RectangleF, a conversion exception might be thrown.
|
_drawing_size|  Returns the
internal data of this item cast to a Size. If the data is not stored as a
Size, a conversion exception might be thrown.
|
_drawing_sizef|  Returns the
internal data of this item cast to a SizeF. If the data is not stored as a
SizeF, a conversion exception might be thrown.
|
_guid|  Returns the internal data of this
item cast to a Guid. If the data is not stored as a Guid, a conversion
exception might be thrown.
|
_int32|  Returns the internal data of this
item cast to an Int32. If the data is not stored as an Int32, a conversion
exception might be thrown.
|
_int64|  Returns the internal data of this
item cast to an Int64. If the data is not stored as an Int64, a conversion
exception might be thrown.
|
_interval1d|  Returns the internal
data of this item cast to an Interval1D. If the data is not stored as an
Interval1D, a conversion exception might be thrown.
|
_interval2d|  Returns the internal
data of this item cast to an Interval2D. If the data is not stored as an
Interval2D, a conversion exception might be thrown.
|
_line|  Returns the internal data of this
item cast to a Line. If the data is not stored as a Line, a conversion
exception might be thrown.
|
_plane|  Returns the internal data of this
item cast to a Plane. If the data is not stored as a Plane, a conversion
exception might be thrown.
|
_point2d|  Returns the internal data of
this item cast to a Point2D. If the data is not stored as a Point2D, a
conversion exception might be thrown.
|
_point3d|  Returns the internal data of
this item cast to a Point3D. If the data is not stored as a Point3D, a
conversion exception might be thrown.
|
_point4d|  Returns the internal data of
this item cast to a Point4D. If the data is not stored as a Point4D, a
conversion exception might be thrown.
|
_single|  Returns the internal data of
this item cast to a Single. If the data is not stored as a Single, a
conversion exception might be thrown.
|
_string|  Returns the internal data of
this item cast to a String. If the data is not stored as a String, a
conversion exception might be thrown.
|
_version|  Returns the internal data of
this item cast to a Version. If the data is not stored as a Version, a
conversion exception might be thrown.
|
HasIndex|  Gets the index existence
implication. The item is considered to have an index qualifier if the index
value is larger than or equal to zero.
|
HasName|  Gets the name validity of this
item. The item is considered to have an invalid name if
string.IsNullOrEmpty(name)
|
HasType|  Gets the type set validity of
this item. The item is considered to have a type if type != GH_Types.unset
|
Index|  Gets or sets the index of an item.
Typically, indices are set at construction and do not change. If you change
indices after construction, you could corrupt an archive.
|
InternalData|  Retrieves the
internal data of this item. No type casting is performed.
|
Name|  Gets or sets the name of this item.
Typically, names are set at construction and do not change. If you change
names after construction, you could corrupt an archive.
|
Type|  Gets the type of this item. Type
flags are set during construction and cannot be altered.
Top

Methods

| Name| Description
---|---|---
|
CreateFrom(BinaryReader)|  Creates a
new instance of GH_Item and sets the fields from a reader object.
|
CreateFrom(XmlNode)|  Creates a new
instance of GH_Item and sets the fields from an Xml node object.
|
Read(BinaryReader)|  Deserialize this item
from a binary stream.
|
Read(XmlNode)|  Deserialize this item from
an Xml node.
|
ToString|  Converts the struct into a
human readable format.  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write(BinaryWriter)|  Serialize this item
into a binary stream.
|
Write(XmlWriter)|  Serialize this item
into an Xml stream.
Top

See Also

#### Reference

GH_IO.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com