---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Serialization_GH_Compression.htm
scraped_at: 2025-09-08T16:10:40.832517
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Serialization

[GH_Compression Class](../html/T_GH_IO_Serialization_GH_Compression.htm
"GH_Compression Class")

[GH_Compression
Methods](../html/Methods_T_GH_IO_Serialization_GH_Compression.htm
"GH_Compression Methods")

!Click or drag to
resize

# GH_Compression Class

---

Provides static methods for compression of byte-arrays.

Inheritance Hierarchy

SystemObject
GH_IO.SerializationGH_Compression

**Namespace:** GH_IO.Serialization
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public sealed class GH_Compression

    Public NotInheritable Class GH_Compression

The GH_Compression type exposes the following members.

Methods

| Name| Description
---|---|---
|
Compress|  Compress an
array of bytes using the Deflate algorithm.
|
Decompress|  Decompress
an array of bytes using the Deflate algorithm.
Top

See Also

#### Reference

GH_IO.Serialization Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com