---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Types_GH_BoundingBox.htm
scraped_at: 2025-09-08T16:10:51.865208
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Types

[GH_BoundingBox Structure](../html/T_GH_IO_Types_GH_BoundingBox.htm
"GH_BoundingBox Structure")

[GH_BoundingBox Constructor
](../html/Overload_GH_IO_Types_GH_BoundingBox__ctor.htm "GH_BoundingBox
Constructor ")

[GH_BoundingBox Methods](../html/Methods_T_GH_IO_Types_GH_BoundingBox.htm
"GH_BoundingBox Methods")

[GH_BoundingBox Fields](../html/Fields_T_GH_IO_Types_GH_BoundingBox.htm
"GH_BoundingBox Fields")

!Click or drag to
resize

# GH_BoundingBox Structure

---

Represents a 3D bounding box, denoted by two points.

**Namespace:** GH_IO.Types
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public struct GH_BoundingBox

    Public Structure GH_BoundingBox

The GH_BoundingBox type exposes the following members.

Constructors

| Name| Description
---|---|---
| GH_BoundingBox(GH_Point3D,
GH_Point3D)|  Constructor.
| GH_BoundingBox(Double, Double,
Double, Double, Double, Double)|
Constructor.
Top

Methods

| Name| Description
---|---|---
|
ToString|  Converts this
structure to a human-readable string.  (Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Fields

| Name| Description
---|---|---
|
Max|  Maximum corner of box.
|
Min|  Minimum corner of box.
Top

See Also

#### Reference

GH_IO.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com