---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Types_GH_Point4D.htm
scraped_at: 2025-09-08T16:10:59.905849
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Types

[GH_Point4D Structure](../html/T_GH_IO_Types_GH_Point4D.htm "GH_Point4D
Structure")

[GH_Point4D Constructor ](../html/M_GH_IO_Types_GH_Point4D__ctor.htm
"GH_Point4D Constructor ")

[GH_Point4D Methods](../html/Methods_T_GH_IO_Types_GH_Point4D.htm "GH_Point4D
Methods")

[GH_Point4D Fields](../html/Fields_T_GH_IO_Types_GH_Point4D.htm "GH_Point4D
Fields")

!Click or drag to
resize

# GH_Point4D Structure

---

Represents a 4D point coordinate with double precision floating point
components.

**Namespace:** GH_IO.Types
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public struct GH_Point4D

    Public Structure GH_Point4D

The GH_Point4D type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Point4D|  Constructor.
Top

Methods

| Name| Description
---|---|---
|
ToString|  Converts this structure to
a human-readable string.  (Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Fields

| Name| Description
---|---|---
| w|
W coordinate of point.
| x|
X coordinate of point.
| y|
Y coordinate of point.
| z|
Z coordinate of point.
Top

See Also

#### Reference

GH_IO.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com