---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Types_GH_Interval2D.htm
scraped_at: 2025-09-08T16:10:53.872943
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Types

[GH_Interval2D Structure](../html/T_GH_IO_Types_GH_Interval2D.htm
"GH_Interval2D Structure")

[GH_Interval2D Constructor
](../html/Overload_GH_IO_Types_GH_Interval2D__ctor.htm "GH_Interval2D
Constructor ")

[GH_Interval2D Methods](../html/Methods_T_GH_IO_Types_GH_Interval2D.htm
"GH_Interval2D Methods")

[GH_Interval2D Fields](../html/Fields_T_GH_IO_Types_GH_Interval2D.htm
"GH_Interval2D Fields")

!Click or drag to
resize

# GH_Interval2D Structure

---

Represents two double precision domains.

**Namespace:** GH_IO.Types
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public struct GH_Interval2D

    Public Structure GH_Interval2D

The GH_Interval2D type exposes the following members.

Constructors

| Name| Description
---|---|---
| GH_Interval2D(GH_Interval1D,
GH_Interval1D)|  Constructor.
| GH_Interval2D(Double, Double,
Double, Double)|  Constructor.
Top

Methods

| Name| Description
---|---|---
|
ToString|  Converts this structure
to a human-readable string.  (Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Fields

| Name| Description
---|---|---
|
u|  One dimensional component in U
direction.
|
v|  One dimensional component in V
direction.
Top

See Also

#### Reference

GH_IO.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com