---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Serialization_GH_Archive.htm
scraped_at: 2025-09-08T16:10:37.823038
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Serialization

[GH_Archive Class](../html/T_GH_IO_Serialization_GH_Archive.htm "GH_Archive
Class")

[GH_Archive Constructor ](../html/M_GH_IO_Serialization_GH_Archive__ctor.htm
"GH_Archive Constructor ")

[GH_Archive
Properties](../html/Properties_T_GH_IO_Serialization_GH_Archive.htm
"GH_Archive Properties")

[GH_Archive Methods](../html/Methods_T_GH_IO_Serialization_GH_Archive.htm
"GH_Archive Methods")

!Click or drag to
resize

# GH_Archive Class

---

This is the base archive class which takes care of all (de)serialization and
messaging.

Inheritance Hierarchy

SystemObject
GH_IO.SerializationGH_Archive

**Namespace:** GH_IO.Serialization
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public class GH_Archive

    Public Class GH_Archive

The GH_Archive type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Archive| Initializes a new
instance of the GH_Archive class
Top

Properties

| Name| Description
---|---|---
|
FileName|  Gets the filename
(without extension) of the currently loaded data tree. If the path field has
not been set, "unnamed" is returned.
|
GetRootNode|  Gets the
root node of this archive. Typically you do not need to modify the Root. Use
functions like CreateTopLevelNode(), AppendObject() and ExtractObject()
instead. If you modify the Root node, you may corrupt the archive.
!Static
member|
GH_IO_Version|  Gets the
version number of the current GH_IO build.
!Static
member|
GrasshopperBinaryExtension|
Gets the file extension (including the dot) associated with Grasshopper®
Binary data.
!Static
member|
GrasshopperUserExtension|
Gets the file extension (including the dot) associated with Grasshopper® User
Object file.
!Static
member|
GrasshopperXmlExtension|
Gets the file extension (including the dot) associated with Grasshopper® XML
data.
|
IsBinaryPath|  Gets a
value that indicates whether the Path field points to a Binary Grasshopper
file.
|
IsPath|  Gets a value that
indicates whether or not the path field has been set.
|
IsXmlPath|  Gets a value
that indicates whether the Path field points to an Xml Grasshopper file.
|
Messages|  Gets the internal
list of messages.
|
Path|  Gets the path to the file
from which this archive was read and/or written to. If the archive hasn't been
read or written yet, this field will be null.
|
WorstCaseMessageType|
Gets the worst case message type. If the record contains at least 1 error, the
worst case is GH_Message_Type.error. If the record contains no errors, but at
least 1 warning, the worst case is GH_Message_Type.warning. If the record
contains no messages or only infos, the worst case type is
GH_Message_Type.info.
Top

Methods

| Name| Description
---|---|---
|
AddMessage(GH_Message)|
Add a new message to the record.
| AddMessage(String,
GH_Message_Type)|  Add a
new message to the record.
!Code
example|
AppendObject|  Appends a
target object into the root node of this archive tree. If the root doesn't
exist yet, it will be created. Existing objects at the root scope will not be
affected.
|
ClearMessages|  Remove
all messages from the log.
|
CreateNewRoot|  Discards
the current data tree and instantiates a new root node. This root node
contains some comments, a version value containing the current version of
GH_IO.dll and a DateTime value containing the current date and time.
|
CreateTopLevelNode|
Creates and returns a new root node for this archive in the form of a
GH_IWriter instance. Typically you do not call this method. If you want to add
an object to the archive, use AppendObject() instead.
|
Deserialize_Binary|
Deserializes an array of bytes.
|
Deserialize_Xml|
Deserializes an Xml string.
|
ExtractObject|  Extract
a target object from the data tree.
|
MessageCount|  Gets the
number of messages recorded since the most recent IO operation began.
| MessageCount(Boolean, Boolean,
Boolean)|  Gets the
number of messages recorded since the most recent IO operation began. Message
count can be filtered by message type.
|
OpenFileDialog|
Displays a standard OpenFileDialog with all the fields set to cater for
Grasshopper files.
|
ReadFromFile|  Reads a
new archive tree from a file.
|
SaveFileDialog|
Displays a standard SaveFileDialog with all the fields set to cater for
Grasshopper files.
|
Serialize_Binary|
Serializes the data tree into a Binary byte array.
|
Serialize_Xml|
Serializes the data tree into an Xml string.
|
ShowMessageLog|
Displays the message log viewer. You should typically only display the viewer
if the WorstCaseMessageType equals GH_Message_Type.warning or
GH_Message_Type.error
|
WriteToFile|  Writes the
current tree to a file.
Top

See Also

#### Reference

GH_IO.Serialization Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com