---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Serialization_GH_IXmlSupport.htm
scraped_at: 2025-09-08T16:10:45.832771
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Serialization

[GH_IXmlSupport Interface](../html/T_GH_IO_Serialization_GH_IXmlSupport.htm
"GH_IXmlSupport Interface")

[GH_IXmlSupport
Methods](../html/Methods_T_GH_IO_Serialization_GH_IXmlSupport.htm
"GH_IXmlSupport Methods")

!Click or drag to
resize

# GH_IXmlSupport Interface

---

Interface which declares all methods required for objects that can be
(de)serialized to and from an Xml archive.

**Namespace:** GH_IO.Serialization
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public interface GH_IXmlSupport

    Public Interface GH_IXmlSupport

The GH_IXmlSupport type exposes the following members.

Methods

| Name| Description
---|---|---
|
Read|  Called when an object
is required to deserialize itself.
|
Write|  Called when an
object is required to serialize itself.
Top

See Also

#### Reference

GH_IO.Serialization Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com