---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Serialization_GH_Message.htm
scraped_at: 2025-09-08T16:10:47.840243
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Serialization

[GH_Message Class](../html/T_GH_IO_Serialization_GH_Message.htm "GH_Message
Class")

[GH_Message Constructor
](../html/Overload_GH_IO_Serialization_GH_Message__ctor.htm "GH_Message
Constructor ")

[GH_Message
Properties](../html/Properties_T_GH_IO_Serialization_GH_Message.htm
"GH_Message Properties")

!Click or drag to
resize

# GH_Message Class

---

Represents an archive log message. Messages are collected during read/write
operations.

Inheritance Hierarchy

SystemObject
GH_IO.SerializationGH_Message

**Namespace:** GH_IO.Serialization
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public class GH_Message

    Public Class GH_Message

The GH_Message type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Message|  Fake constructor to
avoid new instances being created by a PropertyGrid.
|
GH_Message(String)|  Create a
new message of type GH_Message_Type.info
| GH_Message(String,
GH_Message_Type)|  Create a new
message.
Top

Properties

| Name| Description
---|---|---
|
Message|  Gets the text
content of this message.
|
Type|  Gets the type of this
message.
Top

See Also

#### Reference

GH_IO.Serialization Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com