---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Serialization_ID.htm
scraped_at: 2025-09-08T16:10:49.861867
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Serialization

ID Structure

[ID Constructor ](../html/Overload_GH_IO_Serialization_ID__ctor.htm "ID
Constructor ")

[ID Properties](../html/Properties_T_GH_IO_Serialization_ID.htm "ID
Properties")

ID Methods

!Click or drag to
resize

# ID Structure

---

An ID is used to uniquely identify a specific item.

**Namespace:** GH_IO.Serialization
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public struct ID : IComparable<ID>, IEquatable<ID>

    Public Structure ID
    	Implements IComparable(Of ID), IEquatable(Of ID)

The ID type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ID(String)|  Constuctor for IDs.
| ID(String,
Int32)|  Constructor for IDs.
Top

Properties

| Name| Description
---|---|---
|
Hash|  Gets the hash code.
|
HasIndex|  Gets whether the index has
been set.
|
HasName|  Gets whether the name has
been set. Every valid ID must have a name.
|
Index|  Gets the index of this ID, if
there is no valid index then -1 is returned.
|
Name|  Gets the name of this ID.
Top

Methods

| Name| Description
---|---|---
|
CompareTo|  Compares this ID to
another ID.
|
Equals|  Determines if two IDs are
equal.
|
GetHashCode|  Gets the hash code.
(Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
|
ToString|  Gets a string
representation for this ID.  (Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

See Also

#### Reference

GH_IO.Serialization Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com