---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_UserInterface_GH_ArchiveMessageViewer.htm
scraped_at: 2025-09-08T16:11:03.941364
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.UserInterface

[GH_ArchiveMessageViewer
Class](../html/T_GH_IO_UserInterface_GH_ArchiveMessageViewer.htm
"GH_ArchiveMessageViewer Class")

[GH_ArchiveMessageViewer Constructor
](../html/M_GH_IO_UserInterface_GH_ArchiveMessageViewer__ctor.htm
"GH_ArchiveMessageViewer Constructor ")

[GH_ArchiveMessageViewer
Methods](../html/Methods_T_GH_IO_UserInterface_GH_ArchiveMessageViewer.htm
"GH_ArchiveMessageViewer Methods")

!Click or drag to
resize

# GH_ArchiveMessageViewer Class

---

Viewer/Browser that displays a list of archive messages.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsForm
GH_IO.UserInterfaceGH_ArchiveMessageViewer

**Namespace:** GH_IO.UserInterface
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public class GH_ArchiveMessageViewer : Form

    Public Class GH_ArchiveMessageViewer
    	Inherits Form

The GH_ArchiveMessageViewer type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ArchiveMessageViewer|
Constructor.
Top

Methods

| Name| Description
---|---|---
|
Dispose|  Clean
up any resources being used.  (Overrides
[FormDispose(Boolean)](https://docs.microsoft.com/dotnet/api/system.windows.forms.form.dispose#system-
windows-forms-form-dispose\(system-boolean\)).)
|
SetArchive|
Set a new archive. The messages in this archive will be displayed on the form.
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto| Overloaded. (Defined by
EtoExtensions.)
|
ToEto| Overloaded. (Defined by
EtoExtensions.)
Top

See Also

#### Reference

GH_IO.UserInterface Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com