---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Serialization_GH_Chunk_ChunkKeyedCollection.htm
scraped_at: 2025-09-08T16:10:39.813115
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Serialization

[GH_Chunk.ChunkKeyedCollection
Class](../html/T_GH_IO_Serialization_GH_Chunk_ChunkKeyedCollection.htm
"GH_Chunk.ChunkKeyedCollection Class")

[GH_Chunk.ChunkKeyedCollection Constructor
](../html/M_GH_IO_Serialization_GH_Chunk_ChunkKeyedCollection__ctor.htm
"GH_Chunk.ChunkKeyedCollection Constructor ")

[ChunkKeyedCollection
Properties](../html/Properties_T_GH_IO_Serialization_GH_Chunk_ChunkKeyedCollection.htm
"ChunkKeyedCollection Properties")

[ChunkKeyedCollection
Methods](../html/Methods_T_GH_IO_Serialization_GH_Chunk_ChunkKeyedCollection.htm
"ChunkKeyedCollection Methods")

!Click or drag to
resize

# GH_ChunkChunkKeyedCollection Class

---

Represents a collection of chunks with associated IDs

Inheritance Hierarchy

SystemObject
GH_IO.SerializationGH_ChunkChunkKeyedCollection

**Namespace:** GH_IO.Serialization
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public class ChunkKeyedCollection : IEnumerable<GH_Chunk>,
    	IEnumerable

    Public Class ChunkKeyedCollection
    	Implements IEnumerable(Of GH_Chunk), IEnumerable

The GH_ChunkChunkKeyedCollection type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ChunkChunkKeyedCollection|
Create a new collection.
Top

Properties

| Name| Description
---|---|---
|
Count|
Returns the amount in the collection.
Top

Methods

| Name| Description
---|---|---
|
Add|  Adds a
new chunk.
|
Clear|
Removes all chunks from the collection.
|
GetEnumerator|
Gets an enumerator that iterates over all chunks in the collection.
|
Remove(GH_Chunk)|
Removes a chunk.
|
Remove(ID)|
Removes an ID.
|
TryGetValue|
Try and find the chunk that belongs to a given ID.
Top

See Also

#### Reference

GH_IO.Serialization Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com