---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Types_GH_Version.htm
scraped_at: 2025-09-08T16:11:01.915086
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Types

[GH_Version Structure](../html/T_GH_IO_Types_GH_Version.htm "GH_Version
Structure")

[GH_Version Constructor ](../html/Overload_GH_IO_Types_GH_Version__ctor.htm
"GH_Version Constructor ")

[GH_Version Methods](../html/Methods_T_GH_IO_Types_GH_Version.htm "GH_Version
Methods")

[GH_Version Operators](../html/Operators_T_GH_IO_Types_GH_Version.htm
"GH_Version Operators")

[GH_Version Fields](../html/Fields_T_GH_IO_Types_GH_Version.htm "GH_Version
Fields")

!Click or drag to
resize

# GH_Version Structure

---

Basic version type. Contains Major, Minor and Revision fields.

**Namespace:** GH_IO.Types
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public struct GH_Version

    Public Structure GH_Version

The GH_Version type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Version(GH_Version)|  Copy
constructor. Duplicate an existing version structure.
| GH_Version(Int32, Int32,
Int32)|  Default constructor. Create a
new version from specified fields.
Top

Methods

| Name| Description
---|---|---
|
Equals|  Performs value equality
comparison.  (Overrides
[ValueTypeEquals(Object)](https://docs.microsoft.com/dotnet/api/system.valuetype.equals#system-
valuetype-equals\(system-object\)).)
|
GetHashCode|  Returns the hash
code for this instance.  (Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
|
ToString|  Default formatter for
Version data: M.m.RRRR Revision section is padded with zeroes until it is at
least 4 digits long.  (Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Operators

| Name| Description
---|---|---
!Static
member|
Equality|  Compares two version
structures for equality.
!Static
member|
GreaterThan|  Compares versions
for larger than relationships.
!Static
member|
GreaterThanOrEqual|
Compares versions for larger than or equal to relationships.
!Static
member|
Inequality|  Compares two
version structures for inequality.
!Static
member|
LessThan|  Compares versions for
smaller than relationships.
!Static
member|
LessThanOrEqual|  Compares
versions for smaller than or equal to relationships.
Top

Fields

| Name| Description
---|---|---
|
major|  Major component of version
structure.
|
minor|  Minor component of version
structure.
|
revision|  Revision component of
version structure.
Top

See Also

#### Reference

GH_IO.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com