---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_UserInterface_GH_DeveloperDetails.htm
scraped_at: 2025-09-08T16:11:04.922699
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.UserInterface

[GH_DeveloperDetails
Class](../html/T_GH_IO_UserInterface_GH_DeveloperDetails.htm
"GH_DeveloperDetails Class")

[GH_DeveloperDetails
Properties](../html/Properties_T_GH_IO_UserInterface_GH_DeveloperDetails.htm
"GH_DeveloperDetails Properties")

!Click or drag to
resize

# GH_DeveloperDetails Class

---

Constains a set of static fields and properties regarding developer contact
details.

Inheritance Hierarchy

SystemObject
GH_IO.UserInterfaceGH_DeveloperDetails

**Namespace:** GH_IO.UserInterface
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public abstract class GH_DeveloperDetails

    Public MustInherit Class GH_DeveloperDetails

The GH_DeveloperDetails type exposes the following members.

Properties

| Name| Description
---|---|---
!Static
member|
DefaultDeveloperContact|
Gets the default developer contact details.
!Static
member|
DeveloperContact|
Gets or sets the local developer contact info (e-mail). By default, the
developer email is DefaultDeveloperContact; This email address is used in the
Message Report viewer when sending a support e-mail.
Top

See Also

#### Reference

GH_IO.UserInterface Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com