---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Serialization_GH_IWriter.htm
scraped_at: 2025-09-08T16:10:44.857267
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Serialization

[GH_IWriter Interface](../html/T_GH_IO_Serialization_GH_IWriter.htm
"GH_IWriter Interface")

[GH_IWriter
Properties](../html/Properties_T_GH_IO_Serialization_GH_IWriter.htm
"GH_IWriter Properties")

[GH_IWriter Methods](../html/Methods_T_GH_IO_Serialization_GH_IWriter.htm
"GH_IWriter Methods")

!Click or drag to
resize

# GH_IWriter Interface

---

Provides access to a subset of GH_Chunk methods used for writing archives.

**Namespace:** GH_IO.Serialization
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public interface GH_IWriter : GH_IChunk,
    	GH_IBinarySupport, GH_IXmlSupport

    Public Interface GH_IWriter
    	Inherits GH_IChunk, GH_IBinarySupport, GH_IXmlSupport

The GH_IWriter type exposes the following members.

Properties

| Name| Description
---|---|---
|
Archive|  Gets a pointer to the
archive that owns the Root of the tree this chunk belongs to.  (Inherited from
GH_IChunk.)
|
ArchiveLocation|  Gets
a string representing the URI with which the archive is associated. The
location may be a null string.  (Inherited from
GH_IChunk.)
|
ChunkCount|  Gets the number
of child chunks contained in this chunk. The set of all child chunks is
referred to as a 'litter'.  (Inherited from
GH_IChunk.)
|
Chunks|  Gets a pointer to the
internal list of child chunks. Do not access this list unless you know what
you are doing.  (Inherited from
GH_IChunk.)
|
Index|  Gets the index of this
chunk. The index is set by the owner of this chunk. Indices smaller than zero
imply no index has been set. The combination of name+index is always unique
among a set of chunks in the same litter.  (Inherited from
GH_IChunk.)
|
ItemCount|  Gets the number
of items contained in this chunk.  (Inherited from
GH_IChunk.)
|
Items|  Gets a pointer to the
internal list of items. Do not access this list unless you know what you are
doing.  (Inherited from GH_IChunk.)
|
Name|  Gets the name of this
chunk. The name is set by the owner of this chunk. Names must be at least 1
character long. The combination of name+index is always unique among a set of
chunks in a single litter.  (Inherited from
GH_IChunk.)
Top

Methods

| Name| Description
---|---|---
|
AddComment|  Adds a text
comment to this chunk. Comments are serialized only if the output flavour is a
human readable format. Comments are never deserialized, they are purely for
the benefit of the humans reading the file data.
|
AddMessage|  Log a new
message with the top-level archive. Messages are collected during read/write
operations, and can be displayed to the user upon completion using
GH_Archive.ShowMessageLog().  (Inherited from
GH_IChunk.)
|
CreateChunk(String)|
Create a new child chunk with the specified name but without an index
qualifier. If another chunk already exists with similar properties, an
exception will be thrown.
| CreateChunk(String,
Int32)|  Create a new
child chunk with the specified name and index qualifier. If another chunk
already exists with similar properties, an exception will be thrown.
|
Read(BinaryReader)|
Called when an object is required to deserialize itself.  (Inherited from
GH_IBinarySupport.)
|
Read(XmlNode)|  Called when
an object is required to deserialize itself.  (Inherited from
GH_IXmlSupport.)
|
RemoveChunk(GH_IChunk)|
Remove the specified chunk from the litter.
|
RemoveChunk(String)|
Remove the first chunk with a matching name. Only chunks without index
qualifiers are considered. Name comparisons are not case-sensitive.
| RemoveChunk(String,
Int32)|  Remove the first
chunk with a matching name and index. Only chunks with index qualifiers are
considered. Name comparisons are not case-sensitive.
|
RemoveItem(String)|  Remove
an unindexed item from this chunk.
| RemoveItem(String,
Int32)|  Remove an indexed
item from this chunk.
| SetBoolean(String,
Boolean)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetBoolean(String, Int32,
Boolean)|  Add a new data
item to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetBoundingBox(String,
GH_BoundingBox)|  Add a
new data item to this chunk. The name must be unique or an exception will be
thrown.
| SetBoundingBox(String, Int32,
GH_BoundingBox)|  Add
a new data item to this chunk. The combination of name and index must be
unique or an exception will be thrown.
| SetByte(String,
Byte)|  Add a new data item to
this chunk. The name must be unique or an exception will be thrown.
| SetByte(String, Int32,
Byte)|  Add a new data item
to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetByteArray(String,
Byte)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetByteArray(String, Int32,
Byte)|  Add a new data
item to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetDate(String,
DateTime)|  Add a new data item
to this chunk. The name must be unique or an exception will be thrown.
| SetDate(String, Int32,
DateTime)|  Add a new data
item to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetDecimal(String,
Decimal)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetDecimal(String, Int32,
Decimal)|  Add a new data
item to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetDouble(String,
Double)|  Add a new data item
to this chunk. The name must be unique or an exception will be thrown.
| SetDouble(String, Int32,
Double)|  Add a new data
item to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetDoubleArray(String,
Double)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetDoubleArray(String, Int32,
Double)|  Add a new
data item to this chunk. The combination of name and index must be unique or
an exception will be thrown.
| SetDrawingBitmap(String,
Bitmap)|  Add a new
data item to this chunk. The name must be unique or an exception will be
thrown.
| SetDrawingBitmap(String, Int32,
Bitmap)|  Add a new
data item to this chunk. The name must be unique or an exception will be
thrown.
| SetDrawingColor(String,
Color)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetDrawingColor(String, Int32,
Color)|  Add a new
data item to this chunk. The combination of name and index must be unique or
an exception will be thrown.
| SetDrawingPoint(String,
Point)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetDrawingPoint(String, Int32,
Point)|  Add a new
data item to this chunk. The combination of name and index must be unique or
an exception will be thrown.
| SetDrawingPointF(String,
PointF)|  Add a new
data item to this chunk. The name must be unique or an exception will be
thrown.
| SetDrawingPointF(String, Int32,
PointF)|  Add a new
data item to this chunk. The combination of name and index must be unique or
an exception will be thrown.
| SetDrawingRectangle(String,
Rectangle)|  Add a
new data item to this chunk. The name must be unique or an exception will be
thrown.
| SetDrawingRectangle(String, Int32,
Rectangle)|  Add
a new data item to this chunk. The combination of name and index must be
unique or an exception will be thrown.
| SetDrawingRectangleF(String,
RectangleF)|  Add
a new data item to this chunk. The name must be unique or an exception will be
thrown.
| SetDrawingRectangleF(String, Int32,
RectangleF)|
Add a new data item to this chunk. The combination of name and index must be
unique or an exception will be thrown.
| SetDrawingSize(String,
Size)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetDrawingSize(String, Int32,
Size)|  Add a new data
item to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetDrawingSizeF(String,
SizeF)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetDrawingSizeF(String, Int32,
SizeF)|  Add a new
data item to this chunk. The combination of name and index must be unique or
an exception will be thrown.
| SetGuid(String,
Guid)|  Add a new data item to
this chunk. The name must be unique or an exception will be thrown.
| SetGuid(String, Int32,
Guid)|  Add a new data item
to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetInt32(String,
Int32)|  Add a new data item
to this chunk. The name must be unique or an exception will be thrown.
| SetInt32(String, Int32,
Int32)|  Add a new data item
to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetInt64(String,
Int64)|  Add a new data item
to this chunk. The name must be unique or an exception will be thrown.
| SetInt64(String, Int32,
Int64)|  Add a new data item
to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetInterval1D(String,
GH_Interval1D)|  Add a
new data item to this chunk. The name must be unique or an exception will be
thrown.
| SetInterval1D(String, Int32,
GH_Interval1D)|  Add a
new data item to this chunk. The combination of name and index must be unique
or an exception will be thrown.
| SetInterval2D(String,
GH_Interval2D)|  Add a
new data item to this chunk. The name must be unique or an exception will be
thrown.
| SetInterval2D(String, Int32,
GH_Interval2D)|  Add a
new data item to this chunk. The combination of name and index must be unique
or an exception will be thrown.
| SetLine(String,
GH_Line)|  Add a new data item
to this chunk. The name must be unique or an exception will be thrown.
| SetLine(String, Int32,
GH_Line)|  Add a new data
item to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetPath(String, String,
String)|  Add a new data item
to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetPath(String, Int32, String,
String)|  Add a new data item
to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetPlane(String,
GH_Plane)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetPlane(String, Int32,
GH_Plane)|  Add a new data
item to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetPoint2D(String,
GH_Point2D)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetPoint2D(String, Int32,
GH_Point2D)|  Add a new
data item to this chunk. The combination of name and index must be unique or
an exception will be thrown.
| SetPoint3D(String,
GH_Point3D)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetPoint3D(String, Int32,
GH_Point3D)|  Add a new
data item to this chunk. The combination of name and index must be unique or
an exception will be thrown.
| SetPoint4D(String,
GH_Point4D)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetPoint4D(String, Int32,
GH_Point4D)|  Add a new
data item to this chunk. The combination of name and index must be unique or
an exception will be thrown.
| SetSingle(String,
Single)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetSingle(String, Int32,
Single)|  Add a new data item
to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetString(String,
String)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetString(String, Int32,
String)|  Add a new data item
to this chunk. The combination of name and index must be unique or an
exception will be thrown.
| SetVersion(String,
GH_Version)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetVersion(String, Int32,
GH_Version)|  Add a new
data item to this chunk. The combination of name and index must be unique or
an exception will be thrown.
| SetVersion(String, Int32, Int32,
Int32)|  Add a new data
item to this chunk. The name must be unique or an exception will be thrown.
| SetVersion(String, Int32, Int32,
Int32, Int32)|  Add a new
data item to this chunk. The combination of name and index must be unique or
an exception will be thrown.
|
Write(BinaryWriter)|
Called when an object is required to serialize itself.  (Inherited from
GH_IBinarySupport.)
|
Write(XmlWriter)|  Called
when an object is required to serialize itself.  (Inherited from
GH_IXmlSupport.)
Top

See Also

#### Reference

GH_IO.Serialization Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com