---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Types_GH_Line.htm
scraped_at: 2025-09-08T16:10:55.881474
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Types

GH_Line Structure

[GH_Line Constructor ](../html/Overload_GH_IO_Types_GH_Line__ctor.htm "GH_Line
Constructor ")

GH_Line Methods

GH_Line Fields

!Click or drag to
resize

# GH_Line Structure

---

Represents a 3D line segment, denoted by start and endpoints.

**Namespace:** GH_IO.Types
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public struct GH_Line

    Public Structure GH_Line

The GH_Line type exposes the following members.

Constructors

| Name| Description
---|---|---
| GH_Line(GH_Point3D,
GH_Point3D)|  Constructor.
| GH_Line(Double, Double, Double,
Double, Double, Double)|  Constructor.
Top

Methods

| Name| Description
---|---|---
|
ToString|  Converts this structure to a
human-readable string.  (Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Fields

| Name| Description
---|---|---
| A|
Start of line.
| B|  End
of line.
Top

See Also

#### Reference

GH_IO.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com