---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_Types_GH_Plane.htm
scraped_at: 2025-09-08T16:10:56.885388
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO.Types

GH_Plane Structure

[GH_Plane Constructor ](../html/Overload_GH_IO_Types_GH_Plane__ctor.htm
"GH_Plane Constructor ")

[GH_Plane Methods](../html/Methods_T_GH_IO_Types_GH_Plane.htm "GH_Plane
Methods")

GH_Plane Fields

!Click or drag to
resize

# GH_Plane Structure

---

Represents a 3D plane system, defined by origin point and {X,Y} axis
directions.

**Namespace:** GH_IO.Types
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    public struct GH_Plane

    Public Structure GH_Plane

The GH_Plane type exposes the following members.

Constructors

| Name| Description
---|---|---
| GH_Plane(GH_Point3D, GH_Point3D,
GH_Point3D)|  Constructor.
| GH_Plane(Double, Double, Double,
Double, Double, Double, Double, Double,
Double)|  Constructor.
Top

Methods

| Name| Description
---|---|---
|
ToString|  Converts this structure to a
human-readable string.  (Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Fields

| Name| Description
---|---|---
|
Origin|  Origin point of plane.
|
XAxis|  X axis vector of plane.
|
YAxis|  Y axis vector of plane.
Top

See Also

#### Reference

GH_IO.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com