---
url: https://developer.rhino3d.com/api/grasshopper/html/T_GH_IO_VersionNumber.htm
scraped_at: 2025-09-08T16:10:34.815493
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

GH_IO

[VersionNumber Structure](../html/T_GH_IO_VersionNumber.htm "VersionNumber
Structure")

[VersionNumber Constructor ](../html/Overload_GH_IO_VersionNumber__ctor.htm
"VersionNumber Constructor ")

[VersionNumber Properties](../html/Properties_T_GH_IO_VersionNumber.htm
"VersionNumber Properties")

[VersionNumber Methods](../html/Methods_T_GH_IO_VersionNumber.htm
"VersionNumber Methods")

!Click or drag to
resize

# VersionNumber Structure

---

Represents a product version number that encodes major, minor, time and build
branch information. as major.minor.yyddd.hhmmb where: yy = year of build -
2000 ddd = year day of build (1-366) hh = hour of build mm = minute of build b
= branch of build

**Namespace:** GH_IO
**Assembly:** GH_IO (in GH_IO.dll)

Syntax

C#

VB

Copy

    [SerializableAttribute]
    public struct VersionNumber : IComparable,
    	IComparable<VersionNumber>

    <SerializableAttribute>
    Public Structure VersionNumber
    	Implements IComparable, IComparable(Of VersionNumber)

The VersionNumber type exposes the following members.

Constructors

| Name| Description
---|---|---
|
VersionNumber(Version)|  Construct
VersionNumber based on existing System.Version class.
| VersionNumber(Int32, Int32,
DateTime, VersionNumberBranch)|  Initializes
a new instance of the VersionNumber structure to the version specified by the
parameters.
| VersionNumber(Int32, Int32, Int32,
Int32)|  Initializes a new instance of the
VersionNumber structure to the version specified by the version quartet
values.
Top

Properties

| Name| Description
---|---|---
|
BuildBranch|  Gets the build branch
component of this instance.
|
IsValid|  True when all information in
the VersionNumber has valid values.
|
Major|  Gets the major version number
component of this instance.
!Static
member|
MaxMajorVersionNumber|  The
largest possible valid value of VersionNumber.MajorVersionNumber.
!Static
member|
MaxMinorVersionNumber|  The
largest possible valid value of VersionNumber.MinorVersionNumber.
!Static
member| MaxValid|
The largest possible valid VersionNumber.
!Static
member|
MaxValidBuildBranch|
Represents the largest possible valid value of VersionNumber.BuildBranch. This
field is read-only.
!Static
member|
MaxValidTime|  The largest possible
valid value of VersionNumber.Time. This field is read-only.
!Static
member|
MinMajorVersionNumber|  The
smallest possible valid value of VersionNumber.MajorVersionNumber.
!Static
member|
MinMinorVersionNumber|  The
smallest possible valid value of VersionNumber.MinorVersionNumber.
|
Minor|  Gets the minor version number
component of this instance.
!Static
member| MinValid|
The smallest possible valid VersionNumber.
!Static
member|
MinValidBuildBranch|
Represents the smallest possible valid value of VersionNumber.BuildBranch.
This field is read-only.
!Static
member|
MinValidTime|  The smallest possible
valid value of VersionNumber.Time. This field is read-only.
|
Time|  Gets the version time component of
this instance.
!Static
member| Unset|  The
Unset VersionNumber. VersionNumber.Unset.IsValid is false.
!Static
member|
UnsetBuildBranch|  The value of
an Unset VersionNumber.BuildBranch.
!Static
member|
UnsetTime|  The value of an Unset
VersionNumber.Time.
Top

Methods

| Name| Description
---|---|---
|
CompareTo(Object)|  Compares the
value of this instance to a specified VersionNumber value and returns an
integer that indicates whether this instance is earlier than, the same as, or
later than the specified VersionNumber value.
|
CompareTo(VersionNumber)|  Compares the
value of this instance to a specified VersionNumber value and returns an
integer that indicates whether this instance is earlier than, the same as, or
later than the specified VersionNumber value.
|
ToString|  Converts the value of the
current VersionNumber object to its equivalent string representation
major.minor.yyddd.hhmmb. (Overrides ValueType.ToString().)  (Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
|
ToVersion|  Convert this VersionNumber
class to System.Version()
|
TryParse(String, VersionNumber)|
Converts the specified string representation of a version number to its
VersionNumber equivalent and returns a value that indicates whether the
conversion succeeded.
|
TryParse(Version, VersionNumber)|
Attempt so convert the System.Version representation of a version number to
its VersionNumber equivalent and returns a value that indicates whether the
conversion succeeded.
Top

See Also

#### Reference

GH_IO Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com