---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_DocumentEditor.htm
scraped_at: 2025-09-08T16:12:26.256925
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_DocumentEditor Class](../html/T_Grasshopper_GUI_GH_DocumentEditor.htm
"GH_DocumentEditor Class")

[GH_DocumentEditor Constructor
](../html/M_Grasshopper_GUI_GH_DocumentEditor__ctor.htm "GH_DocumentEditor
Constructor ")

[GH_DocumentEditor
Properties](../html/Properties_T_Grasshopper_GUI_GH_DocumentEditor.htm
"GH_DocumentEditor Properties")

[GH_DocumentEditor
Methods](../html/Methods_T_Grasshopper_GUI_GH_DocumentEditor.htm
"GH_DocumentEditor Methods")

[GH_DocumentEditor
Events](../html/Events_T_Grasshopper_GUI_GH_DocumentEditor.htm
"GH_DocumentEditor Events")

!Click or drag to
resize

# GH_DocumentEditor Class

---

The Grasshopper main window.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsForm
Grasshopper.GUIGH_DocumentEditor

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DocumentEditor : Form

    Public Class GH_DocumentEditor
    	Inherits Form

The GH_DocumentEditor type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DocumentEditor|
Initializes a new instance of the GH_DocumentEditor class
Top

Properties

| Name| Description
---|---|---
|
Collapsed|  Gets a value
indicating whether or not the form is currently collapsed.
|
CreateParams|
(Overrides
[FormCreateParams](https://docs.microsoft.com/dotnet/api/system.windows.forms.form.createparams#system-
windows-forms-form-createparams).)
|
FormShepard|  Gets the
form shepard for this window. Register your modeless dialogs with this shepard
if you want to be popular.
Top

Methods

| Name| Description
---|---|---
|
ClearStatusBar|
Clear the Grasshopper status-bar.
|
CloseForReal|  Really,
_really_ close the window.
|
CollapseForm|
Collapses the form into the title bar area.
|
DisableUI|  Disable all
modifier UI.
|
Dispose| Releases the
unmanaged resources used by the GH_DocumentEditor and optionally releases the
managed resources (Overrides
[FormDispose(Boolean)](https://docs.microsoft.com/dotnet/api/system.windows.forms.form.dispose#system-
windows-forms-form-dispose\(system-boolean\)).)
|
EnableUI|  Enable all
modifier UI.
|
ExpandForm|  Expands the
form if it is currenly collapsed.
|
FadeIn|  Call this method if
the prompt switches back to Grasshopper.
|
FadeOut|  Call this method
if the prompt switches to Rhino.
|
FixCanvasToolbarState|
Enabled/Disables the appropriate buttons depending on whether there is a
document loaded on the canvas.
|
ScriptAccess_CloseAllDocuments|
Closes all documents in the Document Queue.
|
ScriptAccess_CloseDocument|
Closes the currently active document and loads the next available document
into the canvas. Changes will not be saved.
|
ScriptAccess_IsDocument|
Returns true if there is an active document.
|
ScriptAccess_IsDocumentModified|
Gets the modified flag of the currently loaded document.
|
ScriptAccess_NewDocument|
Creates a new document and loads it into the Canvas.
|
ScriptAccess_OpenDocument|
Displays a command line interface for File Open... then loads that file into
the Canvas.
|
ScriptAccess_OpenDocument(String)|
Loads a specific file off the hard disk into the Canvas.
|
ScriptAccess_SaveDocument|
Saves the document currently loaded in the Canvas. If the document hasn't been
saved before then a Save... dialog box will be shown.
|
ScriptAccess_SaveDocumentAs|
Saves the currently active document to disk.
|
ScriptAccess_SaveDocumentAs(String)|
Saves the currently active document to disk.
|
SetStatusBarEvent|
Set a new message on the Grasshopper status bar.
|
ToggleForm|  Collapses
the form if it's currently expanded or expands the form if it's currently
collapsed.
|
WndProc|  WndProc is
overridden in order to allow for title-bar double-click (un)folding.
(Overrides
[FormWndProc(Message)](https://docs.microsoft.com/dotnet/api/system.windows.forms.form.wndproc#system-
windows-forms-form-wndproc\(system-windows-forms-message@\)).)
Top

Events

| Name| Description
---|---|---
|
AggregateShortcutMenuItems|
This event is raised whenever a GH_DocumentEditor collects all shortcuttable
menu items. If you added items to the menu and you want to be able to have
custom shortcuts on these items, you must handle this event and insert your
own items.
|
EditorFoldStateChanged|
This event is raised whenever the main windows folds or unfolds.
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto| Overloaded. (Defined by
EtoExtensions.)
|
ToEto| Overloaded. (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com