---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_AnnotationToleranceSettings.htm
scraped_at: 2025-09-08T16:22:58.985486
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations](../html/N_Grasshopper_Rhinoceros_Annotations.htm
"Grasshopper.Rhinoceros.Annotations")

[AnnotationToleranceSettings
Class](../html/T_Grasshopper_Rhinoceros_Annotations_AnnotationToleranceSettings.htm
"AnnotationToleranceSettings Class")

[AnnotationToleranceSettings Constructor
](../html/Overload_Grasshopper_Rhinoceros_Annotations_AnnotationToleranceSettings__ctor.htm
"AnnotationToleranceSettings Constructor ")

[AnnotationToleranceSettings
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_AnnotationToleranceSettings.htm
"AnnotationToleranceSettings Properties")

[AnnotationToleranceSettings
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_AnnotationToleranceSettings.htm
"AnnotationToleranceSettings Methods")

[AnnotationToleranceSettings Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Annotations_AnnotationToleranceSettings.htm
"AnnotationToleranceSettings Type Conversions")

!Click or drag to
resize

# AnnotationToleranceSettings Class

---

Represents annotation tolerance settings.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.Rhinoceros.AnnotationsAnnotationToleranceSettings

**Namespace:**
Grasshopper.Rhinoceros.Annotations
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class AnnotationToleranceSettings : ModelData

    Public NotInheritable Class AnnotationToleranceSettings
    	Inherits ModelData

The AnnotationToleranceSettings type exposes the following members.

Constructors

| Name| Description
---|---|---
|
AnnotationToleranceSettings|
Initializes a new instance of the AnnotationToleranceSettings class
|
AnnotationToleranceSettings(AnnotationToleranceSettingsAttributes)|
Initializes a new instance of the AnnotationToleranceSettings class
|
AnnotationToleranceSettings(DimensionStyle)|
Initializes a new instance of the AnnotationToleranceSettings class
Top

Properties

| Name| Description
---|---|---
|
AlternateToleranceResolution|
|
ToleranceFormat|
|
ToleranceHeightScale|
|
ToleranceLowerValue|
|
ToleranceResolution|
|
ToleranceUpperValue|
Top

Methods

| Name| Description
---|---|---
|
CastToT|  (Inherited from
ModelData.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|  (Inherited
from ModelData.)
|
GetDimensionStyle|
|
GetHashCode|  (Inherited
from ModelData.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelData.)
|
ToString|  (Inherited from
ModelData.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (AnnotationToleranceSettings to
DimensionStyle)|
!Static
member| (AnnotationToleranceSettingsAttributes to
AnnotationToleranceSettings)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com