---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_AssemblyInfoStub.htm
scraped_at: 2025-09-08T16:15:22.010884
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_AssemblyInfoStub
Class](../html/T_Grasshopper_Kernel_GH_AssemblyInfoStub.htm
"GH_AssemblyInfoStub Class")

[GH_AssemblyInfoStub Constructor
](../html/M_Grasshopper_Kernel_GH_AssemblyInfoStub__ctor.htm
"GH_AssemblyInfoStub Constructor ")

[GH_AssemblyInfoStub
Properties](../html/Properties_T_Grasshopper_Kernel_GH_AssemblyInfoStub.htm
"GH_AssemblyInfoStub Properties")

!Click or drag to
resize

# GH_AssemblyInfoStub Class

---

Provides basic properties for a GHA assembly that does not expose a type that
derives from GH_AssemblyInfo. This type is created automatically when a
GH_AssemblyInfo type is not found in an assembly.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_AssemblyInfo
Grasshopper.KernelGH_AssemblyInfoStub

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_AssemblyInfoStub : GH_AssemblyInfo

    Public NotInheritable Class GH_AssemblyInfoStub
    	Inherits GH_AssemblyInfo

The GH_AssemblyInfoStub type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_AssemblyInfoStub|
Initializes a new instance of the GH_AssemblyInfoStub class
Top

Properties

| Name| Description
---|---|---
|
Assembly|  Gets the
actual assembly that this info object describes.  (Inherited from
GH_AssemblyInfo.)
|
AssemblyName|
(Overrides GH_AssemblyInfo.AssemblyName.)
|
AssemblyVersion|
(Overrides GH_AssemblyInfo.AssemblyVersion.)
|
AuthorContact|  Gets
the contact information for the author. This can be email, phone, fax, address
or all of the above. Return null if you do not wish to associate contact
details with this assembly.  (Inherited from
GH_AssemblyInfo.)
|
AuthorName|  Gets the
name of the individual/company/organisation that is responsible for this
assembly. Return null if you do not wish to associate an author with this
assembly.  (Inherited from
GH_AssemblyInfo.)
|
Description|  Gets the
human readable description of this assembly. Return null if you do not wish to
associate a description with this assembly.  (Inherited from
GH_AssemblyInfo.)
|
Icon|  Gets a 24x24 icon that
represents this assembly. Return null if you do not wish to associate an icon
with this assembly.  (Inherited from
GH_AssemblyInfo.)
|
Id|  Gets the Id of this
assembly. By default the Id is a hash of the name.  (Inherited from
GH_AssemblyInfo.)
|
IsCoreLibrary|  Gets
whether this library is a Grasshopper core library. Core libraries are
installed along with Grasshopper and thus should always be available anywhere.
(Inherited from GH_AssemblyInfo.)
|
License|  Gets the license
type for this assembly.  (Inherited from
GH_AssemblyInfo.)
|
LoadingMechanism|
Gets the mechanism used to load this assembly.  (Inherited from
GH_AssemblyInfo.)
|
Location|  Gets the
location this assembly was loaded from.  (Inherited from
GH_AssemblyInfo.)
|
Name|  Gets the human
readable name of this assembly. Return null if you do not wish to associate a
name with this assembly.  (Inherited from
GH_AssemblyInfo.)
|
Version|  Gets the version
code for this assembly.  (Inherited from
GH_AssemblyInfo.)
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com