---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_String.htm
scraped_at: 2025-09-08T16:21:29.618264
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_String Class](../html/T_Grasshopper_Kernel_Types_GH_String.htm "GH_String
Class")

[GH_String Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_String__ctor.htm "GH_String
Constructor ")

[GH_String
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_String.htm
"GH_String Properties")

[GH_String Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_String.htm
"GH_String Methods")

[GH_String Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_String.htm
"GH_String Fields")

!Click or drag to
resize

# GH_String Class

---

Represents a literal string. GH_String re-implements the framework
System.String type.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooString
Grasshopper.Kernel.TypesGH_String
Grasshopper.Rhinoceros.AnnotationsAnnotationDateTimeFormat

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_String : GH_Goo<string>

    Public Class GH_String
    	Inherits GH_Goo(Of String)

The GH_String type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_String|  Blank
constructor
|
GH_String(GH_String)|
Initializes a new instance of the GH_String class
|
GH_String(String)|
Initializes a new instance of the GH_String class
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets the
validity of this instance. String are valid if they are not null.  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  (Overrides
GH_GooTCastToQ(Q).)
|
Duplicate|  (Overrides
GH_GooTDuplicate.)
|
DuplicateString|
|
EmitProxy|  (Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com