---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_ValueProxy.htm
scraped_at: 2025-09-08T16:18:47.910459
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_ValueProxy Interface](../html/T_Grasshopper_Kernel_IGH_ValueProxy.htm
"IGH_ValueProxy Interface")

[IGH_ValueProxy
Properties](../html/Properties_T_Grasshopper_Kernel_IGH_ValueProxy.htm
"IGH_ValueProxy Properties")

[IGH_ValueProxy
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_ValueProxy.htm
"IGH_ValueProxy Methods")

!Click or drag to
resize

# IGH_ValueProxy Interface

---

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_ValueProxy

    Public Interface IGH_ValueProxy

The IGH_ValueProxy type exposes the following members.

Properties

| Name| Description
---|---|---
|
IsParsable|  Gets a
value indicating whether or not the type can be instantiated from a String
|
IsValid|  Gets a value
indicating whether or not the current value is valid
|
ProxyName|  Gets a human-
friendly name description of the template type
|
ProxyType|  Gets the
System.Type description of the template type
|
ProxyValue|  Gets an
instance of the local template type object
|
UserString|  Gets or
sets the user-defined string that describes this proxy This only really makes
sense if the Proxy is Parsable.
Top

Methods

| Name| Description
---|---|---
|
Duplicate|  Create an
exact duplicate of the type.
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
|
MutateString|  Munge a
string to remove obvious errors on account of the user.
|
ToString|  Returns a
String description of the current value.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com