---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_SpinForce.htm
scraped_at: 2025-09-08T16:21:28.607802
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_SpinForce Class](../html/T_Grasshopper_Kernel_Types_GH_SpinForce.htm
"GH_SpinForce Class")

[GH_SpinForce Constructor
](../html/M_Grasshopper_Kernel_Types_GH_SpinForce__ctor.htm "GH_SpinForce
Constructor ")

[GH_SpinForce
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_SpinForce.htm
"GH_SpinForce Properties")

[GH_SpinForce
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_SpinForce.htm
"GH_SpinForce Methods")

!Click or drag to
resize

# GH_SpinForce Class

---

Rotational spin force for IGH_Fields.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_FieldElement
Grasshopper.Kernel.TypesGH_SpinForce

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_SpinForce : GH_FieldElement

    Public Class GH_SpinForce
    	Inherits GH_FieldElement

The GH_SpinForce type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_SpinForce| Initializes
a new instance of the GH_SpinForce class
Top

Properties

| Name| Description
---|---|---
|
BoundingBox|
(Overrides
GH_FieldElementBoundingBox.)
|
ClippingBox|
(Inherited from
GH_FieldElement.)
|
Decay|
|
ElementGuid|
(Overrides
GH_FieldElementElementGuid.)
|
IsLimited|
(Inherited from
GH_FieldElement.)
|
Limits|  (Inherited
from GH_FieldElement.)
|
Plane|
|
Radius|
|
Strength|
Top

Methods

| Name| Description
---|---|---
|
DrawViewportMeshes|
(Inherited from
GH_FieldElement.)
|
DrawViewportWires|
(Overrides
GH_FieldElementDrawViewportWires(GH_PreviewWireArgs).)
|
Duplicate|
(Overrides
GH_FieldElementDuplicate.)
|
Force|  (Overrides
GH_FieldElementForce(Point3d).)
|
IsCoincident|
(Inherited from
GH_FieldElement.)
|
Read|  (Overrides
GH_FieldElementRead(GH_IReader).)
|
Write|  (Overrides
GH_FieldElementWrite(GH_IWriter).)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com