---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_RuleAnyNumber.htm
scraped_at: 2025-09-08T16:19:09.042771
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_RuleAnyNumber
Class](../html/T_Grasshopper_Kernel_Data_GH_RuleAnyNumber.htm
"GH_RuleAnyNumber Class")

[GH_RuleAnyNumber Constructor
](../html/M_Grasshopper_Kernel_Data_GH_RuleAnyNumber__ctor.htm
"GH_RuleAnyNumber Constructor ")

[GH_RuleAnyNumber
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_RuleAnyNumber.htm
"GH_RuleAnyNumber Properties")

[GH_RuleAnyNumber
Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_RuleAnyNumber.htm
"GH_RuleAnyNumber Methods")

!Click or drag to
resize

# GH_RuleAnyNumber Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_RuleAnyNumber

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RuleAnyNumber : IGH_Rule

    Public Class GH_RuleAnyNumber
    	Implements IGH_Rule

The GH_RuleAnyNumber type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_RuleAnyNumber|
Initializes a new instance of the GH_RuleAnyNumber class
Top

Properties

| Name| Description
---|---|---
|
Kind|
|
Notation|
Top

Methods

| Name| Description
---|---|---
|
Apply|
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com