---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_ModelViewport.htm
scraped_at: 2025-09-08T16:23:27.117398
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[ModelViewport
Class](../html/T_Grasshopper_Rhinoceros_Display_ModelViewport.htm
"ModelViewport Class")

[ModelViewport
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_ModelViewport.htm
"ModelViewport Properties")

[ModelViewport
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_ModelViewport.htm
"ModelViewport Methods")

[ModelViewport Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Display_ModelViewport.htm
"ModelViewport Type Conversions")

[ModelViewport
Fields](../html/Fields_T_Grasshopper_Rhinoceros_Display_ModelViewport.htm
"ModelViewport Fields")

!Click or drag to
resize

# ModelViewport Class

---

Represents a Rhino viewport. Wraps the main viewport of a RhinoView instance.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.Rhinoceros.DisplayModelViewport
Grasshopper.Rhinoceros.DisplayModelPageViewport
Grasshopper.Rhinoceros.DisplayModelStandardViewport

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class ModelViewport : ModelContent,
    	IGH_BakeAwareData

    Public Class ModelViewport
    	Inherits ModelContent
    	Implements IGH_BakeAwareData

The ModelViewport type exposes the following members.

Properties

| Name| Description
---|---|---
|
Attribs|
|
DefaultAttributes|
(Overrides
ModelDataDefaultAttributes.)
|
DisplayMode|
|
Id|  (Inherited from
ModelContent.)
|
IsReferencedData|
(Inherited from ModelContent.)
|
IsReferencedDataLoaded|
(Inherited from ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
IsValidWhyNot|
(Inherited from ModelContent.)
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Space|
|
Tags|  (Inherited from
ModelContent.)
|
TypeDescription|
(Inherited from ModelData.)
!Static
member|
Unset|
|
ViewportType|
Top

Methods

| Name| Description
---|---|---
|
AsFrozen|  Try to obtain
a dereferenced snapshot of itself.  (Inherited from
ModelContent.)
|
Cast|
|
CastToT(T)|
(Overrides
ModelContentCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
InternaliseData|
(Inherited from ModelContent.)
|
LoadReferencedData|
(Inherited from ModelContent.)
|
Read|  (Inherited from
ModelContent.)
|
RuntimeId|  (Inherited
from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
|
UnloadReferencedData|
(Inherited from ModelContent.)
|
Write|  (Inherited from
ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelViewportAttributes to
ModelViewport)|
!Static
member| (RhinoViewport to
ModelViewport)|
Top

Fields

| Name| Description
---|---|---
|
Serial|  (Inherited from
ModelData.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com