---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DisplayExpiredEventArgs.htm
scraped_at: 2025-09-08T16:16:02.181009
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DisplayExpiredEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DisplayExpiredEventArgs.htm
"GH_DisplayExpiredEventArgs Class")

[GH_DisplayExpiredEventArgs Constructor
](../html/M_Grasshopper_Kernel_GH_DisplayExpiredEventArgs__ctor.htm
"GH_DisplayExpiredEventArgs Constructor ")

[GH_DisplayExpiredEventArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_DisplayExpiredEventArgs.htm
"GH_DisplayExpiredEventArgs Properties")

[GH_DisplayExpiredEventArgs
Fields](../html/Fields_T_Grasshopper_Kernel_GH_DisplayExpiredEventArgs.htm
"GH_DisplayExpiredEventArgs Fields")

!Click or drag to
resize

# GH_DisplayExpiredEventArgs Class

---

Arguments for display events.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_DisplayExpiredEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DisplayExpiredEventArgs : EventArgs

    Public Class GH_DisplayExpiredEventArgs
    	Inherits EventArgs

The GH_DisplayExpiredEventArgs type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DisplayExpiredEventArgs|
Initializes a new instance of the GH_DisplayExpiredEventArgs class
Top

Properties

| Name| Description
---|---|---
|
ForceRedraw|
Top

Fields

| Name| Description
---|---|---
|
m_redraw|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com