---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_IGH_Tooltip.htm
scraped_at: 2025-09-08T16:13:29.528028
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[IGH_Tooltip Interface](../html/T_Grasshopper_GUI_IGH_Tooltip.htm "IGH_Tooltip
Interface")

[IGH_Tooltip Properties](../html/Properties_T_Grasshopper_GUI_IGH_Tooltip.htm
"IGH_Tooltip Properties")

!Click or drag to
resize

# IGH_Tooltip Interface

---

Accessor interface for the Grasshopper Tooltip form.

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_Tooltip

    Public Interface IGH_Tooltip

The IGH_Tooltip type exposes the following members.

Properties

| Name| Description
---|---|---
|
Description|  Gets or sets
the tooltip Description. The Description is optional and is displayed in the
same area as the TooltipDiagram image.
|
Diagram|  Sets the tooltip
diagram image. The diagram image is optional and is displayed in the same area
as the ToolTipDescription text.
|
Icon|  Sets the Tooltip Icon image.
|
Palette|  Gets or sets the
tooltip colour palette.
|
Text|  Gets or sets the tooltip
Text.
|
Title|  Gets or sets the tooltip
Title.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com