---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_Slider.htm
scraped_at: 2025-09-08T16:13:05.419041
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

GH_Slider Class

[GH_Slider Constructor ](../html/M_Grasshopper_GUI_GH_Slider__ctor.htm
"GH_Slider Constructor ")

[GH_Slider Properties](../html/Properties_T_Grasshopper_GUI_GH_Slider.htm
"GH_Slider Properties")

[GH_Slider Methods](../html/Methods_T_Grasshopper_GUI_GH_Slider.htm "GH_Slider
Methods")

[GH_Slider Events](../html/Events_T_Grasshopper_GUI_GH_Slider.htm "GH_Slider
Events")

!Click or drag to
resize

# GH_Slider Class

---

Provides a standard Grasshopper slider as a winforms control.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsUserControl
GH_TextInputBaseControl
Grasshopper.GUIGH_Slider

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Slider : GH_TextInputBaseControl

    Public Class GH_Slider
    	Inherits GH_TextInputBaseControl

The GH_Slider type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Slider| Initializes a new instance
of the GH_Slider class
Top

Properties

| Name| Description
---|---|---
|
ControlEdgeColour|  Gets
or sets the EdgeColor for this slider control.
|
ControlShadowColour|
Gets or sets the Shadow colour for this control.
|
DecimalPlaces|  Gets or sets
the number of decimal places allowed for Floating Point Sliders.
|
DrawControlBorder|  Gets
or sets whether the border of the slider should be drawn.
|
DrawControlShadows|
Gets or sets whether the drop shadows of the slider should be drawn.
|
FormatMask|  Gets or sets the
string format mask to use for the display. Should contain at least one "{0}"
element.
|
GripBottomColour|  Gets or
sets the fill colour for the bottom edge of the slider grip.
|
GripDisplay|  Gets or sets how
the slider grip (or thumb) is drawn.
|
GripEdgeColour|  Gets or
sets the edge colour for the slider grip.
|
GripTopColour|  Gets or sets
the fill colour for the top edge of the slider grip.
|
Maximum|  Gets or sets the upper
numeric limit for the slider range.
|
Minimum|  Gets or sets the lower
numeric limit for the slider range.
|
RailBrightColour|  Gets or
sets the edge colour for the bright parts of the rail.
|
RailDarkColour|  Gets or
sets the edge colour for the dark parts of the rail.
|
RailDisplay|  Gets or sets how
the slider rail (or track) is drawn.
|
RailEmptyColour|  Gets or
sets the fill colour for the empty portion of the rail.
|
RailFullColour|  Gets or
sets the fill colour for the full portion of the rail.
|
ShadowSize|  Gets or sets the
size of the border shadow along all edges of the box.
|
TextColour|  Gets or sets the
fill colour for the slider text.
|
TickCount|  Gets or sets the
number of ticks.
|
TickDisplay|  Gets or sets how
the slider ticks are drawn.
|
TickFrequency|  Gets or sets
the frequency of large ticks vs small ticks.
|
Type|  Gets or sets the numeric type
of this slider.
|
Value|  Gets or sets the numeric
value for the slider range.
Top

Methods

| Name| Description
---|---|---
|
Input_Assign|  (Overrides
GH_TextInputBaseControl.Input_Assign(String).)
|
Input_Parse|  (Overrides
GH_TextInputBaseControl.Input_Parse(String).)
|
Input_Supply|  (Overrides
GH_TextInputBaseControl.Input_Supply.)
|
OnPaint|  (Overrides
[ControlOnPaint(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.control.onpaint#system-
windows-forms-control-onpaint\(system-windows-forms-painteventargs\)).)
|
OnPaintBackground|
(Overrides
[ScrollableControlOnPaintBackground(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.scrollablecontrol.onpaintbackground#system-
windows-forms-scrollablecontrol-onpaintbackground\(system-windows-forms-
painteventargs\)).)
Top

Events

| Name| Description
---|---|---
|
ValueChanged|  Raised whenever
the value of the slider is changed via GUI interaction.
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com