---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Model_ModelEarthAnchorPoint_Attributes.htm
scraped_at: 2025-09-08T16:24:13.293365
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Model](../html/N_Grasshopper_Rhinoceros_Model.htm
"Grasshopper.Rhinoceros.Model")

[ModelEarthAnchorPoint.Attributes
Class](../html/T_Grasshopper_Rhinoceros_Model_ModelEarthAnchorPoint_Attributes.htm
"ModelEarthAnchorPoint.Attributes Class")

[ModelEarthAnchorPoint.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_Model_ModelEarthAnchorPoint_Attributes__ctor.htm
"ModelEarthAnchorPoint.Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Model_ModelEarthAnchorPoint_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Model_ModelEarthAnchorPoint_Attributes.htm
"Attributes Methods")

!Click or drag to
resize

# ModelEarthAnchorPointAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
Grasshopper.Rhinoceros.ModelModelEarthAnchorPointAttributes

**Namespace:**
Grasshopper.Rhinoceros.Model
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Attributes : ModelContentAttributes

    Public NotInheritable Class Attributes
    	Inherits ModelContentAttributes

The ModelEarthAnchorPointAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelEarthAnchorPointAttributes|
Initializes a new instance of the ModelEarthAnchorPointAttributes class
Top

Properties

| Name| Description
---|---|---
|
Elevation|
|
ElevationCoordinateSystem|
|
Latitude|
|
Longitude|
|
ModelCompass|
|
Name|  The last
component of the element Path.  (Inherited from
ModelContentAttributes.)
|
Notes|
(Inherited from
ModelContentAttributes.)
|
Parent|  Path
of the parent element in 'Root::Parent' format if nested.  (Inherited from
ModelContentAttributes.)
|
Path|  Full
content path in 'Root::Parent::Name' format if is nested.  (Inherited from
ModelContentAttributes.)
|
Tags|  (Inherited
from
ModelContentAttributes.)
Top

Methods

| Name| Description
---|---|---
|
Clone|  (Inherited
from
ModelDataAttributes.)
|
Equals(Object)|
(Inherited from
ModelContentAttributes.)
|
GetHashCode|
(Inherited from
ModelContentAttributes.)
|
ToDetails|
(Inherited from
ModelDataAttributes.)
|
ToModelData|
(Overrides
ModelDataAttributesToModelData.)
|
ToString|
(Overrides
ModelContentAttributesToString.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Model Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com