---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_SettingsCategory.htm
scraped_at: 2025-09-08T16:13:04.404372
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_SettingsCategory Class](../html/T_Grasshopper_GUI_GH_SettingsCategory.htm
"GH_SettingsCategory Class")

[GH_SettingsCategory Constructor
](../html/Overload_Grasshopper_GUI_GH_SettingsCategory__ctor.htm
"GH_SettingsCategory Constructor ")

[GH_SettingsCategory
Properties](../html/Properties_T_Grasshopper_GUI_GH_SettingsCategory.htm
"GH_SettingsCategory Properties")

!Click or drag to
resize

# GH_SettingsCategory Class

---

Base implementation of IGH_SettingsCategory. Derive from this class and
provide an empty constructor to play ball.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_SettingsCategory

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_SettingsCategory : IGH_SettingCategory

    Public MustInherit Class GH_SettingsCategory
    	Implements IGH_SettingCategory

The GH_SettingsCategory type exposes the following members.

Constructors

| Name| Description
---|---|---
| GH_SettingsCategory(String,
Bitmap)|  Create a new top-
level category.
| GH_SettingsCategory(String,
String, Bitmap)|  Create a
new nested category.
Top

Properties

| Name| Description
---|---|---
|
Description|
|
Icon|
|
Name|
|
Parent|
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com