---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IRcpAwareObject.htm
scraped_at: 2025-09-08T16:18:50.946116
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IRcpAwareObject Interface](../html/T_Grasshopper_Kernel_IRcpAwareObject.htm
"IRcpAwareObject Interface")

[IRcpAwareObject
Methods](../html/Methods_T_Grasshopper_Kernel_IRcpAwareObject.htm
"IRcpAwareObject Methods")

!Click or drag to
resize

# IRcpAwareObject Interface

---

Implement this interface in a parameter or component if you want to be
publishable on the remote control panel.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IRcpAwareObject

    Public Interface IRcpAwareObject

The IRcpAwareObject type exposes the following members.

Methods

| Name| Description
---|---|---
|
PublishRcpItem|
Emit a new object to be inserted on a Remote Control Panel.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com