---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Expressions_GH_Variant.htm
scraped_at: 2025-09-08T16:19:47.212294
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Expressions](../html/N_Grasshopper_Kernel_Expressions.htm
"Grasshopper.Kernel.Expressions")

[GH_Variant Class](../html/T_Grasshopper_Kernel_Expressions_GH_Variant.htm
"GH_Variant Class")

[GH_Variant Constructor
](../html/Overload_Grasshopper_Kernel_Expressions_GH_Variant__ctor.htm
"GH_Variant Constructor ")

[GH_Variant
Properties](../html/Properties_T_Grasshopper_Kernel_Expressions_GH_Variant.htm
"GH_Variant Properties")

[GH_Variant
Methods](../html/Methods_T_Grasshopper_Kernel_Expressions_GH_Variant.htm
"GH_Variant Methods")

!Click or drag to
resize

# GH_Variant Class

---

Variant data used in Grasshopper Expressions.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.ExpressionsGH_Variant

**Namespace:**
Grasshopper.Kernel.Expressions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Variant

    Public Class GH_Variant

The GH_Variant type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Variant|  Create a
new Null variant.
|
GH_Variant(Boolean)|
Create a new Bool variant.
|
GH_Variant(Complex)|
Create a new Complex variant.
|
GH_Variant(Double)|
Create a new Double variant.
|
GH_Variant(GH_Variant)|
Duplicate a Variant.
|
GH_Variant(Int32)|
Create a new Integer variant.
|
GH_Variant(Plane)|
Create a new Plane variant.
|
GH_Variant(Point3d)|
Create a new Point variant.
|
GH_Variant(String)|
Create a new String variant.
|
GH_Variant(Vector3d)|
Create a new Point variant.
Top

Properties

| Name| Description
---|---|---
|
_Bool|  Gets the
contents of this Variant as a bool.
|
_Complex|  Gets
the contents of this Variant as a complex number.
|
_Double|  Gets the
contents of this Variant as a double. If the Variant is of type Integer this
cast will also work.
|
_Int|  Gets the
contents of this Variant as an integer.
|
_Plane|  Gets the
contents of this Variant as a Plane.
|
_Point|  Gets the
contents of this Variant as a Point.
|
_String|  Gets the
contents of this Variant as a String. This function will work for all Variant
types.
|
_Vector|  Gets the
contents of this Variant as a Vector.
|
IsNumeric|  Gets
a value indicating whether or not the Variant is a numeric type. Only Doubles
and Integers are considered to be Numeric.
|
Type|  Gets the Type
of this Variant.
Top

Methods

| Name| Description
---|---|---
|
DataT|  Perform a
straight cast of the data inside this Variant.
|
Duplicate|
Duplicate this Variant. If the type of this Variant is [unknown] the contents
are not guaranteed to be duplicated.
|
Evaluate|  If this
variant represents a string, this function will attempt to evaluate that
string and replace the data inside this variant.
|
ToGoo|  Attempt to
convert a Variant to a Grasshopper IGH_Goo type.
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

See Also

#### Reference

Grasshopper.Kernel.Expressions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com