---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_Canvas_GH_ImageSettings.htm
scraped_at: 2025-09-08T16:14:20.805327
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_Canvas.GH_ImageSettings
Class](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_GH_ImageSettings.htm
"GH_Canvas.GH_ImageSettings Class")

[GH_ImageSettings Constructor
](../html/Overload_Grasshopper_GUI_Canvas_GH_Canvas_GH_ImageSettings__ctor.htm
"GH_ImageSettings Constructor ")

[GH_ImageSettings
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_GH_Canvas_GH_ImageSettings.htm
"GH_ImageSettings Properties")

!Click or drag to
resize

# GH_CanvasGH_ImageSettings Class

---

Settings class for high-resolution image output.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_CanvasGH_ImageSettings

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ImageSettings

    Public Class GH_ImageSettings

The GH_CanvasGH_ImageSettings type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_CanvasGH_ImageSettings|
Create a new instance of the GH_ImageSettings class with default values.
|
GH_CanvasGH_ImageSettings(String)|
Create a new instance of the GH_ImageSettings class.
| GH_CanvasGH_ImageSettings(String,
String,
String)|
Create a new instance of the GH_ImageSettings class.
Top

Properties

| Name| Description
---|---|---
|
BackColour|
Gets or sets the background colour to use for the high-resolution rendering.
|
Extension|
Gets or sets the image extension of the target image.
|
FileName|
Gets or sets the filename of the target image.
|
Folder|
Gets or sets the folder in which the target image will be saved.
!Static
member|
TileSize|
Gets the default tile size for high-resolution export. This is a constant
value.
|
Zoom|  Gets or
sets the zoom at which to export the high-resolution image.
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com