---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_Animator.htm
scraped_at: 2025-09-08T16:12:10.175548
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_Animator Class](../html/T_Grasshopper_GUI_GH_Animator.htm "GH_Animator
Class")

[GH_Animator Methods](../html/Methods_T_Grasshopper_GUI_GH_Animator.htm
"GH_Animator Methods")

!Click or drag to
resize

# GH_Animator Class

---

Provides static methods and constructors GH_Animator(Of T).

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_Animator

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_Animator

    Public NotInheritable Class GH_Animator

The GH_Animator type exposes the following members.

Methods

| Name| Description
---|---|---
|
DecimalAnimator(Decimal,
Decimal)|
|
DecimalAnimator(Decimal, Decimal,
Int32)|
|
DecimalAnimator(Decimal, Decimal, DateTime,
DateTime)|
|
DoubleAnimator(Double,
Double)|
|
DoubleAnimator(Double, Double,
Int32)|
|
DoubleAnimator(Double, Double, DateTime,
DateTime)|
|
IntegerAnimator(Int32,
Int32)|
|
IntegerAnimator(Int32, Int32,
Int32)|
|
IntegerAnimator(Int32, Int32, DateTime,
DateTime)|
|
InterpolateDecimal|
Utility interpolation delegate for System.Decimal values.
|
InterpolateDouble|
Utility interpolation delegate for System.Double values.
|
InterpolateInteger|
Utility interpolation delegate for System.Int32 values.
|
InterpolatePoint|
Utility interpolation delegate for System.Drawing.Point values.
|
InterpolatePointF|
Utility interpolation delegate for System.Drawing.PointF values.
|
InterpolateRectangle|
Utility interpolation delegate for System.Drawing.Rectangle values.
|
InterpolateRectangleF|
Utility interpolation delegate for System.Drawing.RectangleF values.
|
InterpolateSingle|
Utility interpolation delegate for System.Single values.
|
PointAnimator(Point,
Point)|
|
PointAnimator(Point, Point,
Int32)|
|
PointAnimator(Point, Point, DateTime,
DateTime)|
|
PointFAnimator(PointF,
PointF)|
|
PointFAnimator(PointF, PointF,
Int32)|
|
PointFAnimator(PointF, PointF, DateTime,
DateTime)|
|
RectangleAnimator(Rectangle,
Rectangle)|
|
RectangleAnimator(Rectangle, Rectangle,
Int32)|
|
RectangleAnimator(Rectangle, Rectangle, DateTime,
DateTime)|
|
RectangleFAnimator(RectangleF,
RectangleF)|
|
RectangleFAnimator(RectangleF, RectangleF,
Int32)|
|
RectangleFAnimator(RectangleF, RectangleF, DateTime,
DateTime)|
|
SingleAnimator(Single,
Single)|
|
SingleAnimator(Single, Single,
Int32)|
|
SingleAnimator(Single, Single, DateTime,
DateTime)|
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com