---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_FormShepard.htm
scraped_at: 2025-09-08T16:12:40.301767
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_FormShepard Class](../html/T_Grasshopper_GUI_GH_FormShepard.htm
"GH_FormShepard Class")

[GH_FormShepard Constructor
](../html/M_Grasshopper_GUI_GH_FormShepard__ctor.htm "GH_FormShepard
Constructor ")

[GH_FormShepard
Properties](../html/Properties_T_Grasshopper_GUI_GH_FormShepard.htm
"GH_FormShepard Properties")

[GH_FormShepard Methods](../html/Methods_T_Grasshopper_GUI_GH_FormShepard.htm
"GH_FormShepard Methods")

!Click or drag to
resize

# GH_FormShepard Class

---

A Form shepard is used to herde a bunch of floating forms. Important forms
that potentially spout child forms might choose to implement one.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_FormShepard

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_FormShepard

    Public Class GH_FormShepard

The GH_FormShepard type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_FormShepard|  Create a new
form shepard.
Top

Properties

| Name| Description
---|---|---
|
Sheep|
Top

Methods

| Name| Description
---|---|---
|
RegisterForm|  Add a
sheep form to the flock. This form will be affected by the location and size
of the main form.
|
UnregisterForm|  Remove
a sheep from the flock.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com