---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Expressions_GH_CodeString.htm
scraped_at: 2025-09-08T16:19:32.141661
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Expressions](../html/N_Grasshopper_Kernel_Expressions.htm
"Grasshopper.Kernel.Expressions")

[GH_CodeString
Class](../html/T_Grasshopper_Kernel_Expressions_GH_CodeString.htm
"GH_CodeString Class")

[GH_CodeString Constructor
](../html/M_Grasshopper_Kernel_Expressions_GH_CodeString__ctor.htm
"GH_CodeString Constructor ")

[GH_CodeString
Properties](../html/Properties_T_Grasshopper_Kernel_Expressions_GH_CodeString.htm
"GH_CodeString Properties")

[GH_CodeString
Methods](../html/Methods_T_Grasshopper_Kernel_Expressions_GH_CodeString.htm
"GH_CodeString Methods")

[GH_CodeString
Fields](../html/Fields_T_Grasshopper_Kernel_Expressions_GH_CodeString.htm
"GH_CodeString Fields")

!Click or drag to
resize

# GH_CodeString Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.ExpressionsGH_CodeString

**Namespace:**
Grasshopper.Kernel.Expressions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_CodeString

    Public Class GH_CodeString

The GH_CodeString type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_CodeString|
Initializes a new instance of the GH_CodeString class
Top

Properties

| Name| Description
---|---|---
|
Segments|
Top

Methods

| Name| Description
---|---|---
|
Flatten|
|
ParseNewString|
|
Replace|
|
ReplaceToken|
Top

Fields

| Name| Description
---|---|---
!Static
member|
DoubleQuote|
|
m_Segments|
Top

See Also

#### Reference

Grasshopper.Kernel.Expressions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com