---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_StructurePath.htm
scraped_at: 2025-09-08T16:21:30.621908
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_StructurePath
Class](../html/T_Grasshopper_Kernel_Types_GH_StructurePath.htm
"GH_StructurePath Class")

[GH_StructurePath Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_StructurePath__ctor.htm
"GH_StructurePath Constructor ")

[GH_StructurePath
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_StructurePath.htm
"GH_StructurePath Properties")

[GH_StructurePath
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_StructurePath.htm
"GH_StructurePath Methods")

[GH_StructurePath
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_StructurePath.htm
"GH_StructurePath Fields")

!Click or drag to
resize

# GH_StructurePath Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooGH_Path
Grasshopper.Kernel.TypesGH_StructurePath

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_StructurePath : GH_Goo<GH_Path>

    Public Class GH_StructurePath
    	Inherits GH_Goo(Of GH_Path)

The GH_StructurePath type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_StructurePath|
Blank constructor
|
GH_StructurePath(GH_Path)|
Initializes a new instance of the GH_StructurePath class
|
GH_StructurePath(GH_StructurePath)|
Initializes a new instance of the GH_StructurePath class
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets the
validity of this instance. Integers are always valid  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Inherited from
GH_GooT.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|
(Overrides
GH_GooTTypeName.)
|
Value|  (Overrides
GH_GooTValue.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|
(Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|
(Overrides
GH_GooTCastToQ(Q).)
|
Duplicate|
(Overrides
GH_GooTDuplicate.)
|
DuplicatePath|
|
EmitProxy|
(Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|
(Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com