---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelData.htm
scraped_at: 2025-09-08T16:22:37.884755
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelData Class](../html/T_Grasshopper_Rhinoceros_ModelData.htm "ModelData
Class")

[ModelData
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelData.htm
"ModelData Properties")

[ModelData Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelData.htm
"ModelData Methods")

[ModelData Fields](../html/Fields_T_Grasshopper_Rhinoceros_ModelData.htm
"ModelData Fields")

!Click or drag to
resize

# ModelData Class

---

Represents a Rhino model chunk of data.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
More...

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class ModelData : IGH_ModelData,
    	ICloneable, IComparable, IEquatable<ModelData>, IStructuralEquatable

    Public MustInherit Class ModelData
    	Implements IGH_ModelData, ICloneable, IComparable, IEquatable(Of ModelData),
    	IStructuralEquatable

The ModelData type exposes the following members.

Properties

| Name| Description
---|---|---
|
Attribs|
|
DefaultAttributes|
|
IsValidWhyNot|
|
TypeDescription|
Top

Methods

| Name| Description
---|---|---
!Static
member| CastA,
T|
|
CastToT|
|
Equals(ModelData)|
|
Equals(Object)|  (Overrides
[ObjectEquals(Object)](https://docs.microsoft.com/dotnet/api/system.object.equals#system-
object-equals\(system-object\)).)
|
GetHashCode|  (Overrides
[ObjectGetHashCode](https://docs.microsoft.com/dotnet/api/system.object.gethashcode#system-
object-gethashcode).)
|
Read|
|
ToAttributes|
|
ToDetails|
|
TooltipString|
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|
Top

Fields

| Name| Description
---|---|---
|
Serial|
Top

Remarks

This type is the base type of a family of immutable types.

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.Rhinoceros.AnnotationsAnnotationArrow
Grasshopper.Rhinoceros.AnnotationsAnnotationArrowSettings
Grasshopper.Rhinoceros.AnnotationsAnnotationDimensionSettings
Grasshopper.Rhinoceros.AnnotationsAnnotationLeaderSettings
Grasshopper.Rhinoceros.AnnotationsAnnotationTextSettings
Grasshopper.Rhinoceros.AnnotationsAnnotationToleranceSettings
Grasshopper.Rhinoceros.AnnotationsAnnotationUnitsSettings
Grasshopper.RhinocerosModelContent

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com