---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_RelevantObjectData.htm
scraped_at: 2025-09-08T16:17:44.629480
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_RelevantObjectData
Class](../html/T_Grasshopper_Kernel_GH_RelevantObjectData.htm
"GH_RelevantObjectData Class")

[GH_RelevantObjectData Constructor
](../html/M_Grasshopper_Kernel_GH_RelevantObjectData__ctor.htm
"GH_RelevantObjectData Constructor ")

[GH_RelevantObjectData
Properties](../html/Properties_T_Grasshopper_Kernel_GH_RelevantObjectData.htm
"GH_RelevantObjectData Properties")

[GH_RelevantObjectData
Methods](../html/Methods_T_Grasshopper_Kernel_GH_RelevantObjectData.htm
"GH_RelevantObjectData Methods")

!Click or drag to
resize

# GH_RelevantObjectData Class

---

Contains information about relevant objects at a specific canvas location.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_RelevantObjectData

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RelevantObjectData

    Public Class GH_RelevantObjectData

The GH_RelevantObjectData type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_RelevantObjectData|
Construct a new instance.
Top

Properties

| Name| Description
---|---|---
|
Attributes|  Gets
the attributes that belong to the object.
|
Group|  Gets the cast
of the DocObject to GH_Group.
|
IsTopLevelObject|
Gets a value indicating whether or not the Object is a top-level object.
|
Object|  Gets the raw
object cached in this data instance.
|
ObjectType|  Gets
the type of object indicated by this data.
|
Parameter|  Gets
the cast of the DocObject to IGH_Param. If the DocObject is not of type
IGH_Param, the attributes of the object will be perused to find a nested
IGH_Param at the point.
|
Point|  Gets the point
for which this GH_RelevantObjectData has been made.
|
TopLevelObject|
Gets the top-level object.
Top

Methods

| Name| Description
---|---|---
|
CreateBalloonData|
|
CreateGripData|
|
CreateGroupData|
|
CreateObjectData|
|
CreateWireData|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com