---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Geometry_SpatialTrees_Node3d_1.htm
scraped_at: 2025-09-08T16:19:54.230659
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Geometry.SpatialTrees](../html/N_Grasshopper_Kernel_Geometry_SpatialTrees.htm
"Grasshopper.Kernel.Geometry.SpatialTrees")

[Node3d(T)
Class](../html/T_Grasshopper_Kernel_Geometry_SpatialTrees_Node3d_1.htm
"Node3d\(T\) Class")

[Node3d(T) Constructor
](../html/Overload_Grasshopper_Kernel_Geometry_SpatialTrees_Node3d_1__ctor.htm
"Node3d\(T\) Constructor ")

[Node3d(T)
Properties](../html/Properties_T_Grasshopper_Kernel_Geometry_SpatialTrees_Node3d_1.htm
"Node3d\(T\) Properties")

[Node3d(T)
Methods](../html/Methods_T_Grasshopper_Kernel_Geometry_SpatialTrees_Node3d_1.htm
"Node3d\(T\) Methods")

!Click or drag to
resize

# Node3dT Class

---

Basic node in a Tree3d structure. Nodes in tree structures maintain a local
region and either a list of content indices or a list of up to 8 child nodes.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.Geometry.SpatialTreesNode3dT

**Namespace:**
Grasshopper.Kernel.Geometry.SpatialTrees
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Node3d<T>

    Public NotInheritable Class Node3d(Of T)

#### Type Parameters

T

The Node3dT type exposes the following members.

Constructors

| Name| Description
---|---|---
| Node3dT(Coordinates3dT,
BoundingBox)|
Create a new spatial tree root.
| Node3dT(Coordinates3dT,
BoundingBox,
Int32)|
Create a new spatial tree root.
Top

Properties

| Name| Description
---|---|---
|
Center|
Gets the center of the spatial region of this node. If the node contains no
children the center is always in the middle of the Region. If the node does
contain child-nodes, the center may be anywhere within the region.
|
ChildCount|
Gets the number of defined child nodes. Leaf nodes have no children. Root and
twig nodes can have anywhere between 1 and 8 children.
|
ChildNode|
Gets the child node at the given index.
|
ContentAverage|
Returns the average coordinate of all items in this node. If this node does
not contain any items, Point3d.Unset is returned.
|
ContentBoundingBox|
Returns the boundingbox of all items in this node. If this node does not
contain any items, BoundingBox.Empty is returned.
|
IndicesLocal|
Gets the list of item indices that are contained within this node.
|
IndicesRecursive|
Gets the list of item indices that are contained within this node and any
child nodes.
|
IsLeaf|
Gets whether this node is a leaf node. Leaf nodes have no child nodes.
|
IsMutable|
Gets whether this tree is mutable. You can only add items to mutable trees. We
don't recommend removing items from unmutable trees, though that shouldn't
necessarily lead to problems. Trees become unmutable after a call to
ShrinkRegions(), CollapseNodes() or OptimizeTree().
|
IsRoot|
Gets whether this node is a root node. Root nodes have no parent node and
depth zero.
|
IsTwig|
Gets whether this node is a twig node. Twig nodes have both parents and at
least one child.
|
ItemCount|
Gets the total number of items stored directly in this node.
|
ItemsGlobal|
Gets the list of all items stored inside this entire tree. Do not modify this
collection unless you know what you are doing.
|
ItemsLocal|
Gets a list of all the items stored directly in this node. This list is
constructed every time you access this property, so keep it down to a minimum.
|
Limit|  Gets
the subdivision limit for this tree. This limit can only be set once when you
create a new tree. It is fixed forever after.
|
MemoryConsumption|
Gets the estimated memory consumption of the (sub)tree structure. Items inside
the global list are not included in this estimate.
|
NextNode|
Gets the logical neighbour to the right of this node. There is no spatial
relationships between logical neighbours, this is purely an iteration aid.
|
NodeDepth|
Gets the recursive depth of this node. The tree root is at depth zero. The
first subdivision is at depth one, and so on and so forth.
|
ParentNode|
Gets the immediate parent of this node. Root nodes have no parent.
|
Region|
Gets the spatial region of this node.
|
RootNode|
Gets the ultimate root node for this tree.
|
WeightedSubdivision|
Gets or sets whether subdivision is weighted based on content averages.
Setting this value will only affect future subdivisions, not existing ones.
Top

Methods

| Name| Description
---|---|---
|
Add|  Insert
another item into the tree. The item should be within the region of this node.
|
AddRange|
Insert a collection of items into the tree. The items should all be within the
region of this node.
|
AddToRhinoDocument|
|
CollapseNodes|
Collapse the (sub)tree rooted at this node. Collapsing happens when a node
only has a single child, in which case the child usurps the position
previously held by the parent. Do not collapse a (sub)tree if you still plan
to add items later.
|
FurthestItem(T)|
Find the furtest item.
|
FurthestItem(Point3d)|
Find the furtest item.
| FurthestItem(Double, Double,
Double)|
Find the furtest item.
| FurthestItem(T, Double,
Double)|
Find the furtest item.
| FurthestItem(Point3d, Double,
Double)|
Find the furtest item.
| FurthestItem(Double, Double,
Double, Double,
Double)|
Find the furtest item.
|
NearestItem(T)|
Find the nearest item.
|
NearestItem(Point3d)|
Find the nearest item.
| NearestItem(Double, Double,
Double)|
Find the nearest item.
| NearestItem(T, Double,
Double)|
Find the nearest item.
| NearestItem(Point3d, Double,
Double)|
Find the nearest item.
| NearestItem(Double, Double, Double,
Validation3dT)|
Find the nearest item using custom validation criteria.
| NearestItem(Double, Double, Double,
Double,
Double)|
Find the nearest item.
| NearestItems(T,
Int32)|
Find the N nearest items.
| NearestItems(Double, Double,
Double,
Int32)|
Find the N nearest items.
| NearestItems(T, Int32, Double,
Double)|
Find the N nearest items.
| NearestItems(Double, Double,
Double, Int32, Double,
Double)|
Find the N nearest items.
|
OptimizeTree|
Optimize this tree for fast searches. Do not call this method if you still
plan to add items in the future. You can no longer modify this tree once it
has been optimized.
|
Remove(Index3dT)|
Remove the item with the given index from the entire tree. It doesn't matter
on which node you call this function, it is a tree-wide operation.
|
Remove(Int32)|
Remove the item with the given index from the entire tree. It doesn't matter
on which node you call this function, it is a tree-wide operation.
|
ShrinkRegions|
Shrink the region for this node and all child nodes. Do not use this method if
you intend to add more items later as it creates spatial gaps in the tree
structure. You can shrink nodes if you're done adding items and want to start
searching the tree.
|
SubTree|
Gets an iterator for all nodes in this (sub)tree.
|
TrimExcess|
Trim the excess space on all index lists. You can call this method to reduce
memory usage. It will not modify the tree in any functional way.
Top

See Also

#### Reference

Grasshopper.Kernel.Geometry.SpatialTrees
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com