---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_SolutionEventArgs.htm
scraped_at: 2025-09-08T16:17:53.664652
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_SolutionEventArgs
Class](../html/T_Grasshopper_Kernel_GH_SolutionEventArgs.htm
"GH_SolutionEventArgs Class")

[GH_SolutionEventArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_SolutionEventArgs.htm
"GH_SolutionEventArgs Properties")

!Click or drag to
resize

# GH_SolutionEventArgs Class

---

Event arguments used for Document Solution events.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_SolutionEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_SolutionEventArgs : EventArgs

    Public Class GH_SolutionEventArgs
    	Inherits EventArgs

The GH_SolutionEventArgs type exposes the following members.

Properties

| Name| Description
---|---|---
|
Document|  Gets the
document that raised the event, should be the same as the "sender" parameter
in the event handler.
|
Duration|  Gets the
duration for this solution. The duration is a more accurate measure than
EndTime-StartTime.
|
StartTime|  Gets
the time when the current solution began.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com