---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelFont.htm
scraped_at: 2025-09-08T16:22:39.889655
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelFont Class](../html/T_Grasshopper_Rhinoceros_ModelFont.htm "ModelFont
Class")

[ModelFont Constructor
](../html/Overload_Grasshopper_Rhinoceros_ModelFont__ctor.htm "ModelFont
Constructor ")

[ModelFont
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelFont.htm
"ModelFont Properties")

[ModelFont Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelFont.htm
"ModelFont Methods")

[ModelFont Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_ModelFont.htm
"ModelFont Type Conversions")

!Click or drag to
resize

# ModelFont Class

---

Represents a typography font. Wraps the functionality of the Font type.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooFont
Grasshopper.RhinocerosModelFont

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelFont : GH_Goo<Font>,
    	IEquatable<ModelFont>

    Public NotInheritable Class ModelFont
    	Inherits GH_Goo(Of Font)
    	Implements IEquatable(Of ModelFont)

The ModelFont type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelFont| Initializes a new
instance of the ModelFont class
|
ModelFont(Font)| Initializes
a new instance of the ModelFont class
|
ModelFont(String)|
Initializes a new instance of the ModelFont class
Top

Properties

| Name| Description
---|---|---
|
FamilyName|
!Static
member|
InstalledFamilies|
!Static
member|
InstalledFonts|
|
IsInstalled|
|
IsValid|  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Inherited from
GH_GooT.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ|  Attempt a cast
to type Q.  (Inherited from
GH_GooT.)
|
Duplicate|  (Overrides
GH_GooTDuplicate.)
|
EmitProxy|  Create a new
proxy for this instance. Return Null if this class does not support proxies.
(Inherited from GH_GooT.)
|
Equals(ModelFont)|
|
Equals(Object)|  (Overrides
[ObjectEquals(Object)](https://docs.microsoft.com/dotnet/api/system.object.equals#system-
object-equals\(system-object\)).)
|
GetHashCode|  (Overrides
[ObjectGetHashCode](https://docs.microsoft.com/dotnet/api/system.object.gethashcode#system-
object-gethashcode).)
|
IsFamilyNameInstalled|
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Operators

| Name| Description
---|---|---
!Static
member| (Font to
ModelFont)|
!Static
member| (String to
ModelFont)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com