---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_GeometricGooWrapper.htm
scraped_at: 2025-09-08T16:20:40.393509
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_GeometricGooWrapper
Class](../html/T_Grasshopper_Kernel_Types_GH_GeometricGooWrapper.htm
"GH_GeometricGooWrapper Class")

[GH_GeometricGooWrapper Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_GeometricGooWrapper__ctor.htm
"GH_GeometricGooWrapper Constructor ")

[GH_GeometricGooWrapper
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_GeometricGooWrapper.htm
"GH_GeometricGooWrapper Properties")

[GH_GeometricGooWrapper
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_GeometricGooWrapper.htm
"GH_GeometricGooWrapper Methods")

!Click or drag to
resize

# GH_GeometricGooWrapper Class

---

Utility class for maintaining all kinds of IGH_GeometricGoo types.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GeometricGooWrapper

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_GeometricGooWrapper : IGH_GeometricGoo

    Public NotInheritable Class GH_GeometricGooWrapper
    	Implements IGH_GeometricGoo

The GH_GeometricGooWrapper type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_GeometricGooWrapper|
Initializes a new instance of the GH_GeometricGooWrapper class
|
GH_GeometricGooWrapper(IGH_GeometricGoo)|
Initializes a new instance of the GH_GeometricGooWrapper class
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
|
InternalGoo|
|
IsGeometryLoaded|
|
IsReferencedGeometry|
|
IsValid|
|
IsValidWhyNot|
|
ReferenceID|
|
TypeDescription|
|
TypeName|
Top

Methods

| Name| Description
---|---|---
|
CastFrom|
|
CastToT|
|
ClearCaches|
|
Duplicate|
|
DuplicateGeometry|
|
EmitProxy|
|
GetBoundingBox|
|
LoadGeometry|
|
LoadGeometry(RhinoDoc)|
|
Morph|
|
Read|
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disapears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Transform|
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com