---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Folders.htm
scraped_at: 2025-09-08T16:11:45.116053
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper

Folders Class

[Folders Properties](../html/Properties_T_Grasshopper_Folders.htm "Folders
Properties")

Folders Methods

!Click or drag to
resize

# Folders Class

---

Provides access to all standard Grasshopper file and folder locations.

Inheritance Hierarchy

SystemObject
GrasshopperFolders

**Namespace:** Grasshopper
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Folders

    Public NotInheritable Class Folders

The Folders type exposes the following members.

Properties

| Name| Description
---|---|---
!Static
member|
AppDataFolder|  Gets the appdata
folder for Grasshopper.
!Static
member|
AssemblyFolders|  Gets a list of
all the directories from which GHA assemblies are loaded. Note: this is not
the same as all folders from which GHA files _were_ loaded at startup. This
list includes the default Grasshopper folders, custom GHA folders and the
locations provided by Rhino.Runtime.HostUtils.GetAssemblySearchPaths().
Folders which do not contain GHA files are omitted, as are duplicate entries.
!Static
member|
AutoSaveFolder|  Gets the
directory in windows ApplicationData that contains the Grasshopper autosave
files.
!Static
member|
ClusterFolders|  Gets a list of
all the directories from which GHCLUSTER files are loaded. GHUSER files are
loaded from subfolders as well.
!Static
member|
CursorFolder|  Gets the directory
that contains the cursor files that ship with Grasshopper.
!Static
member|
CustomAssemblyFolders|
Gets or sets all custom assembly folders.
!Static
member|
DefaultAssemblyFolder|
Gets the standard directory in windows ApplicationData that contains 3rd party
GHA files.
!Static
member|
DefaultClusterFolder|  Gets
the standard directory in windows ApplicationData that contains GHCLUSTER
files.
!Static
member|
DefaultTemplateFolder|
Gets the standard directory in windows ApplicationData that contains template
files.
!Static
member|
DefaultUserObjectFolder|
Gets the standard directory in windows ApplicationData that contains GHUSER
files.
!Static
member| Desktop|
Gets the desktop directory of the current user profile.
!Static
member|
DownloaderApplication|
Gets the location where the Downloader.exe should be. If the application is
not present, null is returned.
!Static
member|
FileViewerApplication|
Gets the location where the FileViewer.exe should be. If the application is
not present, null is returned.
!Static
member|
IconFolder|  Gets the directory that
contains the icon files that ship with Grasshopper.
!Static
member|
ImageStitcherApplication|
Gets the location where the ImageStitcher.exe should be. If the application is
not present, null is returned.
!Static
member|
PluginFolder|  Gets the directory
that contains the Grasshopper.dll file.
!Static
member|
SDKDownloaderApplication|
Gets the location where the SDKDownloader.exe should be. If the application is
not present, null is returned.
!Static
member|
SettingsFolder|  Gets the folder
into which all Grasshopper settings are stored. This folder might not exist
until some settings are actually saved.
!Static
member|
TemplateFolders|  Gets a list of
all the directories from which template files are loaded. Templates are not
loaded from subfolders.
!Static
member|
ToolsFolder|  **Obsolete.** Gets the
directory that contains the additional executables that ship with Grasshopper.
!Static
member|
TutorialFiles|  Gets an array of
all the tutorial files. This includes all the files with the *.gh or *.ghx
extension in the Tutorials folder. Subfolders are not traversed.
!Static
member|
TutorialFolder|  Gets the
directory that contains the tutorial files that ship with Grasshopper.
!Static
member|
UserObjectFolders|  Gets a list
of all the directories from which GHUSER files are loaded. GHUSER files are
loaded from subfolders as well.
!Static
member|
VersionHistoryFile|  Gets the
text file location where Grasshopper will save the latest version information.
!Static
member|
VersionHistoryUrl|  Gets the
url of the version history data.
Top

Methods

| Name| Description
---|---|---
|
ShowFolderInExplorer|  Open
a specific folder in Windows Explorer.
Top

See Also

#### Reference

Grasshopper Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com