---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelComponentContent.htm
scraped_at: 2025-09-08T16:22:31.851954
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelComponentContent
Class](../html/T_Grasshopper_Rhinoceros_ModelComponentContent.htm
"ModelComponentContent Class")

[ModelComponentContent
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelComponentContent.htm
"ModelComponentContent Properties")

[ModelComponentContent
Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelComponentContent.htm
"ModelComponentContent Methods")

[ModelComponentContent
Fields](../html/Fields_T_Grasshopper_Rhinoceros_ModelComponentContent.htm
"ModelComponentContent Fields")

!Click or drag to
resize

# ModelComponentContent Class

---

Represents a Rhino model component. Wraps the functionality of the
ModelComponent type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.RhinocerosModelComponentContent
More...

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class ModelComponentContent : ModelContent

    Public MustInherit Class ModelComponentContent
    	Inherits ModelContent

The ModelComponentContent type exposes the following members.

Properties

| Name| Description
---|---|---
|
Attribs|
|
DefaultAttributes|
(Inherited from ModelData.)
|
Id|  (Inherited from
ModelContent.)
|
IsReferencedData|
(Inherited from ModelContent.)
|
IsReferencedDataLoaded|
(Inherited from ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
IsValidWhyNot|
(Inherited from ModelContent.)
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
|
TypeDescription|
(Inherited from ModelData.)
|
UserText|
Top

Methods

| Name| Description
---|---|---
|
AsFrozen|  Try to obtain
a dereferenced snapshot of itself.  (Inherited from
ModelContent.)
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
InternaliseData|
(Inherited from ModelContent.)
|
LoadReferencedData|
(Inherited from ModelContent.)
|
Read|  (Inherited from
ModelContent.)
|
RuntimeId|  (Inherited
from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
|
UnloadReferencedData|
(Inherited from ModelContent.)
|
Write|  (Inherited from
ModelContent.)
Top

Fields

| Name| Description
---|---|---
|
Serial|  (Inherited from
ModelData.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.RhinocerosModelComponentContent
Grasshopper.Rhinoceros.AnnotationsModelAnnotationStyle
Grasshopper.Rhinoceros.DraftingModelHatchPattern
Grasshopper.Rhinoceros.DraftingModelLinetype
Grasshopper.Rhinoceros.ModelModelInstanceDefinition
Grasshopper.Rhinoceros.ModelModelLayer
Grasshopper.Rhinoceros.ModelModelObject

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com