---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Render_ModelRenderSun_Attributes.htm
scraped_at: 2025-09-08T16:24:44.438985
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Render](../html/N_Grasshopper_Rhinoceros_Render.htm
"Grasshopper.Rhinoceros.Render")

[ModelRenderSun.Attributes
Class](../html/T_Grasshopper_Rhinoceros_Render_ModelRenderSun_Attributes.htm
"ModelRenderSun.Attributes Class")

[ModelRenderSun.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_Render_ModelRenderSun_Attributes__ctor.htm
"ModelRenderSun.Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Render_ModelRenderSun_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Render_ModelRenderSun_Attributes.htm
"Attributes Methods")

!Click or drag to
resize

# ModelRenderSunAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
Grasshopper.Rhinoceros.RenderModelRenderSunAttributes

**Namespace:**
Grasshopper.Rhinoceros.Render
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Attributes : ModelContentAttributes,
    	IEquatable<ModelRenderSunAttributes>

    Public NotInheritable Class Attributes
    	Inherits ModelContentAttributes
    	Implements IEquatable(Of ModelRenderSunAttributes)

The ModelRenderSunAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelRenderSunAttributes|
Initializes a new instance of the ModelRenderSunAttributes class
Top

Properties

| Name| Description
---|---|---
|
Altitude|
|
Azimuth|
|
DateTime|
|
DaylightSavingEnabled|
|
DaylightSavingMinutes|
|
Direction|
|
Enabled|
|
Intensity|
|
Latitude|
|
Longitude|
|
Manual|
|
Name|  The last
component of the element Path.  (Inherited from
ModelContentAttributes.)
|
North|
|
Notes|
(Inherited from
ModelContentAttributes.)
|
Parent|  Path
of the parent element in 'Root::Parent' format if nested.  (Inherited from
ModelContentAttributes.)
|
Path|  Full
content path in 'Root::Parent::Name' format if is nested.  (Inherited from
ModelContentAttributes.)
|
Tags|  (Inherited
from
ModelContentAttributes.)
|
TimeZone|
Top

Methods

| Name| Description
---|---|---
|
Clone|  (Inherited
from
ModelDataAttributes.)
|
Equals(Object)|
(Inherited from
ModelContentAttributes.)
|
GetHashCode|
(Inherited from
ModelContentAttributes.)
|
ToDetails|
(Overrides
ModelDataAttributesToDetails.)
|
ToModelData|
(Overrides
ModelDataAttributesToModelData.)
|
ToString|
(Overrides
ModelContentAttributesToString.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Render Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com