---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_UserPromptAware.htm
scraped_at: 2025-09-08T16:18:46.910144
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_UserPromptAware
Interface](../html/T_Grasshopper_Kernel_IGH_UserPromptAware.htm
"IGH_UserPromptAware Interface")

[IGH_UserPromptAware
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_UserPromptAware.htm
"IGH_UserPromptAware Methods")

!Click or drag to
resize

# IGH_UserPromptAware Interface

---

Implement this interface in your IGH_Param if you want to allow users to set
data either through the menu or by double clicking.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_UserPromptAware

    Public Interface IGH_UserPromptAware

The IGH_UserPromptAware type exposes the following members.

Methods

| Name| Description
---|---|---
|
PromptMenuMultipleItems|
Create a menu item that will be inserted into the Parameter context menu for
getting multiple values.
|
PromptMenuSingleItem|
Create a menu item that will be inserted into the Parameter context menu for
getting single values.
|
PromptMultipleItems|
Get multiple items from the user.
|
PromptSingleItem|
Get a single item from the user.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com