---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Drafting_ModelHatchPattern_Attributes.htm
scraped_at: 2025-09-08T16:23:50.184333
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Drafting](../html/N_Grasshopper_Rhinoceros_Drafting.htm
"Grasshopper.Rhinoceros.Drafting")

[ModelHatchPattern.Attributes
Class](../html/T_Grasshopper_Rhinoceros_Drafting_ModelHatchPattern_Attributes.htm
"ModelHatchPattern.Attributes Class")

[ModelHatchPattern.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_Drafting_ModelHatchPattern_Attributes__ctor.htm
"ModelHatchPattern.Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Drafting_ModelHatchPattern_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Drafting_ModelHatchPattern_Attributes.htm
"Attributes Methods")

[Attributes Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Drafting_ModelHatchPattern_Attributes.htm
"Attributes Type Conversions")

!Click or drag to
resize

# ModelHatchPatternAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
Grasshopper.RhinocerosModelComponentContentAttributes
Grasshopper.Rhinoceros.DraftingModelHatchPatternAttributes

**Namespace:**
Grasshopper.Rhinoceros.Drafting
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Attributes : ModelComponentContentAttributes,
    	IEquatable<ModelHatchPatternAttributes>

    Public NotInheritable Class Attributes
    	Inherits ModelComponentContentAttributes
    	Implements IEquatable(Of ModelHatchPatternAttributes)

The ModelHatchPatternAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelHatchPatternAttributes|
Initializes a new instance of the ModelHatchPatternAttributes class
Top

Properties

| Name| Description
---|---|---
|
Lines|
|
Name|  The last
component of the element Path.  (Inherited from
ModelContentAttributes.)
|
Notes|
(Inherited from
ModelContentAttributes.)
|
Parent|  Path
of the parent element in 'Root::Parent' format if nested.  (Inherited from
ModelContentAttributes.)
|
Path|  Full
content path in 'Root::Parent::Name' format if is nested.  (Inherited from
ModelContentAttributes.)
|
Tags|  (Inherited
from
ModelContentAttributes.)
|
UserText|
(Inherited from
ModelComponentContentAttributes.)
Top

Methods

| Name| Description
---|---|---
|
Clone|  (Inherited
from
ModelDataAttributes.)
|
Equals(Object)|
(Inherited from
ModelContentAttributes.)
|
GetHashCode|
(Inherited from
ModelContentAttributes.)
|
ToDetails|
(Overrides
ModelComponentContentAttributesToDetails.)
|
ToModelData|
(Overrides
ModelDataAttributesToModelData.)
|
ToString|
(Inherited from
ModelContentAttributes.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (String to
ModelHatchPatternAttributes)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Drafting
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com