---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_InstanceDescription.htm
scraped_at: 2025-09-08T16:16:59.444870
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_InstanceDescription
Class](../html/T_Grasshopper_Kernel_GH_InstanceDescription.htm
"GH_InstanceDescription Class")

[GH_InstanceDescription
Properties](../html/Properties_T_Grasshopper_Kernel_GH_InstanceDescription.htm
"GH_InstanceDescription Properties")

[GH_InstanceDescription
Methods](../html/Methods_T_Grasshopper_Kernel_GH_InstanceDescription.htm
"GH_InstanceDescription Methods")

!Click or drag to
resize

# GH_InstanceDescription Class

---

Base implementation of IGH_InstanceDescription. Consider deriving from this
class rather than implementing IGH_InstanceDescription from scratch.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_InstanceDescription
Grasshopper.KernelGH_DocumentObject

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_InstanceDescription : IGH_InstanceDescription

    Public Class GH_InstanceDescription
    	Implements IGH_InstanceDescription

The GH_InstanceDescription type exposes the following members.

Properties

| Name| Description
---|---|---
|
Category|  Gets or
sets the Category in which this object belongs. If HasCategory() returns
false, this field has no meaning.
|
Description|
Gets or sets the description of the object. This field typically remains fixed
during the lifetime of an object.
|
HasCategory|
Gets whether or not the Category field has been set.
|
HasSubCategory|
Gets whether or not the SubCategory field has been set.
|
InstanceDescription|
Gets a description of the current state of the object. This field is usually
the same as the Description() field, but it might be variable when overridden.
|
InstanceGuid|
Gets the ID of this runtime instance.
|
Keywords|  Gets a
list of additional keywords that describe the object. Typically this list is
empty but you can override this property to aid in object searches.
|
Name|  Gets or sets
the name of the object. This field typically remains fixed during the lifetime
of an object.
|
NickName|  Gets or
sets the nickname of the object. This field can be changed by the user.
|
SubCategory|
Gets or sets the SubCategory in which this object belongs. If HasSubCategory()
returns false, this field has no meaning.
Top

Methods

| Name| Description
---|---|---
|
CopyFrom|  Copy
all fields (except the instance ID) from another instance description.
|
NewInstanceGuid|
Generate a new random instance GUID
|
NewInstanceGuid(Guid)|
Set the instance ID to be a specific GUID. This is very dangerous, only use
this function if you're 6"4' and your first name is David.
|
Read|  Default
deserialization. Only retrieves Name, NickName, Description and InstanceGuid
fields. If you want to retrieve additional fields use ReadFull() instead.
However, ReadFull() will only work if the archive was written using
WriteFull().
|
ReadFull|
GH_InstanceDescription does not by default serialize all fields. Use this
function to read _all_ fields from the archive. This method is compatible with
the default Write()/Read() operations.
|
Write|  Default
serialization. Only stores Name, NickName, Description and InstanceGuid
fields. If you want to store additional fields use WriteFull() instead.
|
WriteFull|
GH_InstanceDescription does not by default serialize all fields. Use this
function to write _all_ fields to the archive. This method is compatible with
the default Write()/Read() operations.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com