---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_RenderAwareData.htm
scraped_at: 2025-09-08T16:18:41.870807
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_RenderAwareData
Interface](../html/T_Grasshopper_Kernel_IGH_RenderAwareData.htm
"IGH_RenderAwareData Interface")

[IGH_RenderAwareData
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_RenderAwareData.htm
"IGH_RenderAwareData Methods")

!Click or drag to
resize

# IGH_RenderAwareData Interface

---

Implement this interface in your IGH_Goo type if it may have render geometry.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_RenderAwareData

    Public Interface IGH_RenderAwareData

The IGH_RenderAwareData type exposes the following members.

Methods

| Name| Description
---|---|---
|
AppendRenderGeometry|
Push this geometry down a render pipeline.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com