---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Drafting_ObjectDrafting.htm
scraped_at: 2025-09-08T16:23:54.201006
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Drafting](../html/N_Grasshopper_Rhinoceros_Drafting.htm
"Grasshopper.Rhinoceros.Drafting")

[ObjectDrafting
Class](../html/T_Grasshopper_Rhinoceros_Drafting_ObjectDrafting.htm
"ObjectDrafting Class")

[ObjectDrafting Constructor
](../html/Overload_Grasshopper_Rhinoceros_Drafting_ObjectDrafting__ctor.htm
"ObjectDrafting Constructor ")

[ObjectDrafting
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Drafting_ObjectDrafting.htm
"ObjectDrafting Properties")

[ObjectDrafting
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Drafting_ObjectDrafting.htm
"ObjectDrafting Methods")

[ObjectDrafting Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Drafting_ObjectDrafting.htm
"ObjectDrafting Type Conversions")

!Click or drag to
resize

# ObjectDrafting Class

---

Represents a Rhino object drafting attributes.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.Rhinoceros.DraftingObjectDrafting

**Namespace:**
Grasshopper.Rhinoceros.Drafting
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ObjectDrafting : ModelValue

    Public NotInheritable Class ObjectDrafting
    	Inherits ModelValue

The ObjectDrafting type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectDrafting|
Initializes a new instance of the ObjectDrafting class
|
ObjectDrafting(ObjectDraftingAttributes)|
Initializes a new instance of the ObjectDrafting class
Top

Properties

| Name| Description
---|---|---
|
Color|
|
LineScale|
|
Linetype|
|
LineWidth|
|
Order|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelValueCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelValue.)
|
Equals(ModelValue)|
(Inherited from ModelValue.)
|
Equals(Object)|
(Overrides
ModelValueEquals(Object).)
|
GetHashCode|
(Overrides
ModelValueGetHashCode.)
|
ToAttributes|
|
ToDetails|
|
TooltipString|
(Inherited from ModelValue.)
|
ToString|  (Inherited from
ModelValue.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ObjectDraftingAttributes to
ObjectDrafting)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Drafting
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com