---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_TagArtists_GH_TagArtist.htm
scraped_at: 2025-09-08T16:14:56.917179
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas.TagArtists](../html/N_Grasshopper_GUI_Canvas_TagArtists.htm
"Grasshopper.GUI.Canvas.TagArtists")

[GH_TagArtist
Class](../html/T_Grasshopper_GUI_Canvas_TagArtists_GH_TagArtist.htm
"GH_TagArtist Class")

[GH_TagArtist Constructor
](../html/M_Grasshopper_GUI_Canvas_TagArtists_GH_TagArtist__ctor.htm
"GH_TagArtist Constructor ")

[GH_TagArtist
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_TagArtists_GH_TagArtist.htm
"GH_TagArtist Properties")

[GH_TagArtist
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_TagArtists_GH_TagArtist.htm
"GH_TagArtist Methods")

!Click or drag to
resize

# GH_TagArtist Class

---

Provides a basic implementation of the IGH_TagArtist interface.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.Canvas.TagArtistsGH_TagArtist
Grasshopper.GUI.Canvas.TagArtistsGH_TagArtist_WirePainter

**Namespace:**
Grasshopper.GUI.Canvas.TagArtists
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_TagArtist : IGH_TagArtist

    Public MustInherit Class GH_TagArtist
    	Implements IGH_TagArtist

The GH_TagArtist type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_TagArtist|
Initializes a new instance of the GH_TagArtist class
Top

Properties

| Name| Description
---|---|---
|
ID|  Gets the ID of
this TagArtist object.
Top

Methods

| Name| Description
---|---|---
|
Paint|  This
method is called whenever a Canvas channel is painted
Top

See Also

#### Reference

Grasshopper.GUI.Canvas.TagArtists
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com