---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_Params_Param_AnnotationUnitsSettings.htm
scraped_at: 2025-09-08T16:23:12.077895
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations.Params](../html/N_Grasshopper_Rhinoceros_Annotations_Params.htm
"Grasshopper.Rhinoceros.Annotations.Params")

[Param_AnnotationUnitsSettings
Class](../html/T_Grasshopper_Rhinoceros_Annotations_Params_Param_AnnotationUnitsSettings.htm
"Param_AnnotationUnitsSettings Class")

[Param_AnnotationUnitsSettings Constructor
](../html/M_Grasshopper_Rhinoceros_Annotations_Params_Param_AnnotationUnitsSettings__ctor.htm
"Param_AnnotationUnitsSettings Constructor ")

[Param_AnnotationUnitsSettings
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_Params_Param_AnnotationUnitsSettings.htm
"Param_AnnotationUnitsSettings Properties")

[Param_AnnotationUnitsSettings
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_Params_Param_AnnotationUnitsSettings.htm
"Param_AnnotationUnitsSettings Methods")

[Param_AnnotationUnitsSettings
Events](../html/Events_T_Grasshopper_Rhinoceros_Annotations_Params_Param_AnnotationUnitsSettings.htm
"Param_AnnotationUnitsSettings Events")

!Click or drag to
resize

# Param_AnnotationUnitsSettings Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_InstanceDescription
Grasshopper.KernelGH_DocumentObject
Grasshopper.KernelGH_ActiveObject
Grasshopper.KernelGH_ParamAnnotationUnitsSettings
Grasshopper.Rhinoceros.ParamsModelDataParamAnnotationUnitsSettings
Grasshopper.Rhinoceros.Annotations.ParamsParam_AnnotationUnitsSettings

**Namespace:**
Grasshopper.Rhinoceros.Annotations.Params
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Param_AnnotationUnitsSettings : ModelDataParam<AnnotationUnitsSettings>

    Public NotInheritable Class Param_AnnotationUnitsSettings
    	Inherits ModelDataParam(Of AnnotationUnitsSettings)

The Param_AnnotationUnitsSettings type exposes the following members.

Constructors

| Name| Description
---|---|---
|
Param_AnnotationUnitsSettings|
Initializes a new instance of the Param_AnnotationUnitsSettings class
Top

Properties

| Name| Description
---|---|---
|
Access|  Gets or sets the Access
level for this parameter.  (Inherited from
GH_ParamT.)
|
Attributes|  Gets or
sets the attributes that are associated with this object. Only set custom
attributes if you know what you are doing.  (Inherited from
GH_DocumentObject.)
|
Category|  Gets or
sets the Category in which this object belongs. If HasCategory() returns
false, this field has no meaning.  (Inherited from
GH_InstanceDescription.)
|
ComponentGuid|
(Overrides
GH_DocumentObjectComponentGuid.)
|
DataMapping|  Gets or sets
the data mapping of this Parameter.  (Inherited from
GH_ParamT.)
|
DataType|  Type is either Void
if there are no sources or Remote. Derived classes should expand on this.
(Inherited from GH_ParamT.)
|
Description|
Gets or sets the description of the object. This field typically remains fixed
during the lifetime of an object.  (Inherited from
GH_InstanceDescription.)
|
Exposure|
(Overrides
GH_DocumentObjectExposure.)
|
HasCategory|
Gets whether or not the Category field has been set.  (Inherited from
GH_InstanceDescription.)
|
HasProxySources|  Gets
a value indicating whether or not this parameter maintains proxy sources.
Proxy sources are used during file IO, when actual sources might not be
available yet. Once an IO operation has been completed there should be no more
proxy sources.  (Inherited from
GH_ParamT.)
|
HasSubCategory|
Gets whether or not the SubCategory field has been set.  (Inherited from
GH_InstanceDescription.)
|
Icon_24x24|  The icon
associated with this object.  (Inherited from
GH_DocumentObject.)
|
Icon_24x24_Locked|
The greyscale icon of this object.  (Inherited from
GH_DocumentObject.)
|
IconCapableUI|  By
default the NickName menu item supports the Icon Mode override toggle. If your
UI is not capable of displaying icons, then override this property and return
False.  (Inherited from
GH_ActiveObject.)
|
IconDisplayMode|
Gets the current display mode of the object.  (Inherited from
GH_DocumentObject.)
|
InstanceDescription|
Gets the description of this instance. The default description is about the
amount and source of the local values.  (Inherited from
GH_ParamT.)
|
InstanceGuid|
Gets the ID of this runtime instance.  (Inherited from
GH_InstanceDescription.)
|
IsDataProvider|
(Inherited from GH_ParamT.)
|
IsPrincipal|  Gets whether
this parameter is a principal parameter. Principal parameters are maintained
by components and are not part of the IGH_Param interface.  (Inherited from
GH_ParamT.)
|
Keywords|  Gets a
list of additional keywords that describe the object. Typically this list is
empty but you can override this property to aid in object searches.
(Inherited from
GH_InstanceDescription.)
|
Kind|  Gets the parameter kind.
The kind is evaluated lazily and cached.  (Inherited from
GH_ParamT.)
|
Locked|  Gets or sets the
enabled flag of this object. Disabled objects are ignored during solutions.
(Inherited from GH_ActiveObject.)
|
MutableNickName|
Gets or sets a value that enables Nick name changes through the menu. The
default is TRUE.  (Inherited from
GH_ActiveObject.)
|
Name|  Gets or sets
the name of the object. This field typically remains fixed during the lifetime
of an object.  (Inherited from
GH_InstanceDescription.)
|
NickName|  Gets or
sets the nickname of the object. This field can be changed by the user.
(Inherited from
GH_InstanceDescription.)
|
Obsolete|  Gets whether
this object is obsolete. Default implementation returns true if the class name
contains the string "OBSOLETE" or if this class has been decorated with the
ObsoleteAttribute. You are free to override this if you want, but I suggest
adding the ObsoleteAttribute instead.  (Inherited from
GH_DocumentObject.)
|
Optional|  Gets or sets
whether or not this parameter is considered optional by the owner component.
Empty, non-optional parameters prevent the component from being solved.
(Inherited from GH_ParamT.)
|
Phase|  Gets or sets the
solution phase this object is currenly in.  (Inherited from
GH_ActiveObject.)
|
ProcessorTime|
(Inherited from GH_ParamT.)
|
ProxySourceCount|
Gets the number of proxy sources for this parameter. Proxy sources are used
during file IO, when actual sources might not be available yet. Once an IO
operation has been completed there should be no more proxy sources.
(Inherited from GH_ParamT.)
|
Recipients|  Gets a list of
all the recipients of this parameter. I.e. a recipient has this parameter as
one of the sources. The Recipient list is maintained by the parameter, do not
modify it yourself.  (Inherited from
GH_ParamT.)
|
Reverse|  Gets or sets the data
reverse modifier of this parameter.  (Inherited from
GH_ParamT.)
|
RuntimeMessageLevel|
Returns the worst case flag for the current object If the object contains at
least 1 error, the result is Error.If the object contains at least 1 warning,
the result is Warning.If the object contains at least 1 message, the result is
Remark.If the object contains no errors, no warnings and no messages, the
result is Blank. (Inherited from
GH_ActiveObject.)
|
Simplify|  Gets or sets the
simplify modifier for this parameter.  (Inherited from
GH_ParamT.)
|
SourceCount|  Gets the
number of sources for this parameter.  (Inherited from
GH_ParamT.)
|
Sources|  Gets a list of source
parameters. Do not modify this list, if you wish to add or remove sources, use
dedicated functions like AddSource() and RemoveSource() instead.  (Inherited
from GH_ParamT.)
|
StateTags|  Gets all the
StateTags that are associated with this parameter. A state tag is a visual
feedback icon that represents specific internal settings.  (Inherited from
GH_ParamT.)
|
SubCategory|
Gets or sets the SubCategory in which this object belongs. If HasSubCategory()
returns false, this field has no meaning.  (Inherited from
GH_InstanceDescription.)
|
Type|  Gets the Framework Type
descriptor for the stored Data.  (Inherited from
GH_ParamT.)
|
TypeName|
(Inherited from
ModelDataParamT.)
|
VolatileData|  (Inherited
from GH_ParamT.)
|
VolatileDataCount|
(Inherited from GH_ParamT.)
|
WireDisplay|  Gets or sets
the wire display style for this parameter. Wire display only affects the wires
connected to the parameter input.  (Inherited from
GH_ParamT.)
Top

Methods

| Name| Description
---|---|---
|
AddedToDocument|
This method will be called when an object is added to a document. Override
this method if you want to handle such events.  (Inherited from
GH_DocumentObject.)
|
AddRuntimeMessage|
Add a new message to this object. Valid message type flags are Warning and
Error. If the Message string is empty or zero-length no message is added.
(Inherited from GH_ActiveObject.)
|
AddSource(IGH_Param)|  Append
a new Source parameter to the end of the Sources list. Sources provide this
parameter with data at runtime.  (Inherited from
GH_ParamT.)
| AddSource(IGH_Param,
Int32)|  Insert a new Source
parameter into the Sources list. Sources provide this parameter with data at
runtime.  (Inherited from GH_ParamT.)
| AddVolatileData(GH_Path, Int32,
T)|  (Inherited from
GH_ParamT.)
| AddVolatileData(GH_Path, Int32,
Object)|  Inserts an
item of volatile data into the data structure.  (Inherited from
GH_ParamT.)
| AddVolatileDataList(GH_Path,
ListT)|  (Inherited
from GH_ParamT.)
| AddVolatileDataList(GH_Path,
IEnumerable)|
(Inherited from GH_ParamT.)
|
AddVolatileDataTree(GH_StructureT)|
(Inherited from GH_ParamT.)
|
AddVolatileDataTree(IGH_Structure)|
(Inherited from GH_ParamT.)
|
AppendAdditionalMenuItems|
Override this function if you want to add specific items to the object context
menu Default items already included in the menu toolstrip are: 1\. Name 2\.
Preview 3\. Warnings 4\. Errors  (Inherited from
GH_ParamT.)
|
AppendMenuItems|
This function is called when a context menu is about to be displayed. Override
it to set custom items. GH_ActiveObject will already populate the menu with
default items, if you merely wish to insert object-specific menu item,
consider overriding AppendAdditionalMenuItems instead.  (Inherited from
GH_ActiveObject.)
|
ClearData|  (Inherited from
GH_ParamT.)
|
ClearProxySources|
Remove all proxy sources without attempting to relink them.  (Inherited from
GH_ParamT.)
|
ClearRuntimeMessages|
Destroy all warning and error lists  (Inherited from
GH_ActiveObject.)
|
CollectData|  (Inherited
from GH_ParamT.)
|
ComputeData|  (Inherited
from GH_ParamT.)
|
CopyFrom|  Copy
all fields (except the instance ID) from another instance description.
(Inherited from
GH_InstanceDescription.)
|
CreateAttributes|
(Inherited from GH_ParamT.)
|
CreateProxySources|
Convert all proper source parameters into proxy sources.  (Inherited from
GH_ParamT.)
|
DependsOn|  (Inherited from
GH_ParamT.)
|
DocumentContextChanged|
This method will be called when the document that owns this object moves into
a different context.  (Inherited from
GH_DocumentObject.)
|
ExpirePreview|
Call this function when you suspect that the preview has expired for this
object. This will cause the display cache to be eradicated.  (Inherited from
GH_DocumentObject.)
|
ExpireSolution|
Informs the document that owns this object that the solution has expired. The
current object will be set to BLANK as a result. This method is recursive, it
will also expire any and all objects which depend on this object. If you want
a less destructive expiration, consider using ClearData(). If this object is
already Blank, you should consider not expiring it.  (Inherited from
GH_ActiveObject.)
|
ExpireSolutionTopLevel|
Invoke the Expiresolution(bool) method on the toplevel object.  (Inherited
from GH_ParamT.)
|
IsolateObject|
(Inherited from GH_ParamT.)
|
MovedBetweenDocuments|
This method will be called when an object is moved from one document to
another. Override this method if you want to handle such events.  (Inherited
from GH_DocumentObject.)
|
NewInstanceGuid|
Generate a new random instance GUID  (Inherited from
GH_InstanceDescription.)
|
NewInstanceGuid(Guid)|
Set the instance ID to be a specific GUID. This is very dangerous, only use
this function if you're 6"4' and your first name is David.  (Inherited from
GH_InstanceDescription.)
|
OnAttributesChanged|
Raises the AttributesChanged event on the toplevel object.  (Inherited from
GH_DocumentObject.)
|
OnDisplayExpired|
Raises the DisplayExpired event on the toplevel object.  (Inherited from
GH_DocumentObject.)
|
OnObjectChanged(GH_ObjectChangedEventArgs)|
(Inherited from
GH_DocumentObject.)
|
OnObjectChanged(GH_ObjectEventType)|
(Inherited from
GH_DocumentObject.)
|
OnObjectChanged(String)|
(Inherited from
GH_DocumentObject.)
| OnObjectChanged(GH_ObjectEventType,
Object)|
(Inherited from
GH_DocumentObject.)
| OnObjectChanged(String,
Object)|
(Inherited from
GH_DocumentObject.)
|
OnPingDocument|
Raise the PingDocument Event on the toplevel object and try to find the
document which owns this object.  (Inherited from
GH_DocumentObject.)
|
OnPreviewExpired|
Raises the PreviewExpired event on the toplevel object.  (Inherited from
GH_DocumentObject.)
|
OnSolutionExpired|
Raises the SolutionExpired event on the toplevel object. You probably want to
call ExpireSolution() instead of this method directly.  (Inherited from
GH_DocumentObject.)
|
Read|  (Inherited from
GH_ParamT.)
|
ReadFull|
GH_InstanceDescription does not by default serialize all fields. Use this
function to read _all_ fields from the archive. This method is compatible with
the default Write()/Read() operations.  (Inherited from
GH_InstanceDescription.)
|
RecordUndoEvent(GH_UndoRecord)|
Record an entire undo record.  (Inherited from
GH_DocumentObject.)
|
RecordUndoEvent(String)|
Record a generic object change undo event.  (Inherited from
GH_DocumentObject.)
| RecordUndoEvent(String,
IGH_UndoAction)|
Record a specific object change undo event.  (Inherited from
GH_DocumentObject.)
|
RegisterRemoteIDs|
Override this function if you want object changes in the Rhino document to
trigger a new solution.  (Inherited from
GH_ActiveObject.)
|
RelinkProxySources|
Attempt to replace all proxy sources with real sources. Proxy sources are used
during file IO, when actual sources might not be available yet. Once an IO
operation has been completed there should be no more proxy sources.
(Inherited from GH_ParamT.)
|
RemoveAllSources|
Remove all sources from this parameter.  (Inherited from
GH_ParamT.)
|
RemovedFromDocument|
This method will be called when an object is removed from a document. Override
this method if you want to handle such events.  (Inherited from
GH_DocumentObject.)
|
RemoveEffects|  Remove
all post-process effects. Note to implementors, you _must_ call the base
method if you override this function.  (Inherited from
GH_ParamT.)
|
RemoveSource(Guid)|
Remove the specified source from this parameter.  (Inherited from
GH_ParamT.)
|
RemoveSource(IGH_Param)|
Remove the specified source from this parameter.  (Inherited from
GH_ParamT.)
| ReplaceSource(Guid,
IGH_Param)|  Replace an
existing source with a new one. If the old_source does not exist in this
parameter, nothing happens.  (Inherited from
GH_ParamT.)
| ReplaceSource(IGH_Param,
IGH_Param)|  Replace an
existing source with a new one. If the old_source does not exist in this
parameter, nothing happens.  (Inherited from
GH_ParamT.)
|
RuntimeMessages|
Gets the list of cached runtime messages that were recorded during solver-time
processes.  (Inherited from
GH_ActiveObject.)
|
SDKCompliancy|  Test
whether this object is compliant with a given Rhino version.  (Inherited from
GH_ActiveObject.)
|
SetIconOverride|
Set a new custom icon override for this object.  (Inherited from
GH_DocumentObject.)
|
SetPrincipal|  Set the
principal parameter state.  (Inherited from
GH_ParamT.)
|
TriggerAutoSave|
Triggers the AutoSave function on the owner document with the object_changed
flag.  (Inherited from
GH_DocumentObject.)
|
TriggerAutoSave(GH_AutoSaveTrigger)|
Triggers the AutoSave function on the owner document with a custom flag.
(Inherited from
GH_DocumentObject.)
|
TriggerAutoSave(Guid)|
Triggers the AutoSave function on the owner document with the object_changed
flag.  (Inherited from
GH_DocumentObject.)
| TriggerAutoSave(GH_AutoSaveTrigger,
Guid)|
Triggers the AutoSave function on the owner document with a custom flag.
(Inherited from
GH_DocumentObject.)
|
Write|  (Inherited from
GH_ParamT.)
|
WriteFull|
GH_InstanceDescription does not by default serialize all fields. Use this
function to write _all_ fields to the archive. This method is compatible with
the default Write()/Read() operations.  (Inherited from
GH_InstanceDescription.)
Top

Events

| Name| Description
---|---|---
|
AttributesChanged|
Raised whenever the number or kind of attributes changes. This event is
handled by GH_Documents who subsequently wipe their attribute caches.
(Inherited from
GH_DocumentObject.)
|
DisplayExpired|
Raised whenever the display (on the Canvas) of a certain object becomes
invalid.  (Inherited from
GH_DocumentObject.)
|
ObjectChanged|
(Inherited from
GH_DocumentObject.)
|
PingDocument|
Raised whenever an object needs to know which GH_Document it belongs to.
(Inherited from
GH_DocumentObject.)
|
PreviewExpired|
Raised whenever the display (in the Rhino viewports) of a certain object
becomes invalid.  (Inherited from
GH_DocumentObject.)
|
SolutionExpired|
Raised whenever the solution of a certain object becomes invalid.  (Inherited
from GH_DocumentObject.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations.Params
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com