---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_CanvasWireValidator.htm
scraped_at: 2025-09-08T16:14:33.820753
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_CanvasWireValidator
Class](../html/T_Grasshopper_GUI_Canvas_GH_CanvasWireValidator.htm
"GH_CanvasWireValidator Class")

[GH_CanvasWireValidator Constructor
](../html/M_Grasshopper_GUI_Canvas_GH_CanvasWireValidator__ctor.htm
"GH_CanvasWireValidator Constructor ")

[GH_CanvasWireValidator
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_GH_CanvasWireValidator.htm
"GH_CanvasWireValidator Properties")

[GH_CanvasWireValidator
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_CanvasWireValidator.htm
"GH_CanvasWireValidator Methods")

!Click or drag to
resize

# GH_CanvasWireValidator Class

---

Utility validator for restricting wire creation.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_CanvasValidator
Grasshopper.GUI.CanvasGH_CanvasWireValidator

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_CanvasWireValidator : GH_CanvasValidator

    Public Class GH_CanvasWireValidator
    	Inherits GH_CanvasValidator

The GH_CanvasWireValidator type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_CanvasWireValidator|
Initializes a new instance of the GH_CanvasWireValidator class
Top

Properties

| Name| Description
---|---|---
|
Canvas|  Gets the
canvas this validator is associated with.  (Inherited from
GH_CanvasValidator.)
|
Document|  Gets
the document (if it exists) that is currently loaded in the canvas.
(Inherited from
GH_CanvasValidator.)
|
WireDelegate|
Gets or sets the delegate to be invoked when a wire is created.
|
WireMotionText|
Gets or sets the text to draw at the wire interior.
|
WireSource|
Gets or sets the wire source filter.
|
WireSourceText|
Gets or sets the text to draw at the wire source location.
|
WireTarget|
Gets or sets the wire target filter.
|
WireTargetText|
Gets or sets the text to draw at the wire target location.
Top

Methods

| Name| Description
---|---|---
|
AddedToCanvas|
(Overrides
GH_CanvasValidatorAddedToCanvas(GH_Canvas).)
|
AppliesToDocument|
(Overrides
GH_CanvasValidatorAppliesToDocument(Guid).)
|
CanAcceptObject|
(Overrides
GH_CanvasValidatorCanAcceptObject(Guid).)
|
CanCreateObject|
(Overrides GH_CanvasValidatorCanCreateObject(Guid,
PointF).)
|
CanCreateWire|
(Overrides GH_CanvasValidatorCanCreateWire(IGH_Param,
IGH_Param).)
|
CanDeleteObject|
(Overrides
GH_CanvasValidatorCanDeleteObject(IGH_DocumentObject).)
|
CanDeleteWire|
(Overrides GH_CanvasValidatorCanDeleteWire(IGH_Param,
IGH_Param).)
|
CanDragObject|
(Overrides GH_CanvasValidatorCanDragObject(IGH_DocumentObject,
PointF).)
|
CanNavigateCanvas|
(Inherited from
GH_CanvasValidator.)
|
CanShowCanvasMenu|
(Overrides
GH_CanvasValidatorCanShowCanvasMenu(PointF).)
|
CanShowComponentSearchBox|
(Overrides
GH_CanvasValidatorCanShowComponentSearchBox(PointF).)
|
CanShowObjectMenu|
(Inherited from
GH_CanvasValidator.)
|
RemovedFromCanvas|
(Overrides
GH_CanvasValidatorRemovedFromCanvas(GH_Canvas).)
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com