---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_ConnectivityDisparity.htm
scraped_at: 2025-09-08T16:15:54.154761
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_ConnectivityDisparity
Class](../html/T_Grasshopper_Kernel_GH_ConnectivityDisparity.htm
"GH_ConnectivityDisparity Class")

[GH_ConnectivityDisparity Constructor
](../html/M_Grasshopper_Kernel_GH_ConnectivityDisparity__ctor.htm
"GH_ConnectivityDisparity Constructor ")

[GH_ConnectivityDisparity
Properties](../html/Properties_T_Grasshopper_Kernel_GH_ConnectivityDisparity.htm
"GH_ConnectivityDisparity Properties")

[GH_ConnectivityDisparity
Methods](../html/Methods_T_Grasshopper_Kernel_GH_ConnectivityDisparity.htm
"GH_ConnectivityDisparity Methods")

!Click or drag to
resize

# GH_ConnectivityDisparity Class

---

Maintains two connectivity diagrams, one of which is a subset of the other.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_ConnectivityDisparity

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ConnectivityDisparity

    Public Class GH_ConnectivityDisparity

The GH_ConnectivityDisparity type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ConnectivityDisparity|
Create a new instance of the Connectivity Disparity utility class.
Top

Properties

| Name| Description
---|---|---
|
SubNodes|  Gets
a proxy for all the Nodes in the Subset diagram.
|
SubSet|  Gets a
pointer to the subset diagram stored in this disparity class.
|
TopNodes|  Gets
a proxy for all the Nodes in the Top Level diagram.
|
TopSet|  Gets a
pointer to the complete diagram stored in this disparity class.
Top

Methods

| Name| Description
---|---|---
|
ExternalInputs|
Find all external sources for a given id in the subset.
|
ExternalOutputs|
Find all external recipients for a given id in the subset.
|
InternalInputs|
Find all internal sources for a given id in the subset.
|
InternalOutputs|
Find all external recipients for a given id in the subset.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com