---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Theme_GH_WireSettings.htm
scraped_at: 2025-09-08T16:15:14.975378
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Theme](../html/N_Grasshopper_GUI_Theme.htm
"Grasshopper.GUI.Theme")

[GH_WireSettings Class](../html/T_Grasshopper_GUI_Theme_GH_WireSettings.htm
"GH_WireSettings Class")

[GH_WireSettings
Properties](../html/Properties_T_Grasshopper_GUI_Theme_GH_WireSettings.htm
"GH_WireSettings Properties")

!Click or drag to
resize

# GH_WireSettings Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.ThemeGH_WireSettings

**Namespace:** Grasshopper.GUI.Theme
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_WireSettings

    Public Class GH_WireSettings

The GH_WireSettings type exposes the following members.

Properties

| Name| Description
---|---|---
|
DefaultColour|
Gets or sets the colour to use for standard wires.
|
EmptyColour|  Gets
or sets the colour to use for empty wires.
|
SelectedColour0|
Gets or sets the colour of a wire at the selected extreme.
|
SelectedColour1|
Gets or sets the colour of a wire at the unselected extreme.
Top

See Also

#### Reference

Grasshopper.GUI.Theme Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com