---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_SubD_GH_SubDProxy.htm
scraped_at: 2025-09-08T16:21:32.605864
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_SubD.GH_SubDProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_SubD_GH_SubDProxy.htm
"GH_SubD.GH_SubDProxy Class")

[GH_SubD.GH_SubDProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_SubD_GH_SubDProxy__ctor.htm
"GH_SubD.GH_SubDProxy Constructor ")

[GH_SubDProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_SubD_GH_SubDProxy.htm
"GH_SubDProxy Properties")

[GH_SubDProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_SubD_GH_SubDProxy.htm
"GH_SubDProxy Methods")

!Click or drag to
resize

# GH_SubDGH_SubDProxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_SubD
Grasshopper.Kernel.TypesGH_SubDGH_SubDProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_SubDProxy : GH_GooProxy<GH_SubD>

    Public Class GH_SubDProxy
    	Inherits GH_GooProxy(Of GH_SubD)

The GH_SubDGH_SubDProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_SubDGH_SubDProxy|
Initializes a new instance of the GH_SubDGH_SubDProxy class
Top

Properties

| Name| Description
---|---|---
|
Area|
|
EdgeCount|
|
FaceCount|
|
ObjectID|
|
Solid|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
|
VertexCount|
|
Volume|
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com