---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_FieldElement.htm
scraped_at: 2025-09-08T16:20:38.365727
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_FieldElement Class](../html/T_Grasshopper_Kernel_Types_GH_FieldElement.htm
"GH_FieldElement Class")

[GH_FieldElement Constructor
](../html/M_Grasshopper_Kernel_Types_GH_FieldElement__ctor.htm
"GH_FieldElement Constructor ")

[GH_FieldElement
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_FieldElement.htm
"GH_FieldElement Properties")

[GH_FieldElement
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_FieldElement.htm
"GH_FieldElement Methods")

!Click or drag to
resize

# GH_FieldElement Class

---

Abstract implementation of IGH_FieldElement, derive from this class rather
than implementing IGH_FieldElement to save yourself time and effort.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_FieldElement
Grasshopper.Kernel.TypesGH_LineCharge
Grasshopper.Kernel.TypesGH_PointCharge
Grasshopper.Kernel.TypesGH_SpinForce
Grasshopper.Kernel.TypesGH_VectorForce

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_FieldElement : IGH_FieldElement

    Public MustInherit Class GH_FieldElement
    	Implements IGH_FieldElement

The GH_FieldElement type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_FieldElement|
Initializes a new instance of the GH_FieldElement class
Top

Properties

| Name| Description
---|---|---
|
BoundingBox|
|
ClippingBox|
|
ElementGuid|
|
IsLimited|
|
Limits|
Top

Methods

| Name| Description
---|---|---
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|
|
Force|
|
IsCoincident|
|
Read|
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com