---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Documentation_IGH_Content.htm
scraped_at: 2025-09-08T16:12:07.172566
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Documentation](../html/N_Grasshopper_Documentation.htm
"Grasshopper.Documentation")

[GH_Audience Enumeration](../html/T_Grasshopper_Documentation_GH_Audience.htm
"GH_Audience Enumeration")

[GH_ContentCollection
Class](../html/T_Grasshopper_Documentation_GH_ContentCollection.htm
"GH_ContentCollection Class")

[GH_Format Class](../html/T_Grasshopper_Documentation_GH_Format.htm "GH_Format
Class")

[GH_GlossaryItem
Class](../html/T_Grasshopper_Documentation_GH_GlossaryItem.htm
"GH_GlossaryItem Class")

[GH_Link Class](../html/T_Grasshopper_Documentation_GH_Link.htm "GH_Link
Class")

[GH_List Class](../html/T_Grasshopper_Documentation_GH_List.htm "GH_List
Class")

[GH_Paragraph Class](../html/T_Grasshopper_Documentation_GH_Paragraph.htm
"GH_Paragraph Class")

[GH_Parser Class](../html/T_Grasshopper_Documentation_GH_Parser.htm "GH_Parser
Class")

[GH_RuntimeFile Class](../html/T_Grasshopper_Documentation_GH_RuntimeFile.htm
"GH_RuntimeFile Class")

[GH_Style Enumeration](../html/T_Grasshopper_Documentation_GH_Style.htm
"GH_Style Enumeration")

[GH_Target Enumeration](../html/T_Grasshopper_Documentation_GH_Target.htm
"GH_Target Enumeration")

[GH_Text Class](../html/T_Grasshopper_Documentation_GH_Text.htm "GH_Text
Class")

[GH_Topic Class](../html/T_Grasshopper_Documentation_GH_Topic.htm "GH_Topic
Class")

[IGH_Content Interface](../html/T_Grasshopper_Documentation_IGH_Content.htm
"IGH_Content Interface")

!Click or drag to
resize

# IGH_Content Interface

---

All parts that make up documentation content must implement this interface.

**Namespace:** Grasshopper.Documentation
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_Content

    Public Interface IGH_Content

See Also

#### Reference

Grasshopper.Documentation Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com