---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_BakeAwareData.htm
scraped_at: 2025-09-08T16:18:15.758181
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_BakeAwareData
Interface](../html/T_Grasshopper_Kernel_IGH_BakeAwareData.htm
"IGH_BakeAwareData Interface")

[IGH_BakeAwareData
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_BakeAwareData.htm
"IGH_BakeAwareData Methods")

!Click or drag to
resize

# IGH_BakeAwareData Interface

---

Implement this interface in your IGH_Goo data type if you want to be included
in baking operations.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_BakeAwareData

    Public Interface IGH_BakeAwareData

The IGH_BakeAwareData type exposes the following members.

Methods

| Name| Description
---|---|---
|
BakeGeometry|  Bake
an object in the given Rhino document.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com