---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Documentation_GH_RuntimeFile.htm
scraped_at: 2025-09-08T16:12:02.157102
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Documentation](../html/N_Grasshopper_Documentation.htm
"Grasshopper.Documentation")

[GH_RuntimeFile Class](../html/T_Grasshopper_Documentation_GH_RuntimeFile.htm
"GH_RuntimeFile Class")

[GH_RuntimeFile
Properties](../html/Properties_T_Grasshopper_Documentation_GH_RuntimeFile.htm
"GH_RuntimeFile Properties")

[GH_RuntimeFile
Methods](../html/Methods_T_Grasshopper_Documentation_GH_RuntimeFile.htm
"GH_RuntimeFile Methods")

[GH_RuntimeFile
Fields](../html/Fields_T_Grasshopper_Documentation_GH_RuntimeFile.htm
"GH_RuntimeFile Fields")

!Click or drag to
resize

# GH_RuntimeFile Class

---

Runtime representation of a Grasshopper help file. A GH_RuntimeFile is nothing
more than a collection of keywords with associated content. This class does
not interpret a file or check its validity, it merely figures out the
different content section based on "Keyword:" entries.

Inheritance Hierarchy

SystemObject
Grasshopper.DocumentationGH_RuntimeFile

**Namespace:** Grasshopper.Documentation
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RuntimeFile

    Public Class GH_RuntimeFile

The GH_RuntimeFile type exposes the following members.

Properties

| Name| Description
---|---|---
|
Content|  Gets the
data associated with a certain key. For every time the key appears in the
file, an array of content strings will be returned.
|
Keys|  Gets a list of
all the keys present in the File.
|
Path|  Gets the path of
this help file.
!Static
member|
Tags|  Gets a
collection of all the pre-defined keywords. Use IsKeyword(string) if you want
to know whether a string equals a keyword. It's both faster and more reliable
than comparing against this collection.
Top

Methods

| Name| Description
---|---|---
|
ContainsKey|
Test whether a certain key is present in the File.
|
IsTag|  Tests whether
a string is a predefined Grasshopper Help keyword.
|
IsTagLine|  Tests
whether a line of text starts with a Grasshopper Help keyword.
|
ParseFile|  Parse
a file and return the runtime representation of said file.
Top

Fields

| Name| Description
---|---|---
|
TagAuthor|  String
tag used to identify Author fields in documentation source files.
|
TagAutoLink|
String tag used to signal whether automatic linking to a topic is allowed.
|
TagBeginner|
String tag used t o identify Beginner Level Help Content in documentation
source files.
|
TagCategory|
String tag used to identify Category fields in documentation source files.
|
TagComponent|
String tag used to identify Component IDs in documentation source files.
|
TagContact|
String tag used to identify Author contact details in documentation source
files.
|
TagDescription|
String tag used t o identify Description fields in glossary source files.
|
TagErranyms|
String tag used to identify Do Not Confuse collections in documentation source
files.
|
TagExpert|  String
tag used t o identify Expert Level Help Content in documentation source files.
|
TagInclude|
String tag used to signal whether inclusion of a topic is allowed.
|
TagIntermediate|
String tag used t o identify Intermediate Level Help Content in documentation
source files.
|
TagKeywords|
String tag used to identify Keyword collections in documentation source files.
|
TagPronunciation|
String tag used to identify Pronunciaion Guide fields (IPA) in glossary source
files.
|
TagRhinoCommand|
String tag used to identify Similar Rhino Commands in documentation source
files.
|
TagSeeAlso|
String tag used to identify See Also collections in documentation source
files.
|
TagSynonyms|
String tag used to identify Synonym collections in glossary source files.
|
TagTitle|  String
tag used to identify title fields in documentation source files.
Top

See Also

#### Reference

Grasshopper.Documentation Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com