---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_GeometricFont.htm
scraped_at: 2025-09-08T16:12:42.321063
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_GeometricFont Class](../html/T_Grasshopper_GUI_GH_GeometricFont.htm
"GH_GeometricFont Class")

[GH_GeometricFont
Properties](../html/Properties_T_Grasshopper_GUI_GH_GeometricFont.htm
"GH_GeometricFont Properties")

[GH_GeometricFont
Methods](../html/Methods_T_Grasshopper_GUI_GH_GeometricFont.htm
"GH_GeometricFont Methods")

!Click or drag to
resize

# GH_GeometricFont Class

---

Exposes methods for drawing geometric characters.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_GeometricFont

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_GeometricFont

    Public NotInheritable Class GH_GeometricFont

The GH_GeometricFont type exposes the following members.

Properties

| Name| Description
---|---|---
!Static
member|
Char0|  Gets the default
geometry for '0'. Caller is responsible for disposing the path.
!Static
member|
Char1|  Gets the default
geometry for '1'. Caller is responsible for disposing the path.
!Static
member|
Char2|  Gets the default
geometry for '2'. Caller is responsible for disposing the path.
!Static
member|
Char3|  Gets the default
geometry for '3'. Caller is responsible for disposing the path.
!Static
member|
Char4|  Gets the default
geometry for '4'. Caller is responsible for disposing the path.
!Static
member|
Char5|  Gets the default
geometry for '5'. Caller is responsible for disposing the path.
!Static
member|
Char6|  Gets the default
geometry for '6'. Caller is responsible for disposing the path.
!Static
member|
Char7|  Gets the default
geometry for '7'. Caller is responsible for disposing the path.
!Static
member|
Char8|  Gets the default
geometry for '8'. Caller is responsible for disposing the path.
!Static
member|
Char9|  Gets the default
geometry for '9'. Caller is responsible for disposing the path.
!Static
member|
CharBracketClose|
Gets the default geometry for '}'. Caller is responsible for disposing the
path.
!Static
member|
CharBracketOpen|
Gets the default geometry for '{'. Caller is responsible for disposing the
path.
!Static
member|
CharDash|  Gets the default
geometry for '-'. Caller is responsible for disposing the path.
!Static
member|
CharSemiColon|  Gets
the default geometry for ';'. Caller is responsible for disposing the path.
Top

Methods

| Name| Description
---|---|---
|
Draw0|  Draw the geometric
character '0' at the specified location.
|
Draw1|  Draw the geometric
character '1' at the specified location.
|
Draw2|  Draw the geometric
character '2' at the specified location.
|
Draw3|  Draw the geometric
character '3' at the specified location.
|
Draw4|  Draw the geometric
character '4' at the specified location.
|
Draw5|  Draw the geometric
character '5' at the specified location.
|
Draw6|  Draw the geometric
character '6' at the specified location.
|
Draw7|  Draw the geometric
character '7' at the specified location.
|
Draw8|  Draw the geometric
character '8' at the specified location.
|
Draw9|  Draw the geometric
character '9' at the specified location.
|
DrawBracketClose|
Draw the geometric character '}' at the specified location.
|
DrawBracketOpen|
Draw the geometric character '{' at the specified location.
|
DrawDash|  Draw the
geometric character '-' at the specified location.
|
DrawNumber(Graphics, Int32, Color,
PointF)|  Draw an integer
at the specified location.
|
DrawNumber(Graphics, Int64, Color,
PointF)|  Draw an
integer at the specified location.
|
DrawNumber(Graphics, UInt32, Color,
PointF)|  Draw an
integer at the specified location.
|
DrawNumber(Graphics, UInt64, Color,
PointF)|  Draw an
integer at the specified location.
|
DrawPath|  Draw an entire
path string at a specific location.
|
DrawSemiColon|  Draw
the geometric character ';' at the specified location.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com