---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_PointCloud.htm
scraped_at: 2025-09-08T16:21:19.572675
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_PointCloud Class](../html/T_Grasshopper_Kernel_Types_GH_PointCloud.htm
"GH_PointCloud Class")

[GH_PointCloud Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_PointCloud__ctor.htm
"GH_PointCloud Constructor ")

[GH_PointCloud
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_PointCloud.htm
"GH_PointCloud Properties")

[GH_PointCloud
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_PointCloud.htm
"GH_PointCloud Methods")

[GH_PointCloud
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_PointCloud.htm
"GH_PointCloud Fields")

!Click or drag to
resize

# GH_PointCloud Class

---

Represents a point cloud.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooPointCloud
Grasshopper.Kernel.TypesGH_GeometricGooPointCloud
Grasshopper.Kernel.TypesGH_PointCloud

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PointCloud : GH_GeometricGoo<PointCloud>,
    	IGH_BakeAwareData, IGH_PreviewData

    Public Class GH_PointCloud
    	Inherits GH_GeometricGoo(Of PointCloud)
    	Implements IGH_BakeAwareData, IGH_PreviewData

The GH_PointCloud type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PointCloud|  Default
constructor, creates an invalid curve.
|
GH_PointCloud(GH_PointCloud)|
Create a duplicate of another GH_PointCloud. This constructor also copies
reference data.
|
GH_PointCloud(Guid)|
Create a new referenced curve that references a Rhino curve object with the
specified ID.
|
GH_PointCloud(PointCloud)|
Create a duplicate of an existing point-cloud.
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
(Overrides
GH_GeometricGooTBoundingbox.)
|
ClippingBox|
|
IsGeometryLoaded|
Gets the load state of this curve object. The curve is considered to be loaded
when the local OnCurve instance is not null.  (Overrides
GH_GeometricGooTIsGeometryLoaded.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  Gets the
validity of this curve. If the curve is referenced but cannot be loaded, the
curve is not valid.  (Overrides
GH_GeometricGooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
ReferenceID|
(Overrides
GH_GeometricGooTReferenceID.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  (Overrides
GH_GeometricGooTValue.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
|
CastFrom|  Remote to
Local caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  Local
to Remote caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GeometricGooTCastToQ(Q).)
|
ClearCaches|
Clears all volatile caches for this instance. The boundingbox is cleared, and
if the curve is referenced, the local instance of the curve is erased.
(Overrides
GH_GeometricGooTClearCaches.)
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|
(Overrides
GH_GeometricGooTDuplicate.)
|
DuplicateGeometry|
Create a duplicate of this curve.  (Overrides
GH_GeometricGooTDuplicateGeometry.)
|
DuplicatePointCloud|
Create a duplicate of this curve.
|
EmitProxy|
(Overrides
GH_GeometricGooTEmitProxy.)
|
GetBoundingBox|
(Overrides
GH_GeometricGooTGetBoundingBox(Transform).)
|
LoadGeometry|  If
the geometry is referenced and not yet loaded, attempts to load the geometry.
(Overrides
GH_GeometricGooTLoadGeometry.)
|
LoadGeometry(RhinoDoc)|
If the curve is referenced and not yet loaded, attempts to load the curve.
(Overrides
GH_GeometricGooTLoadGeometry(RhinoDoc).)
|
Morph|  (Overrides
GH_GeometricGooTMorph(SpaceMorph).)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|  Format the
curve using default grasshopper formatting logic.  (Overrides
GH_GooTToString.)
|
Transform|
(Overrides
GH_GeometricGooTTransform(Transform).)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com