---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Render_ModelRenderSun.htm
scraped_at: 2025-09-08T16:24:43.437756
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Render](../html/N_Grasshopper_Rhinoceros_Render.htm
"Grasshopper.Rhinoceros.Render")

[ModelRenderSun
Class](../html/T_Grasshopper_Rhinoceros_Render_ModelRenderSun.htm
"ModelRenderSun Class")

[ModelRenderSun Constructor
](../html/M_Grasshopper_Rhinoceros_Render_ModelRenderSun__ctor.htm
"ModelRenderSun Constructor ")

[ModelRenderSun
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Render_ModelRenderSun.htm
"ModelRenderSun Properties")

[ModelRenderSun
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Render_ModelRenderSun.htm
"ModelRenderSun Methods")

[ModelRenderSun Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Render_ModelRenderSun.htm
"ModelRenderSun Type Conversions")

!Click or drag to
resize

# ModelRenderSun Class

---

Represents a Rhino sun. Wraps the functionality of the Sun type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.Rhinoceros.RenderModelRenderSun

**Namespace:**
Grasshopper.Rhinoceros.Render
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelRenderSun : ModelContent,
    	IGH_PreviewData

    Public NotInheritable Class ModelRenderSun
    	Inherits ModelContent
    	Implements IGH_PreviewData

The ModelRenderSun type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelRenderSun|
Initializes a new instance of the ModelRenderSun class
Top

Properties

| Name| Description
---|---|---
|
Altitude|
|
Azimuth|
|
DateTime|
|
DaylightSavingEnabled|
|
DaylightSavingMinutes|
|
Direction|
|
Enabled|
|
Id|  (Inherited from
ModelContent.)
|
Intensity|
|
IsValid|  (Inherited from
ModelContent.)
|
Latitude|
|
Longitude|
|
Manual|
|
Name|  (Inherited from
ModelContent.)
|
North|
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
|
TimeZone|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
CastToT(T)|
(Overrides
ModelContentCastToT(T).)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelRenderSunAttributes to
ModelRenderSun)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Render Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com