---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Box.htm
scraped_at: 2025-09-08T16:20:19.344364
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

GH_Box Class

[GH_Box Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Box__ctor.htm "GH_Box
Constructor ")

[GH_Box Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Box.htm
"GH_Box Properties")

[GH_Box Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Box.htm "GH_Box
Methods")

[GH_Box Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Box.htm "GH_Box
Fields")

!Click or drag to
resize

# GH_Box Class

---

Represents a 3D oriented Box volume.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooBox
Grasshopper.Kernel.TypesGH_GeometricGooBox
Grasshopper.Kernel.TypesGH_Box

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Box : GH_GeometricGoo<Box>,
    	IGH_BakeAwareData, IGH_PreviewData, IGH_RenderAwareData

    Public Class GH_Box
    	Inherits GH_GeometricGoo(Of Box)
    	Implements IGH_BakeAwareData, IGH_PreviewData, IGH_RenderAwareData

The GH_Box type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Box| Initializes a new
instance of the GH_Box class
|
GH_Box(BoundingBox)|
Initializes a new instance of the GH_Box class
|
GH_Box(Box)| Initializes a
new instance of the GH_Box class
|
GH_Box(GH_Box)| Initializes a
new instance of the GH_Box class
|
GH_Box(Guid)| Initializes a
new instance of the GH_Box class
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|  (Overrides
GH_GeometricGooTBoundingbox.)
|
ClippingBox|
|
IsGeometryLoaded|
(Overrides
GH_GeometricGooTIsGeometryLoaded.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  (Overrides
GH_GeometricGooTIsValid.)
|
IsValidWhyNot|  Gets a
string describing the state of "invalidness". If the instance _is_ valid, then
this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
ReferenceID|  (Overrides
GH_GeometricGooTReferenceID.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  (Overrides
GH_GeometricGooTValue.)
Top

Methods

| Name| Description
---|---|---
|
AppendRenderGeometry|
|
BakeGeometry|
|
Brep|  Differs from
Rhino.Geometry.Brep.FromBox() because it Handles degenerate cases.
|
CastFrom|  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToT(T)|  (Overrides
GH_GeometricGooTCastToQ(Q).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
ClearCaches|  (Overrides
GH_GeometricGooTClearCaches.)
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|  (Overrides
GH_GeometricGooTDuplicate.)
|
DuplicateBox|
|
DuplicateGeometry|
(Overrides
GH_GeometricGooTDuplicateGeometry.)
|
EmitProxy|  (Overrides
GH_GeometricGooTEmitProxy.)
|
Geometry|  Convert the box
to a GeometryBase instance.
|
GetBoundingBox|
(Overrides
GH_GeometricGooTGetBoundingBox(Transform).)
|
LoadGeometry|
If the geometry is referenced and currently unloaded, forces loading of the
geometry. Not all IGH_GeometricGoo implementations support referenced
geometry.  (Inherited from
GH_GeometricGooT.)
|
LoadGeometry(RhinoDoc)|
(Overrides
GH_GeometricGooTLoadGeometry(RhinoDoc).)
|
Mesh|
|
Morph|  (Overrides
GH_GeometricGooTMorph(SpaceMorph).)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Transform|  (Overrides
GH_GeometricGooTTransform(Transform).)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com