---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Drafting_ModelHatchPattern.htm
scraped_at: 2025-09-08T16:23:49.259349
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Drafting](../html/N_Grasshopper_Rhinoceros_Drafting.htm
"Grasshopper.Rhinoceros.Drafting")

[ModelHatchPattern
Class](../html/T_Grasshopper_Rhinoceros_Drafting_ModelHatchPattern.htm
"ModelHatchPattern Class")

[ModelHatchPattern Constructor
](../html/Overload_Grasshopper_Rhinoceros_Drafting_ModelHatchPattern__ctor.htm
"ModelHatchPattern Constructor ")

[ModelHatchPattern
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Drafting_ModelHatchPattern.htm
"ModelHatchPattern Properties")

[ModelHatchPattern
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Drafting_ModelHatchPattern.htm
"ModelHatchPattern Methods")

[ModelHatchPattern Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Drafting_ModelHatchPattern.htm
"ModelHatchPattern Type Conversions")

!Click or drag to
resize

# ModelHatchPattern Class

---

Represents a Rhino model hatch pattern. Wraps the functionality of the
HatchPattern type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.RhinocerosModelComponentContent
Grasshopper.Rhinoceros.DraftingModelHatchPattern

**Namespace:**
Grasshopper.Rhinoceros.Drafting
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelHatchPattern : ModelComponentContent,
    	IGH_BakeAwareData

    Public NotInheritable Class ModelHatchPattern
    	Inherits ModelComponentContent
    	Implements IGH_BakeAwareData

The ModelHatchPattern type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelHatchPattern|
Initializes a new instance of the ModelHatchPattern class
|
ModelHatchPattern(ModelHatchPatternAttributes)|
Initializes a new instance of the ModelHatchPattern class
|
ModelHatchPattern(Guid)|
Initializes a new instance of the ModelHatchPattern class
|
ModelHatchPattern(HatchPattern)|
Initializes a new instance of the ModelHatchPattern class
Top

Properties

| Name| Description
---|---|---
|
FillType|
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
Lines|
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
!Static
member|
Unset|
|
UserText|
(Inherited from
ModelComponentContent.)
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelHatchPatternAttributes to
ModelHatchPattern)|
!Static
member| (HatchPattern to
ModelHatchPattern)|
!Static
member| (String to
ModelHatchPattern)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Drafting
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com