---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_CharPatternParamNameConstructor.htm
scraped_at: 2025-09-08T16:15:39.071038
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_CharPatternParamNameConstructor
Class](../html/T_Grasshopper_Kernel_GH_CharPatternParamNameConstructor.htm
"GH_CharPatternParamNameConstructor Class")

[GH_CharPatternParamNameConstructor Constructor
](../html/Overload_Grasshopper_Kernel_GH_CharPatternParamNameConstructor__ctor.htm
"GH_CharPatternParamNameConstructor Constructor ")

!Click or drag to
resize

# GH_CharPatternParamNameConstructor Class

---

**Note: This API is now obsolete.**

 Inheritance Hierarchy

SystemObject
GH_StringPattern
Grasshopper.KernelGH_CharPatternParamNameConstructor

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    [ObsoleteAttribute("This class is obsolete, please use GH_StringPattern")]
    public class GH_CharPatternParamNameConstructor : GH_StringPattern

    <ObsoleteAttribute("This class is obsolete, please use GH_StringPattern")>
    Public Class GH_CharPatternParamNameConstructor
    	Inherits GH_StringPattern

Constructors

| Name| Description
---|---|---
|
GH_CharPatternParamNameConstructor|
Initializes a new instance of the GH_CharPatternParamNameConstructor class
|
GH_CharPatternParamNameConstructor(String)|
Initializes a new instance of the GH_CharPatternParamNameConstructor class
|
GH_CharPatternParamNameConstructor(String,
Int32)|
Initializes a new instance of the GH_CharPatternParamNameConstructor class
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com