---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_VerticalScrollBar.htm
scraped_at: 2025-09-08T16:13:17.474364
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_VerticalScrollBar
Class](../html/T_Grasshopper_GUI_GH_VerticalScrollBar.htm
"GH_VerticalScrollBar Class")

[GH_VerticalScrollBar Constructor
](../html/M_Grasshopper_GUI_GH_VerticalScrollBar__ctor.htm
"GH_VerticalScrollBar Constructor ")

[GH_VerticalScrollBar
Properties](../html/Properties_T_Grasshopper_GUI_GH_VerticalScrollBar.htm
"GH_VerticalScrollBar Properties")

[GH_VerticalScrollBar
Methods](../html/Methods_T_Grasshopper_GUI_GH_VerticalScrollBar.htm
"GH_VerticalScrollBar Methods")

[GH_VerticalScrollBar
Events](../html/Events_T_Grasshopper_GUI_GH_VerticalScrollBar.htm
"GH_VerticalScrollBar Events")

!Click or drag to
resize

# GH_VerticalScrollBar Class

---

Scroll bar control with floating point accuracy.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsPanel
Grasshopper.GUIGH_DoubleBufferedPanel
Grasshopper.GUIGH_VerticalScrollBar

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_VerticalScrollBar : GH_DoubleBufferedPanel

    Public Class GH_VerticalScrollBar
    	Inherits GH_DoubleBufferedPanel

The GH_VerticalScrollBar type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_VerticalScrollBar|
Initializes a new instance of the GH_VerticalScrollBar class
Top

Properties

| Name| Description
---|---|---
|
Grip|  Gets the actual
dimensions of the scroll bar grip.
|
GripRegion|  Gets the
grip region for this scroll bar. The Grip Region is the area in which the grip
can be found. It is essentially the Client area minus the padding.
|
ImpliedVerticalOffset|
Gets or sets the offset of the target region as implied by the scroll ratio.
If you set this value, the ratio is reverse engineered.
|
ScreenHeight|  Gets
or sets the height of the screen area (the visible area)
|
TargetHeight|  Gets
or sets the height of the target area (the area being scrolled)
|
TargetRatio|  Gets
or sets the scroll ration. If the scroll ratio is changed, the
OnScrollRatioChanged event will be raised.
Top

Methods

| Name| Description
---|---|---
|
OnPaint|  (Overrides
[ControlOnPaint(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.control.onpaint#system-
windows-forms-control-onpaint\(system-windows-forms-painteventargs\)).)
|
OnPaintBackground|
(Overrides
[ScrollableControlOnPaintBackground(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.scrollablecontrol.onpaintbackground#system-
windows-forms-scrollablecontrol-onpaintbackground\(system-windows-forms-
painteventargs\)).)
Top

Events

| Name| Description
---|---|---
|
ScrollRatioChanged|
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com