---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Vector.htm
scraped_at: 2025-09-08T16:21:40.700278
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Vector Class](../html/T_Grasshopper_Kernel_Types_GH_Vector.htm "GH_Vector
Class")

[GH_Vector Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Vector__ctor.htm "GH_Vector
Constructor ")

[GH_Vector
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Vector.htm
"GH_Vector Properties")

[GH_Vector Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Vector.htm
"GH_Vector Methods")

[GH_Vector Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Vector.htm
"GH_Vector Fields")

!Click or drag to
resize

# GH_Vector Class

---

Represents a 3D vector. GH_Vector re-implements the RhinoCommon Vector3d
struct.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooVector3d
Grasshopper.Kernel.TypesGH_Vector

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Vector : GH_Goo<Vector3d>

    Public Class GH_Vector
    	Inherits GH_Goo(Of Vector3d)

The GH_Vector type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Vector|  Default
constructor. Creates a zero-length vector.
|
GH_Vector(GH_Vector)|
Create a duplicate of another vector
|
GH_Vector(Vector3d)|
Create a vector from x, y and z components.
Top

Properties

| Name| Description
---|---|---
|
IsValid|  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Inherited from
GH_GooT.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  Remote to
Local caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  Local to
Remote caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GooTCastToQ(Q).)
|
Duplicate|  Create a
duplicate of this vector.  (Overrides
GH_GooTDuplicate.)
|
DuplicateVector|
Create a duplicate of this vector.
|
EmitProxy|  Returns a
proxy that represents this vector. Do not call this function unless you're
(Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  Format the
vector using default grasshopper formatting logic.  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com