---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_InstanceDescription.htm
scraped_at: 2025-09-08T16:18:33.840286
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_InstanceDescription
Interface](../html/T_Grasshopper_Kernel_IGH_InstanceDescription.htm
"IGH_InstanceDescription Interface")

[IGH_InstanceDescription
Properties](../html/Properties_T_Grasshopper_Kernel_IGH_InstanceDescription.htm
"IGH_InstanceDescription Properties")

[IGH_InstanceDescription
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_InstanceDescription.htm
"IGH_InstanceDescription Methods")

!Click or drag to
resize

# IGH_InstanceDescription Interface

---

Base interface for all objects that participate in the Grasshopper GUI.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_InstanceDescription : GH_ISerializable

    Public Interface IGH_InstanceDescription
    	Inherits GH_ISerializable

The IGH_InstanceDescription type exposes the following members.

Properties

| Name| Description
---|---|---
|
Category|  Gets
or sets the Category in which this object belongs. If HasCategory() returns
false, this field has no meaning.
|
Description|
Gets or sets the description of the object. This field typically remains fixed
during the lifetime of an object.
|
HasCategory|
Gets whether or not the Category field has been set.
|
HasSubCategory|
Gets whether or not the SubCategory field has been set.
|
InstanceDescription|
Gets a description of the current state of the object. This field is usually
the same as the Description() field, but it might be variable when overridden.
|
InstanceGuid|
Gets the ID of this runtime instance.
|
Keywords|  Gets a
list of additional keywords that describe the object. Typically this list is
empty but you can override this property to aid in object searches.
|
Name|  Gets or sets
the name of the object. This field typically remains fixed during the lifetime
of an object.
|
NickName|  Gets
or sets the nickname of the object. This field can be changed by the user.
|
SubCategory|
Gets or sets the SubCategory in which this object belongs. If HasSubCategory()
returns false, this field has no meaning.
Top

Methods

| Name| Description
---|---|---
|
NewInstanceGuid|
Generate a new random instance GUID
|
NewInstanceGuid(Guid)|
Set the instance ID to be a specific GUID. This is very dangerous, only use
this function if you're 6"4' and called David.
|
Read|  This method is called whenever the
instance is required to deserialize itself.  (Inherited from
GH_ISerializable.)
|
Write|  This method is called whenever
the instance is required to serialize itself.  (Inherited from
GH_ISerializable.)
Top

Remarks

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com