---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_CentralSettings.htm
scraped_at: 2025-09-08T16:11:06.975522
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper

[CentralSettings Class](../html/T_Grasshopper_CentralSettings.htm
"CentralSettings Class")

[CentralSettings
Properties](../html/Properties_T_Grasshopper_CentralSettings.htm
"CentralSettings Properties")

[CentralSettings Methods](../html/Methods_T_Grasshopper_CentralSettings.htm
"CentralSettings Methods")

[CentralSettings Events](../html/Events_T_Grasshopper_CentralSettings.htm
"CentralSettings Events")

!Click or drag to
resize

# CentralSettings Class

---

Represents a collection of program wide settings and events for when those
settings change. This should probably be the bottleneck for all program wide
settings, but stuff is still littered about for now.

Inheritance Hierarchy

SystemObject
GrasshopperCentralSettings

**Namespace:** Grasshopper
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class CentralSettings

    Public NotInheritable Class CentralSettings

The CentralSettings type exposes the following members.

Properties

| Name| Description
---|---|---
!Static
member|
AuthorAddress|  Gets or
sets the default author address to be used for all data generated by this
Grasshopper installation.
!Static
member|
AuthorCompany|  Gets or
sets the default author company to be used for all data generated by this
Grasshopper installation.
!Static
member|
AuthorCopyright|  Gets or
sets the default author copyright to be used for all data generated by this
Grasshopper installation.
!Static
member|
AuthorCopyrightFormatted|
Gets the authorCopyright message formatted to match the current date.
!Static
member|
AuthorDetails|  Gets a new
GH_AuthorDetails instance populated with the current settings. Changing this
instance _does not_ affect the settings.
!Static
member|
AuthorEMail|  Gets or sets
the default author e-mail to be used for all data generated by this
Grasshopper installation.
!Static
member|
AuthorName|  Gets or sets the
default author name to be used for all data generated by this Grasshopper
installation.
!Static
member|
AuthorPhone|  Gets or sets
the default author phone to be used for all data generated by this Grasshopper
installation.
!Static
member|
AuthorWebsite|  Gets or
sets the default author website to be used for all data generated by this
Grasshopper installation.
!Static
member|
CanvasFancyWires|  Gets
or sets whether or not fancy wires will be drawn. This is a global setting.
!Static
member|
CanvasFullNames|  Gets or
sets the global default for verbose UI. When CanvasFullNames=True, parameter
nicknames are set to their actual (long) names upon addition.
!Static
member|
CanvasMaxSearchResults|
Gets or sets the maximum number of search results for populating the Create
menu.
!Static
member|
CanvasObjectIcons|
Gets or sets the global default for icon display.
!Static
member|
CanvasObsoleteTags|
Gets or sets the global default for obsolete tags.
!Static
member|
CanvasRadialMenu|  Gets
or sets the global default for whether the canvas should use Radial or olds-
kool menus.
!Static
member|
CanvasSpaceIsRadialMenu|
Gets or sets whether the space bar triggers the radial menu (pre Rhino 6.3
behaviour) or the Create menu (post Rhino 6.3 behaviour).
!Static
member|
CanvasSpaceSearchRadialMessage|
Gets or sets the number of times the space-is-now-search-and-not-radial
message has been shown.
!Static
member|
CanvasToolbar|  Gets or
sets whether or not the canvas toolbar will be visible. This is a global
setting.
!Static
member|
CanvasZuiZoomLevel|
Gets or sets the global Zui zoom threshold.
!Static
member|
CapsuleHighlight|  Gets
or sets the global setting for drawing highlight bars on capsules.
!Static
member|
CapsuleShine|  Gets or sets
the global setting for drawing shiny edges on capsules.
!Static
member|
ComponentCascadeMenus|
Gets or sets whether Grasshopper document solutions are wrapped in undo
records.
!Static
member|
CreateSolutionUndoRecord|
Gets or sets whether Grasshopper document solutions are wrapped in undo
records.
!Static
member|
FormatDecimalDigits|
Gets or sets how many digits ought to be used for decimal formatted numbers.
!Static
member|
FormatENotationDigits|
Gets or sets how many digits ought to be used for scientific notation
formatted numbers.
!Static
member|
FormatENotationLowerLimit|
Gets or sets at what power of ten decimal formatting of numbers switches to E
notation for small numbers.
!Static
member|
FormatENotationLowerThreshold|
Gets at what actual threshold numeric formatting switches from decimal to
E-Notation.
!Static
member|
FormatENotationUpperLimit|
Gets or sets at what power of ten decimal formatting of numbers switches to E
notation for large numbers.
!Static
member|
FormatENotationUpperThreshold|
Gets at what actual threshold numeric formatting switches from decimal to
E-Notation.
!Static
member|
FormatMultiplesOfOne|
Gets or sets whether floating point numbers close to whole integers should be
special cased.
!Static
member|
FormatMultiplesOfPi|
Gets or sets whether multiples of 0.5*Pi ought to be special cased.
!Static
member|
InvalidBakeAllow|  Gets
or sets the default choice for baking invalid objects.
!Static
member|
InvalidBakeAsk|  Gets or
sets whether a warning ought to be displayed prior to baking invalid geometry.
By default this is always TRUE when Grasshopper starts.
!Static
member|
IsTemplateFile|  Gets
whether a template file has been defined and whether that file ectually
exists.
!Static
member|
PanelDefaultFontFamily|
Gets or sets the font family name of the default font for panels.
!Static
member|
PanelDefaultFontSize|
Gets or sets the font family name of the default font for panels.
!Static
member|
PreviewBumpZBuffer|
Gets or sets whether the Document preview bumps the Z-Buffer. Setting this
value automatically causes a redraw of the Rhino viewports.
!Static
member|
PreviewGumballs|  Gets or
sets whether the gumballs will be visible for selected preview geometry.
!Static
member|
PreviewMeshEdges|  Gets
or sets the Mesh Wire display flag.
!Static
member|
PreviewPlaneRadius|
Gets or sets the global Plane radius.
!Static
member|
PreviewPointRadius|
Gets the default radius of the point objects given the current style.
!Static
member|
PreviewPointStyle|
Gets or sets the point style for Grasshopper preview points.
!Static
member|
PreviewSelectionThickening|
Gets or sets the amount of thickening to apply to selected wires.
!Static
member|
PruderyLevel|  Gets or sets
the Grasshopper UI prudery level.
!Static
member|
RibbonDrawTabIcons|
Gets or sets whether tab icons are drawn for the ribbon.
!Static
member|
RibbonSeparators|  Gets
or sets whether there are separators between different exposures on the
component Ribbon.
!Static
member|
RibbonShowObscure|
Gets or sets a value indicating whether components marked with DropDown
exposure are drawn on the main toolbar anyway.
!Static
member|
RibbonVisible|  Gets or
sets a value indicating whether components marked with DropDown exposure are
drawn on the main toolbar anyway.
!Static
member|
ShowTutorials|  Gets or
sets whether the tutorial browser is shown on Grasshopper load.
!Static
member|
TemplateFile|  Gets or sets
the template file path. Use String.Empty or Nothing to disable the template
file.
!Static
member|
TooltipVisible|  Gets or
sets whether the tooltip is shown.
!Static
member|
TooltipWiggleRadius|
Gets or sets the wiggle radius (in pixels) which the mouse is allowed to move
before the tooltip is nuked.
!Static
member|
TrackFileStamps|
!Static
member|
TrackPluginLoading|
Gets or sets whether plugins are tracked during loading in order to detect
plugins causing fatal crashes during load.
!Static
member|
TryDownloadMissingPlugins|
Gets or sets whether the 'Unrecognized Objects' dialog pops up on file load.
Top

Methods

| Name| Description
---|---|---
|
GetLoadMechanism|  Gets
what load mechanism has been specified for a certain plugin.
|
IsLoadProtected|  Gets
whether a certain plugin is load protected.
|
SetLoadMechanism|  Sets
the user defined load mechanism for a certain plugin.
|
SetLoadProtected|  Sets
whether a certain plugin is load protected.
|
UserOkayWithBakingInvalidObject|
Show the warning for baking invalid objects, or return the default choice if
the warning is disabled.
Top

Events

| Name| Description
---|---|---
|
AuthorAddressChanged|
Raised whenever the AuthorAddress field is changed.
|
AuthorCompanyChanged|
Raised whenever the AuthorCompany field is changed.
|
AuthorCopyrightChanged|
Raised whenever the AuthorCopyright field is changed.
|
AuthorEMailChanged|
Raised whenever the AuthorEMail field is changed.
|
AuthorNameChanged|
Raised whenever the AuthorName field is changed.
|
AuthorPhoneChanged|
Raised whenever the AuthorPhone field is changed.
|
AuthorWebsiteChanged|
Raised whenever the AuthorWebsite field is changed.
|
CanvasFancyWiresChanged|
Raised whenever the CanvasFancyWires setting changes.
|
CanvasFullNamesChanged|
Raised whenever the CanvasFullNames setting changes.
|
CanvasObjectIconsChanged|
Raised whenever the CanvasObjectIcons setting changes.
|
CanvasObsoleteTagsChanged|
Raised whenever the CanvasObsoleteTags setting changes.
|
CanvasRadialMenuChanged|
Raised whenever the CanvasRadialMenu setting changes.
|
CanvasToolbarChanged|
Raised whenever the CanvasToolbar setting changes.
|
CanvasZuiZoomLevelChanged|
Raised whenever the CanvasZuiZoomLevel setting changes.
|
ComponentCascadeMenusChanged|
Raised whenever the ComponentCascadeMenus setting changes.
|
CreateSolutionUndoRecordChanged|
Raised whenever the CreateSolutionUndoRecord setting changes.
|
FormattingChanged|
Raised whenever a formatting setting is changed.
|
LoadMechanismChanged|
Raised whenever the load mechanism of a certain plugin changes.
|
LoadProtectionChanged|
Raised whenever the load protection of a certain plugin changes.
|
PanelDefaultFontChanged|
Raised whenever the PanelDefaultFontFamily or PanelDefaultFontSize settings
change.
|
PreviewBumpZBufferChanged|
Raised whenever the PreviewBumpZBuffer setting changes.
|
PreviewGumballsChanged|
Raised whenever the PreviewGumballs setting changes.
|
PreviewMeshEdgesChanged|
Raised whenever the PreviewMeshEdges setting changes.
|
PreviewPlaneRadiusChanged|
Raised whenever the PreviewPlaneRadius setting changes.
|
PreviewPointStyleChanged|
Raised whenever the PreviewPointStyle setting changes.
|
PruderyLevelChanged|
Raised whenever the PruderyLevel setting changes.
|
RibbonAllIconsChanged|
Raised whenever the RibbonAllIcons setting changes.
|
RibbonDrawTabIconsChanged|
Raised whenever the RibbonDrawTabIcons setting changes.
|
RibbonSeparatorsChanged|
Raised whenever the RibbonSeparators setting changes.
|
RibbonVisibleChanged|
Raised whenever the RibbonVisible setting changes.
|
TemplateFileChanged|
Raised whenever the TemplateFile property is changed.
|
TooltipWiggleRadiusChanged|
Raised whenever the TooltipWiggleRadius setting changes.
|
UiScaleChanged|  Raised
whenever the UiScale setting changes.
Top

See Also

#### Reference

Grasshopper Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com