---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_LineParser.htm
scraped_at: 2025-09-08T16:17:01.440834
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_LineParser Class](../html/T_Grasshopper_Kernel_GH_LineParser.htm
"GH_LineParser Class")

[GH_LineParser Constructor
](../html/M_Grasshopper_Kernel_GH_LineParser__ctor.htm "GH_LineParser
Constructor ")

[GH_LineParser Methods](../html/Methods_T_Grasshopper_Kernel_GH_LineParser.htm
"GH_LineParser Methods")

!Click or drag to
resize

# GH_LineParser Class

---

Provides basic functionality for the custom ReadFile component script parsing.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_LineParser

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_LineParser

    Public MustInherit Class GH_LineParser

The GH_LineParser type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_LineParser| Initializes a
new instance of the GH_LineParser class
Top

Methods

| Name| Description
---|---|---
|
ParseLine|  Parse a line
of text and convert it to custom data.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com