---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Undo_Actions_GH_GenericObjectAction.htm
scraped_at: 2025-09-08T16:22:12.786664
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Undo.Actions](../html/N_Grasshopper_Kernel_Undo_Actions.htm
"Grasshopper.Kernel.Undo.Actions")

[GH_GenericObjectAction
Class](../html/T_Grasshopper_Kernel_Undo_Actions_GH_GenericObjectAction.htm
"GH_GenericObjectAction Class")

[GH_GenericObjectAction Constructor
](../html/M_Grasshopper_Kernel_Undo_Actions_GH_GenericObjectAction__ctor.htm
"GH_GenericObjectAction Constructor ")

[GH_GenericObjectAction
Properties](../html/Properties_T_Grasshopper_Kernel_Undo_Actions_GH_GenericObjectAction.htm
"GH_GenericObjectAction Properties")

[GH_GenericObjectAction
Methods](../html/Methods_T_Grasshopper_Kernel_Undo_Actions_GH_GenericObjectAction.htm
"GH_GenericObjectAction Methods")

[GH_GenericObjectAction
Fields](../html/Fields_T_Grasshopper_Kernel_Undo_Actions_GH_GenericObjectAction.htm
"GH_GenericObjectAction Fields")

!Click or drag to
resize

# GH_GenericObjectAction Class

---

Records a single object change. Object changes are undone/redone by
(de)serializing the objects. Object changes also keep track of all wires
feeding into and coming out of the object.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.UndoGH_UndoAction
Grasshopper.Kernel.UndoGH_ArchivedUndoAction
Grasshopper.Kernel.Undo.ActionsGH_GenericObjectAction

**Namespace:**
Grasshopper.Kernel.Undo.Actions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_GenericObjectAction : GH_ArchivedUndoAction

    Public Class GH_GenericObjectAction
    	Inherits GH_ArchivedUndoAction

The GH_GenericObjectAction type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_GenericObjectAction|
Initializes a new instance of the GH_GenericObjectAction class
Top

Properties

| Name| Description
---|---|---
|
ExpiresDisplay|
Override this property if you want the Rhino viewport display to refresh upon
undo completion.  (Inherited from
GH_UndoAction.)
|
ExpiresSolution|
(Overrides
GH_UndoActionExpiresSolution.)
|
State|  (Inherited from
GH_UndoAction.)
Top

Methods

| Name| Description
---|---|---
|
Deserialize|
Deserializes the obj from the local archive.  (Inherited from
GH_ArchivedUndoAction.)
|
Internal_Redo|
(Overrides
GH_UndoActionInternal_Redo(GH_Document).)
|
Internal_Undo|
(Overrides
GH_UndoActionInternal_Undo(GH_Document).)
|
Read|  (Inherited
from
GH_ArchivedUndoAction.)
|
Redo|  (Inherited from
GH_UndoAction.)
|
Serialize|
Serializes the obj into the local archive.  (Inherited from
GH_ArchivedUndoAction.)
|
SerializeToByteArray|
Serializes the obj into the local archive.  (Inherited from
GH_ArchivedUndoAction.)
|
Undo|  (Inherited from
GH_UndoAction.)
|
Write|
(Inherited from
GH_ArchivedUndoAction.)
Top

Fields

| Name| Description
---|---|---
|
m_data|
Internal data storage for serialized archives.  (Inherited from
GH_ArchivedUndoAction.)
Top

See Also

#### Reference

Grasshopper.Kernel.Undo.Actions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com