---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_ComponentParamServer.htm
scraped_at: 2025-09-08T16:15:45.113030
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_ComponentParamServer
Class](../html/T_Grasshopper_Kernel_GH_ComponentParamServer.htm
"GH_ComponentParamServer Class")

[GH_ComponentParamServer
Properties](../html/Properties_T_Grasshopper_Kernel_GH_ComponentParamServer.htm
"GH_ComponentParamServer Properties")

[GH_ComponentParamServer
Methods](../html/Methods_T_Grasshopper_Kernel_GH_ComponentParamServer.htm
"GH_ComponentParamServer Methods")

[GH_ComponentParamServer
Events](../html/Events_T_Grasshopper_Kernel_GH_ComponentParamServer.htm
"GH_ComponentParamServer Events")

!Click or drag to
resize

# GH_ComponentParamServer Class

---

Wraps all members and functions needed for GH_Component to manage its input
and output parameters.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_ComponentParamServer

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ComponentParamServer : GH_ISerializable,
    	IEnumerable<IGH_Param>

    Public Class GH_ComponentParamServer
    	Implements GH_ISerializable, IEnumerable(Of IGH_Param)

The GH_ComponentParamServer type exposes the following members.

Properties

| Name| Description
---|---|---
|
Input|  Gets or sets
the input list of parameters. Do not insert or remove parameters from this
list, use the dedicated functions instead.
|
InputWidth|
Gets the width of the largest input parameter.
|
OnlyTreeAndListParameters|
Returns True if every input parameter is either a list or a tree parameter.
|
OnlyTreeParameters|
Returns True if every input parameter is a tree parameter.
|
Output|  Gets or
sets the output list of parameters. Do not insert or remove parameters from
this list, use the dedicated functions instead.
|
OutputWidth|
Gets the width of the largest output parameter.
|
Owner|  Gets the
owner component of this instance
Top

Methods

| Name| Description
---|---|---
|
AccessCount|
Returns the total number of input parameters that match the access mask.
|
Clear|  Removes all
input and output parameters.
|
Clear(Boolean)|
Removes all input and output parameters.
|
CreateDuplicate|
Attempts to duplicate a parameter. Attributes will be ignored. Warning! The
duplicate will have the same ID as the original!
|
EmitSyncObject|
Create a synch object that stores a shallow representation of this server.
Cache this object if you're planning to make sweeping changes to this param-
server. Then, once you are finished call the Sync() function to perform
cleanup of removed parameters. This is a utility function and you can choose
to perform cleanup yourself.
|
Find|  Find the
parameter that has the given InstanceGuid.
|
GetEnumerator|
Gets a customized enumerator which iterates over all (both input and output)
parameters.
|
GetHashCode|
(Overrides
[ObjectGetHashCode](https://docs.microsoft.com/dotnet/api/system.object.gethashcode#system-
object-gethashcode).)
|
GetHashCode(GH_ParamHashFields)|
Creates a SHA1 hash from the parameter data.
|
IndexOfInputParam(Guid)|
Finds the index of the input parameter that matches the specified search mask.
|
IndexOfInputParam(String)|
Finds the index of the input parameter that matches the specified search mask.
|
IndexOfOutputParam(Guid)|
Finds the index of the output parameter that matches the specified search
mask.
|
IndexOfOutputParam(String)|
Finds the index of the output parameter that matches the specified search
mask.
|
InventUniqueNickname(String,
IEnumerableIGH_Param)|
Create a new, unique parameter nickname.
|
InventUniqueNickname(String,
IEnumerableString)|
Create a new, unique parameter nickname.
|
IsInputParam|
Returns True if this parameter is an input child of the component
|
IsOutputParam|
Returns True if this parameter is an output child of the component
|
IsParam|  Returns
True if this parameter is a child of the component
|
OnParametersChanged|
Call this function when you change input/output parameter lists or types. This
function will wipe all caches that are potentially invalid. PerformLayout on
the component attributes will be called.
|
Read|  Read all
parameter data from an IO archive.
|
RegisterInputParam(IGH_Param)|
Add a parameter to the end of the input list.
| RegisterInputParam(IGH_Param,
Int32)|
Add a parameter at the specific index of the input list.
|
RegisterOutputParam(IGH_Param)|
Add a parameter to the end of the output list.
| RegisterOutputParam(IGH_Param,
Int32)|
Add a parameter at the specific index of the output list.
|
RepairParamAssociations|
Makes sure all parameter attributes are a-ok. If you stick to regular
functions, you shouldn't have to call this.
|
RepairProxyParams|
Attempt to fix all proxy params. Returns false if a single one fails.
|
SortInput(Double)|
Sort the input parameter order based on a numeric key array.
|
SortInput(Int32)|
Sort the input parameter order based on a numeric key array.
|
SortInput(Single)|
Sort the input parameter order based on a numeric key array.
|
SortOutput(Double)|
Sort the input parameter order based on a numeric key array.
|
SortOutput(Int32)|
Sort the output parameter order based on a numeric key array.
|
SortOutput(Single)|
Sort the output parameter order based on a numeric key array.
|
Sync(GH_ComponentParamServerIGH_SyncObject)|
Sync changes from a prerecorded state. All param references in the sync object
which are no longer present in the current server will be properly deleted.
The sync object will be reset in the process, so you can only call this
function with a specific Sync object once.
|
Sync(Object)|  Sync
changes from a prerecorded state. All param references in the sync object
which are no longer present in the current server will be properly deleted.
The sync object will be reset in the process, so you can only call this
function with a specific Sync object once.
|
Sync(GH_ComponentParamServerIGH_SyncObject,
Int32)|  Sync
changes from a prerecorded state. All param references in the sync object
which are no longer present in the current server will be properly deleted.
The sync object will be reset in the process, so you can only call this
function with a specific Sync object once.
|
UnregisterInputParameter(IGH_Param)|
Removes the specified parameter from this component.
| UnregisterInputParameter(IGH_Param,
Boolean)|
Removes the specified parameter from this component.
|
UnregisterOutputParameter(IGH_Param)|
Removes the specified parameter from this component.
|
UnregisterOutputParameter(IGH_Param,
Boolean)|
Removes the specified parameter from this component.
|
UnregisterParameter(IGH_Param)|
Removes the specified parameter from this component.
| UnregisterParameter(IGH_Param,
Boolean)|
Removes the specified parameter from this component.
|
Write|  Write all
parameter data to an IO archive.
|
WriteParamHashData|
Write parameter data to a binary writer.
Top

Events

| Name| Description
---|---|---
|
ParameterChanged|
Raised whenever there is a change to any parameter. If you only care about
NickName or Source changes, handle the ParameterNickNameChanged or
ParameterSourcesChanged events instead.
|
ParameterNickNameChanged|
Raised whenever a parameter nickname change is accepted.
|
ParameterSourcesChanged|
Raised whenever the source list of an input parameter is changed.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com