---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Hatch_GH_HatchProxy.htm
scraped_at: 2025-09-08T16:20:47.464304
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Hatch.GH_HatchProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Hatch_GH_HatchProxy.htm
"GH_Hatch.GH_HatchProxy Class")

[GH_Hatch.GH_HatchProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Hatch_GH_HatchProxy__ctor.htm
"GH_Hatch.GH_HatchProxy Constructor ")

[GH_HatchProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Hatch_GH_HatchProxy.htm
"GH_HatchProxy Properties")

[GH_HatchProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Hatch_GH_HatchProxy.htm
"GH_HatchProxy Methods")

!Click or drag to
resize

# GH_HatchGH_HatchProxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Hatch
Grasshopper.Kernel.TypesGH_HatchGH_HatchProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_HatchProxy : GH_GooProxy<GH_Hatch>

    Public Class GH_HatchProxy
    	Inherits GH_GooProxy(Of GH_Hatch)

The GH_HatchGH_HatchProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_HatchGH_HatchProxy|
Initializes a new instance of the GH_HatchGH_HatchProxy class
Top

Properties

| Name| Description
---|---|---
|
BasePoint|
|
ObjectID|
|
Pattern|
|
PatternRotation|
|
PatternScale|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com