---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_YakDownloadFormEto.htm
scraped_at: 2025-09-08T16:13:23.493658
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_YakDownloadFormEto
Class](../html/T_Grasshopper_GUI_GH_YakDownloadFormEto.htm
"GH_YakDownloadFormEto Class")

[GH_YakDownloadFormEto Constructor
](../html/M_Grasshopper_GUI_GH_YakDownloadFormEto__ctor.htm
"GH_YakDownloadFormEto Constructor ")

!Click or drag to
resize

# GH_YakDownloadFormEto Class

---

Inheritance Hierarchy

Dialog
Grasshopper.GUIGH_YakDownloadFormEto

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_YakDownloadFormEto : Dialog

    Public NotInheritable Class GH_YakDownloadFormEto
    	Inherits Dialog

The GH_YakDownloadFormEto type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_YakDownloadFormEto|
Initializes a new instance of the GH_YakDownloadFormEto class
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com