---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Interval2D_GH_Interval2DProxy.htm
scraped_at: 2025-09-08T16:20:53.453733
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Interval2D.GH_Interval2DProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Interval2D_GH_Interval2DProxy.htm
"GH_Interval2D.GH_Interval2DProxy Class")

[GH_Interval2D.GH_Interval2DProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Interval2D_GH_Interval2DProxy__ctor.htm
"GH_Interval2D.GH_Interval2DProxy Constructor ")

[GH_Interval2DProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Interval2D_GH_Interval2DProxy.htm
"GH_Interval2DProxy Properties")

[GH_Interval2DProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Interval2D_GH_Interval2DProxy.htm
"GH_Interval2DProxy Methods")

!Click or drag to
resize

# GH_Interval2DGH_Interval2DProxy Class

---

Proxy description of GH_Interval class. This class is used by the Generic
Multivalue interfaces.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Interval2D
Grasshopper.Kernel.TypesGH_Interval2DGH_Interval2DProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Interval2DProxy : GH_GooProxy<GH_Interval2D>

    Public Class GH_Interval2DProxy
    	Inherits GH_GooProxy(Of GH_Interval2D)

The GH_Interval2DGH_Interval2DProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Interval2DGH_Interval2DProxy|
Initializes a new instance of the GH_Interval2DGH_Interval2DProxy class
Top

Properties

| Name| Description
---|---|---
|
Area|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
U0|
|
U1|
|
UIsIncreasing|
|
UIsNormalized|
|
ULength|
|
UMiddle|
|
V0|
|
V1|
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
|
VIsIncreasing|
|
VIsNormalized|
|
VLength|
|
VMiddle|
Top

Methods

| Name| Description
---|---|---
|
Construct|  Override
this method to supply a custom UI during proxy construction.  (Inherited from
GH_GooProxyT.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com