---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_Param_1.htm
scraped_at: 2025-09-08T16:17:15.573802
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_Param(T) Class](../html/T_Grasshopper_Kernel_GH_Param_1.htm "GH_Param\(T\)
Class")

[GH_Param(T) Constructor
](../html/Overload_Grasshopper_Kernel_GH_Param_1__ctor.htm "GH_Param\(T\)
Constructor ")

[GH_Param(T)
Properties](../html/Properties_T_Grasshopper_Kernel_GH_Param_1.htm
"GH_Param\(T\) Properties")

[GH_Param(T) Methods](../html/Methods_T_Grasshopper_Kernel_GH_Param_1.htm
"GH_Param\(T\) Methods")

[GH_Param(T) Events](../html/Events_T_Grasshopper_Kernel_GH_Param_1.htm
"GH_Param\(T\) Events")

[GH_Param(T) Fields](../html/Fields_T_Grasshopper_Kernel_GH_Param_1.htm
"GH_Param\(T\) Fields")

!Click or drag to
resize

# GH_ParamT Class

---

Base implementation of IGH_Param. Derive from this class rather than
implementing IGH_Param from scratch. If your parameter can store persistent
data, derive from GH_PersistentParam(Of T) instead.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_InstanceDescription
Grasshopper.KernelGH_DocumentObject
Grasshopper.KernelGH_ActiveObject
Grasshopper.KernelGH_ParamT
Grasshopper.KernelGH_PersistentParamT
Grasshopper.Kernel.ParametersParam_Predicate
Grasshopper.Rhinoceros.ParamsModelDataParamT

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_Param<T> : GH_ActiveObject,
    	IGH_Param
    where T : class, IGH_Goo

    Public MustInherit Class GH_Param(Of T As {Class, IGH_Goo})
    	Inherits GH_ActiveObject
    	Implements IGH_Param

#### Type Parameters

T

    Data type for this parameter.

The GH_ParamT type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ParamT(IGH_InstanceDescription)|
Initializes a new instance of the GH_ParamT class
|
GH_ParamT(IGH_InstanceDescription,
GH_ParamAccess)| Initializes a
new instance of the GH_ParamT class
| GH_ParamT(String, String,
String, String, String,
GH_ParamAccess)| Initializes a
new instance of the GH_ParamT class
Top

Properties

| Name| Description
---|---|---
|
Access|  Gets or sets the Access
level for this parameter.
|
Attributes|  Gets or
sets the attributes that are associated with this object. Only set custom
attributes if you know what you are doing.  (Inherited from
GH_DocumentObject.)
|
Category|  Gets or
sets the Category in which this object belongs. If HasCategory() returns
false, this field has no meaning.  (Inherited from
GH_InstanceDescription.)
|
ComponentGuid|
Returns a consistent ID for this object type. Every object must supply a
unique and unchanging ID that is used to identify objects of the same type.
(Inherited from
GH_DocumentObject.)
|
DataMapping|  Gets or sets
the data mapping of this Parameter.
|
DataType|  Type is either Void
if there are no sources or Remote. Derived classes should expand on this.
|
Description|
Gets or sets the description of the object. This field typically remains fixed
during the lifetime of an object.  (Inherited from
GH_InstanceDescription.)
|
Exposure|  Gets the
exposure of this object in the Graphical User Interface. The default is to
expose everywhere.  (Inherited from
GH_DocumentObject.)
|
HasCategory|
Gets whether or not the Category field has been set.  (Inherited from
GH_InstanceDescription.)
|
HasProxySources|  Gets
a value indicating whether or not this parameter maintains proxy sources.
Proxy sources are used during file IO, when actual sources might not be
available yet. Once an IO operation has been completed there should be no more
proxy sources.
|
HasSubCategory|
Gets whether or not the SubCategory field has been set.  (Inherited from
GH_InstanceDescription.)
|
Icon|  Override this
function to supply a custom icon (24x24 pixels). The result of this property
is cached, so don't worry if icon retrieval is not very fast.  (Inherited from
GH_DocumentObject.)
|
Icon_24x24|  The icon
associated with this object.  (Inherited from
GH_DocumentObject.)
|
Icon_24x24_Locked|
The greyscale icon of this object.  (Inherited from
GH_DocumentObject.)
|
IconCapableUI|  By
default the NickName menu item supports the Icon Mode override toggle. If your
UI is not capable of displaying icons, then override this property and return
False.  (Inherited from
GH_ActiveObject.)
|
IconDisplayMode|
Gets the current display mode of the object.  (Inherited from
GH_DocumentObject.)
|
InstanceDescription|
Gets the description of this instance. The default description is about the
amount and source of the local values.  (Overrides
GH_InstanceDescriptionInstanceDescription.)
|
InstanceGuid|
Gets the ID of this runtime instance.  (Inherited from
GH_InstanceDescription.)
|
IsDataProvider|
(Overrides
GH_ActiveObjectIsDataProvider.)
|
IsPrincipal|  Gets whether
this parameter is a principal parameter. Principal parameters are maintained
by components and are not part of the IGH_Param interface.
|
Keywords|  Gets a
list of additional keywords that describe the object. Typically this list is
empty but you can override this property to aid in object searches.
(Inherited from
GH_InstanceDescription.)
|
Kind|  Gets the parameter kind.
The kind is evaluated lazily and cached.
|
Locked|  Gets or sets the
enabled flag of this object. Disabled objects are ignored during solutions.
(Inherited from GH_ActiveObject.)
|
MutableNickName|
Gets or sets a value that enables Nick name changes through the menu. The
default is TRUE.  (Inherited from
GH_ActiveObject.)
|
Name|  Gets or sets
the name of the object. This field typically remains fixed during the lifetime
of an object.  (Inherited from
GH_InstanceDescription.)
|
NickName|  Gets or
sets the nickname of the object. This field can be changed by the user.
(Inherited from
GH_InstanceDescription.)
|
Obsolete|  Gets whether
this object is obsolete. Default implementation returns true if the class name
contains the string "OBSOLETE" or if this class has been decorated with the
ObsoleteAttribute. You are free to override this if you want, but I suggest
adding the ObsoleteAttribute instead.  (Inherited from
GH_DocumentObject.)
|
Optional|  Gets or sets
whether or not this parameter is considered optional by the owner component.
Empty, non-optional parameters prevent the component from being solved.
|
Phase|  Gets or sets the
solution phase this object is currenly in.  (Inherited from
GH_ActiveObject.)
|
ProcessorTime|
(Overrides
GH_ActiveObjectProcessorTime.)
|
ProxySourceCount|
Gets the number of proxy sources for this parameter. Proxy sources are used
during file IO, when actual sources might not be available yet. Once an IO
operation has been completed there should be no more proxy sources.
|
Recipients|  Gets a list of
all the recipients of this parameter. I.e. a recipient has this parameter as
one of the sources. The Recipient list is maintained by the parameter, do not
modify it yourself.
|
Reverse|  Gets or sets the data
reverse modifier of this parameter.
|
RuntimeMessageLevel|
Returns the worst case flag for the current object If the object contains at
least 1 error, the result is Error.If the object contains at least 1 warning,
the result is Warning.If the object contains at least 1 message, the result is
Remark.If the object contains no errors, no warnings and no messages, the
result is Blank. (Inherited from
GH_ActiveObject.)
|
Simplify|  Gets or sets the
simplify modifier for this parameter.
|
SourceCount|  Gets the
number of sources for this parameter.
|
Sources|  Gets a list of source
parameters. Do not modify this list, if you wish to add or remove sources, use
dedicated functions like AddSource() and RemoveSource() instead.
|
StateTags|  Gets all the
StateTags that are associated with this parameter. A state tag is a visual
feedback icon that represents specific internal settings.
|
SubCategory|
Gets or sets the SubCategory in which this object belongs. If HasSubCategory()
returns false, this field has no meaning.  (Inherited from
GH_InstanceDescription.)
|
Type|  Gets the Framework Type
descriptor for the stored Data.
|
TypeName|  Calls TypeName() on
the first instance of T it can find. This is either an item in the volatile
list, or a newly constructed instance.
|
VolatileData|
|
VolatileDataCount|
|
WireDisplay|  Gets or sets
the wire display style for this parameter. Wire display only affects the wires
connected to the parameter input.
Top

Methods

| Name| Description
---|---|---
|
AddedToDocument|
This method will be called when an object is added to a document. Override
this method if you want to handle such events.  (Inherited from
GH_DocumentObject.)
|
AddRuntimeMessage|
Add a new message to this object. Valid message type flags are Warning and
Error. If the Message string is empty or zero-length no message is added.
(Inherited from GH_ActiveObject.)
|
AddSource(IGH_Param)|  Append
a new Source parameter to the end of the Sources list. Sources provide this
parameter with data at runtime.
| AddSource(IGH_Param,
Int32)|  Insert a new Source
parameter into the Sources list. Sources provide this parameter with data at
runtime.
| AddVolatileData(GH_Path, Int32,
T)|
| AddVolatileData(GH_Path, Int32,
Object)|  Inserts an
item of volatile data into the data structure.
| AddVolatileDataList(GH_Path,
ListT)|
| AddVolatileDataList(GH_Path,
IEnumerable)|
|
AddVolatileDataTree(GH_StructureT)|
|
AddVolatileDataTree(IGH_Structure)|
|
AppendAdditionalMenuItems|
Override this function if you want to add specific items to the object context
menu Default items already included in the menu toolstrip are: 1\. Name 2\.
Preview 3\. Warnings 4\. Errors  (Overrides
GH_ActiveObjectAppendAdditionalMenuItems(ToolStripDropDown).)
|
AppendMenuItems|
This function is called when a context menu is about to be displayed. Override
it to set custom items. GH_ActiveObject will already populate the menu with
default items, if you merely wish to insert object-specific menu item,
consider overriding AppendAdditionalMenuItems instead.  (Inherited from
GH_ActiveObject.)
|
Cast_Object|  Attempts to
convert the Object reference into an instance of T. This method will perform a
direct cast if possible or it will call Casting functions on T or Data if they
exist. Data will not be duplicated unless a type conversion is required.
|
ClearData|  (Overrides
GH_ActiveObjectClearData.)
|
ClearProxySources|
Remove all proxy sources without attempting to relink them.
|
ClearRuntimeMessages|
Destroy all warning and error lists  (Inherited from
GH_ActiveObject.)
|
CollectData|  (Overrides
GH_ActiveObjectCollectData.)
|
CollectVolatileData_Custom|
If a parameter has no sources, the CollectVolatileData_Custom() method is
called. The basic implementation does nothing, but you can override this
method to provide special data instantiation logic.
|
CollectVolatileData_FromSources|
This method collects volatile data from all the source parameters.
|
ComputeData|  (Overrides
GH_ActiveObjectComputeData.)
|
ConversionCallback|
This method is called whenever a successful conversion takes place from some
source data into local target data. Override it if you wish to keep tabs on
conversions.
|
CopyFrom|  Copy
all fields (except the instance ID) from another instance description.
(Inherited from
GH_InstanceDescription.)
|
CreateAttributes|
(Overrides
GH_DocumentObjectCreateAttributes.)
|
CreateProxySources|
Convert all proper source parameters into proxy sources.
|
DependsOn|  (Overrides
GH_ActiveObjectDependsOn(IGH_ActiveObject).)
|
DestroyIconCache|
Call this method to erase the existing icon cache. You must call this if you
want to change the display icon of an object.  (Inherited from
GH_DocumentObject.)
|
DocumentContextChanged|
This method will be called when the document that owns this object moves into
a different context.  (Inherited from
GH_DocumentObject.)
|
ExpireDownStreamObjects|
(Overrides
GH_ActiveObjectExpireDownStreamObjects.)
|
ExpirePreview|
Call this function when you suspect that the preview has expired for this
object. This will cause the display cache to be eradicated.  (Inherited from
GH_DocumentObject.)
|
ExpireSolution|
Informs the document that owns this object that the solution has expired. The
current object will be set to BLANK as a result. This method is recursive, it
will also expire any and all objects which depend on this object. If you want
a less destructive expiration, consider using ClearData(). If this object is
already Blank, you should consider not expiring it.  (Inherited from
GH_ActiveObject.)
|
ExpireSolutionTopLevel|
Invoke the Expiresolution(bool) method on the toplevel object.
|
Format|  Returns "Null" if the
data is a null reference, otherwise calls ToString() on the Data instance.
| GetValue(String,
Boolean)|  Get a boolean
value from the component value table.  (Inherited from
GH_DocumentObject.)
| GetValue(String,
Double)|  Get a double
value from the component value table.  (Inherited from
GH_DocumentObject.)
| GetValue(String,
Color)|  Get a color
value from the component value table.  (Inherited from
GH_DocumentObject.)
| GetValue(String,
Int32)|  Get an
integer value from the component value table.  (Inherited from
GH_DocumentObject.)
| GetValue(String,
String)|  Get a string
value from the component value table.  (Inherited from
GH_DocumentObject.)
|
HtmlHelp_Source|
Return a String which contains HTML formatted source for the help topic. If
you want to pass a URL that points to a remote page, then prefix the URL with
a GOTO: tag, like so: GOTO:http://www.YourWebAddressHere.com  (Inherited from
GH_DocumentObject.)
|
InstantiateT|  Attempts to
instantiate a new instance of T.
|
IsolateObject|
(Overrides
GH_DocumentObjectIsolateObject.)
|
Menu_AppendBakeItem|
Append the default Bake menu item.  (Inherited from
GH_ActiveObject.)
|
Menu_AppendDisconnectWires|
|
Menu_AppendEnableItem|
Append the default Enable/Disable menu item.  (Inherited from
GH_ActiveObject.)
|
Menu_AppendFlattenParameter|
|
Menu_AppendGraftParameter|
|
Menu_AppendObjectHelp|
Appends the default object Help menu item.  (Inherited from
GH_DocumentObject.)
|
Menu_AppendObjectName|
Appends the old-fashioned object name menu item. If you also want the Display
mode toggle then use Menu_AppendObjectNameEx()  (Inherited from
GH_DocumentObject.)
|
Menu_AppendObjectNameEx|
Appends the default object name + display mode menu item.  (Inherited from
GH_DocumentObject.)
|
Menu_AppendPreviewItem|
Append the default Show/Hide preview menu item.  (Inherited from
GH_ActiveObject.)
|
Menu_AppendPrincipalParameter|
|
Menu_AppendPublish|
Appends the default item for publishing to RCP. This menu will only appear if
the current class implement IRcpAwareObject  (Inherited from
GH_DocumentObject.)
|
Menu_AppendReverseParameter|
|
Menu_AppendRuntimeMessages|
Append the default warnings and errors menu items.  (Inherited from
GH_ActiveObject.)
|
Menu_AppendSimplifyParameter|
|
Menu_AppendWireDisplay|
|
MovedBetweenDocuments|
This method will be called when an object is moved from one document to
another. Override this method if you want to handle such events.  (Inherited
from GH_DocumentObject.)
|
NewInstanceGuid|
Generate a new random instance GUID  (Inherited from
GH_InstanceDescription.)
|
NewInstanceGuid(Guid)|
Set the instance ID to be a specific GUID. This is very dangerous, only use
this function if you're 6"4' and your first name is David.  (Inherited from
GH_InstanceDescription.)
|
OnAttributesChanged|
Raises the AttributesChanged event on the toplevel object.  (Inherited from
GH_DocumentObject.)
|
OnDisplayExpired|
Raises the DisplayExpired event on the toplevel object.  (Inherited from
GH_DocumentObject.)
|
OnObjectChanged(GH_ObjectChangedEventArgs)|
(Inherited from
GH_DocumentObject.)
|
OnObjectChanged(GH_ObjectEventType)|
(Inherited from
GH_DocumentObject.)
|
OnObjectChanged(String)|
(Inherited from
GH_DocumentObject.)
| OnObjectChanged(GH_ObjectEventType,
Object)|
(Inherited from
GH_DocumentObject.)
| OnObjectChanged(String,
Object)|
(Inherited from
GH_DocumentObject.)
|
OnPingDocument|
Raise the PingDocument Event on the toplevel object and try to find the
document which owns this object.  (Inherited from
GH_DocumentObject.)
|
OnPreviewExpired|
Raises the PreviewExpired event on the toplevel object.  (Inherited from
GH_DocumentObject.)
|
OnSolutionExpired|
Raises the SolutionExpired event on the toplevel object. You probably want to
call ExpireSolution() instead of this method directly.  (Inherited from
GH_DocumentObject.)
|
OnVolatileDataCollected|
Once volatile data has been collected this method will be calles. The basic
implementation does nothing, but you can add code here to post-process or
analyze the volatile data.
|
PreferredCast|  Implement
this function if you're certain that you'll be confronted with very common
casts. For example, GH_Point has a preferred cast from Rhino.Geometry.Point3d
and GH_Number has a preferred cast from System.Double.
|
Preview_ComputeClippingBox|
This function can be used to iterate over all items in the Volatile data tree
and collect the union clipping box of all non-null items that implement
Preview.IGH_PreviewData. This function requires a lot of TypeOf and
DirectCasting, so if you're worried about performance you should consider
doing this yourself.
|
Preview_DrawMeshes|
This function can be used to iterate over all items in the Volatile data tree
and call DrawViewportWires on each item that implements
Preview.IGH_PreviewData. This function requires a lot of TypeOf and
DirectCasting, so if you're worried about performance you should consider
doing this yourself.
|
Preview_DrawWires|
This function can be used to iterate over all items in the Volatile data tree
and call DrawViewportWires on each item that implements
Preview.IGH_PreviewData. This function requires a lot of TypeOf and
DirectCasting, so if you're worried about performance you should consider
doing this yourself.
|
Read|  (Overrides
GH_ActiveObjectRead(GH_IReader).)
|
ReadFull|
GH_InstanceDescription does not by default serialize all fields. Use this
function to read _all_ fields from the archive. This method is compatible with
the default Write()/Read() operations.  (Inherited from
GH_InstanceDescription.)
|
RecordUndoEvent(GH_UndoRecord)|
Record an entire undo record.  (Inherited from
GH_DocumentObject.)
|
RecordUndoEvent(String)|
Record a generic object change undo event.  (Inherited from
GH_DocumentObject.)
| RecordUndoEvent(String,
IGH_UndoAction)|
Record a specific object change undo event.  (Inherited from
GH_DocumentObject.)
|
RegisterRemoteIDs|
Override this function if you want object changes in the Rhino document to
trigger a new solution.  (Inherited from
GH_ActiveObject.)
|
RegisterRemoteIDsUtil|
Utility function which treats all data in the Volatile cache as
IGH_GeometricGoo and registers all referenced objects. Call this function from
within RegisterRemoteIDs() if you are absolutely sure that all the items in
volatiledata implement IGH_GeometricGoo.
|
RelinkProxySources|
Attempt to replace all proxy sources with real sources. Proxy sources are used
during file IO, when actual sources might not be available yet. Once an IO
operation has been completed there should be no more proxy sources.
|
RemoveAllSources|
Remove all sources from this parameter.
|
RemovedFromDocument|
This method will be called when an object is removed from a document. Override
this method if you want to handle such events.  (Inherited from
GH_DocumentObject.)
|
RemoveEffects|  Remove
all post-process effects. Note to implementors, you _must_ call the base
method if you override this function.
|
RemoveSource(Guid)|
Remove the specified source from this parameter.
|
RemoveSource(IGH_Param)|
Remove the specified source from this parameter.
|
Render_AppendGeometry|
**Obsolete.** This function has been emptied because it is Obsolete.
| ReplaceSource(Guid,
IGH_Param)|  Replace an
existing source with a new one. If the old_source does not exist in this
parameter, nothing happens.
| ReplaceSource(IGH_Param,
IGH_Param)|  Replace an
existing source with a new one. If the old_source does not exist in this
parameter, nothing happens.
|
RuntimeMessages|
Gets the list of cached runtime messages that were recorded during solver-time
processes.  (Inherited from
GH_ActiveObject.)
|
SDKCompliancy|  Test
whether this object is compliant with a given Rhino version.  (Inherited from
GH_ActiveObject.)
|
SetIconOverride|
Set a new custom icon override for this object.  (Inherited from
GH_DocumentObject.)
|
SetPrincipal|  Set the
principal parameter state.
| SetValue(String,
Boolean)|  Set a named
value. This value will be serialized with the component.  (Inherited from
GH_DocumentObject.)
| SetValue(String,
Double)|  Set a named
value. This value will be serialized with the component.  (Inherited from
GH_DocumentObject.)
| SetValue(String,
Color)|  Set a named
value. This value will be serialized with the component.  (Inherited from
GH_DocumentObject.)
| SetValue(String,
Int32)|  Set a named
value. This value will be serialized with the component.  (Inherited from
GH_DocumentObject.)
| SetValue(String,
String)|  Set a named
value. This value will be serialized with the component.  (Inherited from
GH_DocumentObject.)
|
TriggerAutoSave|
Triggers the AutoSave function on the owner document with the object_changed
flag.  (Inherited from
GH_DocumentObject.)
|
TriggerAutoSave(GH_AutoSaveTrigger)|
Triggers the AutoSave function on the owner document with a custom flag.
(Inherited from
GH_DocumentObject.)
|
TriggerAutoSave(Guid)|
Triggers the AutoSave function on the owner document with the object_changed
flag.  (Inherited from
GH_DocumentObject.)
| TriggerAutoSave(GH_AutoSaveTrigger,
Guid)|
Triggers the AutoSave function on the owner document with a custom flag.
(Inherited from
GH_DocumentObject.)
|
ValuesChanged|
Override this method if you want to respond to changes to the value table. The
base implementation is empty, so you don't have to call it.  (Inherited from
GH_DocumentObject.)
|
VolatileDataDescription|
This method is called to populate the Tooltip data description field.
|
Write|  (Overrides
GH_ActiveObjectWrite(GH_IWriter).)
|
WriteFull|
GH_InstanceDescription does not by default serialize all fields. Use this
function to write _all_ fields to the archive. This method is compatible with
the default Write()/Read() operations.  (Inherited from
GH_InstanceDescription.)
Top

Events

| Name| Description
---|---|---
|
AttributesChanged|
Raised whenever the number or kind of attributes changes. This event is
handled by GH_Documents who subsequently wipe their attribute caches.
(Inherited from
GH_DocumentObject.)
|
DisplayExpired|
Raised whenever the display (on the Canvas) of a certain object becomes
invalid.  (Inherited from
GH_DocumentObject.)
|
ObjectChanged|
(Inherited from
GH_DocumentObject.)
|
PingDocument|
Raised whenever an object needs to know which GH_Document it belongs to.
(Inherited from
GH_DocumentObject.)
|
PreviewExpired|
Raised whenever the display (in the Rhino viewports) of a certain object
becomes invalid.  (Inherited from
GH_DocumentObject.)
|
SolutionExpired|
Raised whenever the solution of a certain object becomes invalid.  (Inherited
from GH_DocumentObject.)
Top

Fields

| Name| Description
---|---|---
|
m_attributes|
(Inherited from
GH_DocumentObject.)
|
m_data|  Contains the runtime
data for this parameter, also known as "Volatile" data.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com