---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_IGH_FieldElement.htm
scraped_at: 2025-09-08T16:21:43.666332
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[IGH_FieldElement
Interface](../html/T_Grasshopper_Kernel_Types_IGH_FieldElement.htm
"IGH_FieldElement Interface")

[IGH_FieldElement
Properties](../html/Properties_T_Grasshopper_Kernel_Types_IGH_FieldElement.htm
"IGH_FieldElement Properties")

[IGH_FieldElement
Methods](../html/Methods_T_Grasshopper_Kernel_Types_IGH_FieldElement.htm
"IGH_FieldElement Methods")

!Click or drag to
resize

# IGH_FieldElement Interface

---

Represents the basic interface for field elements.

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_FieldElement : GH_ISerializable,
    	IGH_PreviewData

    Public Interface IGH_FieldElement
    	Inherits GH_ISerializable, IGH_PreviewData

The IGH_FieldElement type exposes the following members.

Properties

| Name| Description
---|---|---
|
BoundingBox|
Gets the visual boundingbox of all the geometry used to represent this element
in 3D.
|
ClippingBox|  Gets the
clipping box for this data. The clipping box is typically the same as the
boundingbox.  (Inherited from
IGH_PreviewData.)
|
ElementGuid|
Gets the element Guid for this element.
|
IsLimited|  Gets
or sets whether this element affects a limited region.
|
Limits|  Gets or
sets the limits of this region. Unless IsLimited equals true, the Limits
property is ignored.
Top

Methods

| Name| Description
---|---|---
|
DrawViewportMeshes|
Implement this function to draw all shaded meshes. If the viewport does not
support shading, this function will not be called.  (Inherited from
IGH_PreviewData.)
|
DrawViewportWires|
Implement this function to draw all wire and point previews.  (Inherited from
IGH_PreviewData.)
|
Duplicate|
Create an exact copy of this element.
|
Force|  Compute the
force at a given location.
|
IsCoincident|
Computes whether the point can be considered coincident with the element.
|
Read|  This method is called whenever the
instance is required to deserialize itself.  (Inherited from
GH_ISerializable.)
|
Write|  This method is called whenever
the instance is required to serialize itself.  (Inherited from
GH_ISerializable.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com