---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_BracketMismatchException.htm
scraped_at: 2025-09-08T16:18:57.949947
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_BracketMismatchException
Class](../html/T_Grasshopper_Kernel_Data_GH_BracketMismatchException.htm
"GH_BracketMismatchException Class")

[GH_BracketMismatchException Constructor
](../html/Overload_Grasshopper_Kernel_Data_GH_BracketMismatchException__ctor.htm
"GH_BracketMismatchException Constructor ")

[GH_BracketMismatchException
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_BracketMismatchException.htm
"GH_BracketMismatchException Properties")

!Click or drag to
resize

# GH_BracketMismatchException Class

---

Exception used during Rule Set parsing.

Inheritance Hierarchy

SystemObject
SystemException
Grasshopper.Kernel.DataGH_BracketMismatchException

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_BracketMismatchException : Exception

    Public Class GH_BracketMismatchException
    	Inherits Exception

The GH_BracketMismatchException type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_BracketMismatchException|
Initializes a new instance of the GH_BracketMismatchException class
|
GH_BracketMismatchException(String)|
Initializes a new instance of the GH_BracketMismatchException class
| GH_BracketMismatchException(String,
Int32)|
Initializes a new instance of the GH_BracketMismatchException class
Top

Properties

| Name| Description
---|---|---
|
Index|
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com