---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_ModelViewport_Attributes.htm
scraped_at: 2025-09-08T16:23:28.113696
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[ModelViewport.Attributes
Class](../html/T_Grasshopper_Rhinoceros_Display_ModelViewport_Attributes.htm
"ModelViewport.Attributes Class")

[ModelViewport.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_Display_ModelViewport_Attributes__ctor.htm
"ModelViewport.Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_ModelViewport_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_ModelViewport_Attributes.htm
"Attributes Methods")

!Click or drag to
resize

# ModelViewportAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
Grasshopper.Rhinoceros.DisplayModelViewportAttributes
Grasshopper.Rhinoceros.DisplayModelPageViewportAttributes
Grasshopper.Rhinoceros.DisplayModelStandardViewportAttributes

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class Attributes : ModelContentAttributes, IEquatable<ModelViewportAttributes>

    Public Class Attributes
    	Inherits ModelContentAttributes
    	Implements IEquatable(Of ModelViewportAttributes)

The ModelViewportAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelViewportAttributes|
Initializes a new instance of the ModelViewportAttributes class
Top

Properties

| Name| Description
---|---|---
|
DisplayMode|
|
Name|  The last
component of the element Path.  (Inherited from
ModelContentAttributes.)
|
Notes|
(Inherited from
ModelContentAttributes.)
|
Parent|  Path
of the parent element in 'Root::Parent' format if nested.  (Inherited from
ModelContentAttributes.)
|
Path|  Full
content path in 'Root::Parent::Name' format if is nested.  (Inherited from
ModelContentAttributes.)
|
Tags|  (Inherited
from
ModelContentAttributes.)
|
UserText|
|
View|
Top

Methods

| Name| Description
---|---|---
|
AsFrozen|
(Inherited from
ModelContentAttributes.)
|
Clone|  (Inherited
from
ModelDataAttributes.)
|
Equals(Object)|
(Inherited from
ModelContentAttributes.)
| Equals(Object,
IEqualityComparer)|
(Overrides ModelContentAttributesEquals(Object,
IEqualityComparer).)
|
GetHashCode|
(Inherited from
ModelContentAttributes.)
|
GetHashCode(IEqualityComparer)|
(Overrides
ModelContentAttributesGetHashCode(IEqualityComparer).)
|
IsValidContentName|
(Inherited from
ModelContentAttributes.)
|
Read|  (Inherited
from
ModelContentAttributes.)
|
ReadData|
(Overrides
ModelContentAttributesReadData(GH_IReader).)
|
SubClone|
(Inherited from
ModelDataAttributes.)
|
ToDetails|
(Overrides
ModelDataAttributesToDetails.)
|
ToModelData|
(Overrides
ModelDataAttributesToModelData.)
|
ToString|
(Inherited from
ModelContentAttributes.)
|
Write|
(Inherited from
ModelContentAttributes.)
|
WriteData|
(Overrides
ModelContentAttributesWriteData(GH_IWriter).)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com