---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_AssemblyFolderInfo.htm
scraped_at: 2025-09-08T16:15:20.024088
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_AssemblyFolderInfo
Structure](../html/T_Grasshopper_Kernel_GH_AssemblyFolderInfo.htm
"GH_AssemblyFolderInfo Structure")

[GH_AssemblyFolderInfo Constructor
](../html/M_Grasshopper_Kernel_GH_AssemblyFolderInfo__ctor.htm
"GH_AssemblyFolderInfo Constructor ")

[GH_AssemblyFolderInfo
Properties](../html/Properties_T_Grasshopper_Kernel_GH_AssemblyFolderInfo.htm
"GH_AssemblyFolderInfo Properties")

[GH_AssemblyFolderInfo
Methods](../html/Methods_T_Grasshopper_Kernel_GH_AssemblyFolderInfo.htm
"GH_AssemblyFolderInfo Methods")

[GH_AssemblyFolderInfo
Fields](../html/Fields_T_Grasshopper_Kernel_GH_AssemblyFolderInfo.htm
"GH_AssemblyFolderInfo Fields")

!Click or drag to
resize

# GH_AssemblyFolderInfo Structure

---

Represents a folder from which GHA files are loaded.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct GH_AssemblyFolderInfo

    Public Structure GH_AssemblyFolderInfo

The GH_AssemblyFolderInfo type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_AssemblyFolderInfo|
Initializes a new instance of the GH_AssemblyFolderInfo class
Top

Properties

| Name| Description
---|---|---
|
SearchOption|
Gets the search option to use when looking for GHA files in this folder.
Top

Methods

| Name| Description
---|---|---
|
ToString|
(Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Fields

| Name| Description
---|---|---
|
Folder|  The actual
full path to the folder.
|
Type|  Identifies the
type of assembly folder.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com