---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Vector_GH_VectorProxy.htm
scraped_at: 2025-09-08T16:21:41.666832
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Vector.GH_VectorProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Vector_GH_VectorProxy.htm
"GH_Vector.GH_VectorProxy Class")

[GH_Vector.GH_VectorProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Vector_GH_VectorProxy__ctor.htm
"GH_Vector.GH_VectorProxy Constructor ")

[GH_VectorProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Vector_GH_VectorProxy.htm
"GH_VectorProxy Properties")

[GH_VectorProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Vector_GH_VectorProxy.htm
"GH_VectorProxy Methods")

!Click or drag to
resize

# GH_VectorGH_VectorProxy Class

---

Proxy description of GH_Vector class. This class is used by the Generic
Multivalue interfaces.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Vector
Grasshopper.Kernel.TypesGH_VectorGH_VectorProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_VectorProxy : GH_GooProxy<GH_Vector>

    Public Class GH_VectorProxy
    	Inherits GH_GooProxy(Of GH_Vector)

The GH_VectorGH_VectorProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_VectorGH_VectorProxy|
Initializes a new instance of the GH_VectorGH_VectorProxy class
Top

Properties

| Name| Description
---|---|---
|
IsParsable|
(Overrides GH_GooProxy.IsParsable.)
|
Length|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
|
X|
|
Y|
|
Z|
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|
(Overrides
GH_GooProxyTFromString(String).)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|
(Overrides
GH_GooProxyTToString.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com