---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_DisplayColorStop.htm
scraped_at: 2025-09-08T16:23:17.059599
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[DisplayColorStop
Class](../html/T_Grasshopper_Rhinoceros_Display_DisplayColorStop.htm
"DisplayColorStop Class")

[DisplayColorStop Constructor
](../html/Overload_Grasshopper_Rhinoceros_Display_DisplayColorStop__ctor.htm
"DisplayColorStop Constructor ")

[DisplayColorStop
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_DisplayColorStop.htm
"DisplayColorStop Properties")

[DisplayColorStop
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_DisplayColorStop.htm
"DisplayColorStop Methods")

!Click or drag to
resize

# DisplayColorStop Class

---

Represents a gradient colour stop. Wraps the functionality of the ColorStop
type.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooColorStop
Grasshopper.Rhinoceros.DisplayDisplayColorStop

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class DisplayColorStop : GH_Goo<ColorStop>

    Public NotInheritable Class DisplayColorStop
    	Inherits GH_Goo(Of ColorStop)

The DisplayColorStop type exposes the following members.

Constructors

| Name| Description
---|---|---
|
DisplayColorStop|
Blank constructor
|
DisplayColorStop(ColorStop)|
Initializes a new instance of the DisplayColorStop class
|
DisplayColorStop(DisplayColorStop)|
Initializes a new instance of the DisplayColorStop class
Top

Properties

| Name| Description
---|---|---
|
IsValid|
Gets the validity of this instance.  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|
(Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|
(Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|
(Overrides
GH_GooTCastToQ(Q).)
|
Duplicate|
(Overrides
GH_GooTDuplicate.)
|
DuplicateColorStop|
|
EmitProxy|  Create a new
proxy for this instance. Return Null if this class does not support proxies.
(Inherited from GH_GooT.)
|
Read|
(Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|
(Overrides
GH_GooTToString.)
|
Write|
(Overrides
GH_GooTWrite(GH_IWriter).)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com