---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_Transforms_ITransform.htm
scraped_at: 2025-09-08T16:21:52.691907
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types.Transforms](../html/N_Grasshopper_Kernel_Types_Transforms.htm
"Grasshopper.Kernel.Types.Transforms")

[ITransform
Interface](../html/T_Grasshopper_Kernel_Types_Transforms_ITransform.htm
"ITransform Interface")

[ITransform
Properties](../html/Properties_T_Grasshopper_Kernel_Types_Transforms_ITransform.htm
"ITransform Properties")

[ITransform
Methods](../html/Methods_T_Grasshopper_Kernel_Types_Transforms_ITransform.htm
"ITransform Methods")

!Click or drag to
resize

# ITransform Interface

---

Basic interface for a single Grasshopper transformation.

**Namespace:**
Grasshopper.Kernel.Types.Transforms
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface ITransform : GH_ISerializable

    Public Interface ITransform
    	Inherits GH_ISerializable

The ITransform type exposes the following members.

Properties

| Name| Description
---|---|---
|
Name|
Top

Methods

| Name| Description
---|---|---
|
Duplicate|
|
Read|  This method is called whenever the
instance is required to deserialize itself.  (Inherited from
GH_ISerializable.)
|
Reverse|
|
ToMatrix|
|
ToString|
|
Write|  This method is called whenever
the instance is required to serialize itself.  (Inherited from
GH_ISerializable.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types.Transforms
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com