---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Base_GH_ScrollBarVerticalBase.htm
scraped_at: 2025-09-08T16:13:44.600821
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Base](../html/N_Grasshopper_GUI_Base.htm
"Grasshopper.GUI.Base")

[GH_ScrollBarVerticalBase
Class](../html/T_Grasshopper_GUI_Base_GH_ScrollBarVerticalBase.htm
"GH_ScrollBarVerticalBase Class")

[GH_ScrollBarVerticalBase Constructor
](../html/M_Grasshopper_GUI_Base_GH_ScrollBarVerticalBase__ctor.htm
"GH_ScrollBarVerticalBase Constructor ")

[GH_ScrollBarVerticalBase
Properties](../html/Properties_T_Grasshopper_GUI_Base_GH_ScrollBarVerticalBase.htm
"GH_ScrollBarVerticalBase Properties")

[GH_ScrollBarVerticalBase
Methods](../html/Methods_T_Grasshopper_GUI_Base_GH_ScrollBarVerticalBase.htm
"GH_ScrollBarVerticalBase Methods")

!Click or drag to
resize

# GH_ScrollBarVerticalBase Class

---

Provides basic vertical scroll bar logic.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.BaseGH_ScrollBarVerticalBase

**Namespace:** Grasshopper.GUI.Base
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ScrollBarVerticalBase

    Public Class GH_ScrollBarVerticalBase

The GH_ScrollBarVerticalBase type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ScrollBarVerticalBase|
Initializes a new instance of the GH_ScrollBarVerticalBase class
Top

Properties

| Name| Description
---|---|---
|
Content|  Gets
or sets the height of the content
|
ContentOffset|
Gets the vertical offset (in pixels) of the scrolled content.
|
Display|  Gets
or sets the height of the display area.
|
Minimum|  Gets
or sets the minimum height of the scrollbar.
|
Offset|  Gets
the offset of the scroller.
|
OffsetNormalised|
Gets or sets the normalised offset of the scroller.
Top

Methods

| Name| Description
---|---|---
|
BeginDrag|
Start a new drag operation.
|
ContinueDrag|
Continue a drag operation.
|
ScrollBar(Rectangle)|
Compute the size and position of the scroll bar in the scroll rail.
|
ScrollBar(RectangleF)|
Compute the size and position of the scroll bar in the scroll rail.
Top

See Also

#### Reference

Grasshopper.GUI.Base Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com