---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Undo_GH_UndoServer.htm
scraped_at: 2025-09-08T16:22:04.736503
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Undo](../html/N_Grasshopper_Kernel_Undo.htm
"Grasshopper.Kernel.Undo")

[GH_UndoServer Class](../html/T_Grasshopper_Kernel_Undo_GH_UndoServer.htm
"GH_UndoServer Class")

[GH_UndoServer Constructor
](../html/M_Grasshopper_Kernel_Undo_GH_UndoServer__ctor.htm "GH_UndoServer
Constructor ")

[GH_UndoServer
Properties](../html/Properties_T_Grasshopper_Kernel_Undo_GH_UndoServer.htm
"GH_UndoServer Properties")

[GH_UndoServer
Methods](../html/Methods_T_Grasshopper_Kernel_Undo_GH_UndoServer.htm
"GH_UndoServer Methods")

!Click or drag to
resize

# GH_UndoServer Class

---

Provides access to a documents undo data.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.UndoGH_UndoServer

**Namespace:** Grasshopper.Kernel.Undo
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_UndoServer : IGH_DebugDescription

    Public Class GH_UndoServer
    	Implements IGH_DebugDescription

The GH_UndoServer type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_UndoServer|
Initializes a new instance of the GH_UndoServer class
Top

Properties

| Name| Description
---|---|---
|
FirstRedoName|
Gets the name of the last item in the redo stack (the first item to be
redone).
|
FirstUndoName|
Gets the name of the last item in the undo stack (the first item to be
undone).
|
MaxRecords|  Gets or
sets the maximum number of undo records that can be stored.
|
RedoCount|  Number of
redo records currently in the stack.
|
RedoGuids|  Gets a
sorted list of all the redo Guids in this server.
|
RedoNames|  Gets a
sorted list of all the redo Guids in this server.
|
UndoCount|  Number of
undo records currently in the stack.
|
UndoGuids|  Gets a
sorted list of all the undo Guids in this server.
|
UndoNames|  Gets a
sorted list of all the undo Guids in this server.
Top

Methods

| Name| Description
---|---|---
|
AppendToDebugLog|
|
Clear|  Clear both undo
and redo lists.
|
ClearRedo|  Clear the
undo list.
|
ClearUndo|  Clear the
redo list.
|
MergeRecords|
Attempt to merge the N most recent records into one. The name of the merged
record will be identical to the name of the oldest record.
|
PerformRedo|
Performs a single Redo step if possible and migrates the record onto the undo
stack. This function may throw all kinds of exceptions, if you're calling it
from a UI thread, use a Try..Catch block to prevent crashes.
|
PerformUndo|
Performs a single Undo step when possible and migrates the record onto the
redo stack. This function may throw all kinds of exceptions, if you're calling
it from a UI thread, use a Try..Catch block to prevent crashes.
|
PushUndoRecord(GH_UndoRecord)|
Add a new undo record to the undo stack, this function clears the Redo stack.
| PushUndoRecord(String,
GH_UndoAction)|
Add a new undo record to the undo stack, this function clears the Redo stack.
|
RemoveRecord|
Remove the record with the specified ID from the undo or redo stack.
Top

See Also

#### Reference

Grasshopper.Kernel.Undo Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com