---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_Attributes.htm
scraped_at: 2025-09-08T16:18:13.769722
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_Attributes Interface](../html/T_Grasshopper_Kernel_IGH_Attributes.htm
"IGH_Attributes Interface")

[IGH_Attributes
Properties](../html/Properties_T_Grasshopper_Kernel_IGH_Attributes.htm
"IGH_Attributes Properties")

[IGH_Attributes
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_Attributes.htm
"IGH_Attributes Methods")

!Click or drag to
resize

# IGH_Attributes Interface

---

Base interface for all Attributes. Attributes are the visual portion of
GH_DocumentObjects. They handle display, mouse events, layout, context menus
etc. etc. You should consider inheriting from GH_Attributes or some other
abstract class instead of implementing this interface from scratch.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_Attributes : GH_ISerializable,
    	IGH_ResponsiveObject, IGH_TooltipAwareObject

    Public Interface IGH_Attributes
    	Inherits GH_ISerializable, IGH_ResponsiveObject, IGH_TooltipAwareObject

The IGH_Attributes type exposes the following members.

Properties

| Name| Description
---|---|---
|
AllowMessageBalloon|
Gets a value indicating whether these attributes allow warning and error boxes
to be drawn on top of them.
|
Bounds|  Gets the rectangle
that contains the active content of the attributes. Typically the Contents
determine the active area for menus, tooltips etc. Attributes are not supposed
to draw objects beyond the Bounds.
|
DocObject|  Gets the
owner object of these attributes.
|
GetTopLevel|  Gets the
top level attributes of these attributes.
|
HasInputGrip|  Gets a
value indicating whether or not these attributes have an input grip.
|
HasOutputGrip|  Gets
a value indicating whether or not these attributes have an output grip.
|
InputGrip|  Gets the
input grip location for these attributes. If HasInputGrip equals False, this
point is meaningless.
|
InstanceGuid|  Gets
the instance ID for these attributes.
|
IsTopLevel|  Gets
whether these attributes are top_level (i.e. no Parent attributes)
|
OutputGrip|  Gets the
output grip location for these attributes. If HasOutputGrip equals False, this
point is meaningless.
|
Parent|  Gets or sets the
parent attributes. Top level attributes do not have parents.
|
PathName|  Get a
description of the location of these attributes within the local attribute
tree.
|
Pivot|  Gets the pivot for
these attributes. The pivot controls the general placement of the attributes.
If you want to move the attributes, change the pivot location.
|
Selected|  Gets or sets
the selected state of the top-level attributes.
|
TooltipEnabled|
Gets the tooltip enabled value. If False, no further tooltip functions will be
called.  (Inherited from
IGH_TooltipAwareObject.)
Top

Methods

| Name| Description
---|---|---
|
AppendToAttributeTree|
Recursively append these attributes and all child attributes to the attribute
list.
|
ExpireLayout|  Expires
the entire layout of the attributes. When overridden, implementer _must_ place
a call to the base class ExpireLayout().
|
InvalidateCanvas|
If the mouse location should cause a canvas invalidation then return true. You
only need to override this function if you draw objects that are dependant on
cursor positions outside the bounds of the attributes.
|
IsMenuRegion|
Determines whether a point is available for context menu popups. By default,
IsMenuRegion calls IsPickRegion(PointF).
|
IsPickRegion(PointF)|
Determines whether a point is within the pickable region for this object. By
default, any point inside the Bounds is treated as pickable.
| IsPickRegion(RectangleF,
GH_PickBox)|
Determines whether a rectangle is a valid pick region for this object. By
default, the picking rectangle is intersected with the Bounds rectangle.
|
IsTooltipRegion|
Determine whether the specified pixel should result in a tooltip when the
cursor hovers over it.  (Inherited from
IGH_TooltipAwareObject.)
|
NewInstanceGuid|
Generate a new instance GUID for the owner object.
|
NewInstanceGuid(Guid)|
Generate a new instance GUID for the owner object. Do not use this overload
unless you're > 1.95m and called David.
|
PerformLayout|
Recompute the layout for these attributes. This function is automatically
called during Drawing operations, so you typically don't have to.
|
Read|  This method is called whenever the
instance is required to deserialize itself.  (Inherited from
GH_ISerializable.)
|
RenderToCanvas|
Render these attributes into a Canvas control.
|
RespondToKeyDown|
(Inherited from
IGH_ResponsiveObject.)
|
RespondToKeyUp|
(Inherited from
IGH_ResponsiveObject.)
|
RespondToMouseDoubleClick|
This function will be called whenever the left button is double-clicked over
the canvas. If you are active, you will be the only object who gets called.
(Inherited from
IGH_ResponsiveObject.)
|
RespondToMouseDown|
This function will be called whenever a mouse button is pressed over the
canvas. If you are active, you will be the only object who gets called. If you
are inactive, you might get called if nobody on top of you decides to become
active.  (Inherited from
IGH_ResponsiveObject.)
|
RespondToMouseMove|
This function will be called when the mouse moves across the canvas. If you
are active, you will be the only object who gets called. If you are inactive,
you might get called if nobody on top of you decides to become active.
(Inherited from
IGH_ResponsiveObject.)
|
RespondToMouseUp|
This function will be called whenever a mouse button is released over the
canvas. If you are active, you will be the only object who gets called. If you
are inactive, you will not be called at all for MouseUp events.  (Inherited
from
IGH_ResponsiveObject.)
|
SetupTooltip|
This function is called when a tooltip it about to be displayed.  (Inherited
from
IGH_TooltipAwareObject.)
|
Write|  This method is called whenever
the instance is required to serialize itself.  (Inherited from
GH_ISerializable.)
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com