---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_MenuTextBox.htm
scraped_at: 2025-09-08T16:12:53.356404
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_MenuTextBox Class](../html/T_Grasshopper_GUI_GH_MenuTextBox.htm
"GH_MenuTextBox Class")

[GH_MenuTextBox Constructor
](../html/M_Grasshopper_GUI_GH_MenuTextBox__ctor.htm "GH_MenuTextBox
Constructor ")

[GH_MenuTextBox
Properties](../html/Properties_T_Grasshopper_GUI_GH_MenuTextBox.htm
"GH_MenuTextBox Properties")

[GH_MenuTextBox Methods](../html/Methods_T_Grasshopper_GUI_GH_MenuTextBox.htm
"GH_MenuTextBox Methods")

[GH_MenuTextBox Events](../html/Events_T_Grasshopper_GUI_GH_MenuTextBox.htm
"GH_MenuTextBox Events")

!Click or drag to
resize

# GH_MenuTextBox Class

---

Utility control for putting textboxes into menus.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_MenuTextBox

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_MenuTextBox

    Public Class GH_MenuTextBox

The GH_MenuTextBox type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_MenuTextBox|  Constructor for
TextBox collection.
Top

Properties

| Name| Description
---|---|---
|
OriginalText|  Gets or
sets the original text that was visible when the control was first displayed.
|
Text|  Gets or sets the current
text.
|
TextBoxItem|  Gets the
text box control embedded in the menu.
|
Width|  Gets or sets the width
of the control.
Top

Methods

| Name| Description
---|---|---
|
CloseEntireMenuStructure|
Call this function to close the ENTIRE menu structure.
Top

Events

| Name| Description
---|---|---
|
KeyDown|  Raised whenever a
key is pressed.
|
TextChanged|  Raised
whenever the text in the textbox changes.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com