---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Gradient_GH_GripType.htm
scraped_at: 2025-09-08T16:15:06.947429
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Gradient](../html/N_Grasshopper_GUI_Gradient.htm
"Grasshopper.GUI.Gradient")

[GH_Gradient Class](../html/T_Grasshopper_GUI_Gradient_GH_Gradient.htm
"GH_Gradient Class")

[GH_Gradient.GradientChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_Gradient_GH_Gradient_GradientChangedEventHandler.htm
"GH_Gradient.GradientChangedEventHandler Delegate")

[GH_Gradient.SelectionChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_Gradient_GH_Gradient_SelectionChangedEventHandler.htm
"GH_Gradient.SelectionChangedEventHandler Delegate")

[GH_GradientChangedEventArgs
Class](../html/T_Grasshopper_GUI_Gradient_GH_GradientChangedEventArgs.htm
"GH_GradientChangedEventArgs Class")

[GH_Grip Class](../html/T_Grasshopper_GUI_Gradient_GH_Grip.htm "GH_Grip
Class")

[GH_GripSide Enumeration](../html/T_Grasshopper_GUI_Gradient_GH_GripSide.htm
"GH_GripSide Enumeration")

[GH_GripType Enumeration](../html/T_Grasshopper_GUI_Gradient_GH_GripType.htm
"GH_GripType Enumeration")

!Click or drag to
resize

# GH_GripType Enumeration

---

Enumerates the possible grip types.

**Namespace:** Grasshopper.GUI.Gradient
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public enum GH_GripType

    Public Enumeration GH_GripType

Members

| Member name| Value| Description
---|---|---|---
| Continuous| 0|  Grip has the same colour coming in and going out.
| Discontinuous| 1|  Grip has a different colour coming in and going out.

See Also

#### Reference

Grasshopper.GUI.Gradient Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com