---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Line_GH_LineProxy.htm
scraped_at: 2025-09-08T16:20:57.468112
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Line.GH_LineProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Line_GH_LineProxy.htm
"GH_Line.GH_LineProxy Class")

[GH_Line.GH_LineProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Line_GH_LineProxy__ctor.htm
"GH_Line.GH_LineProxy Constructor ")

[GH_LineProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Line_GH_LineProxy.htm
"GH_LineProxy Properties")

[GH_LineProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Line_GH_LineProxy.htm
"GH_LineProxy Methods")

!Click or drag to
resize

# GH_LineGH_LineProxy Class

---

Proxy description of GH_Line class. This class is used by the Generic
Multivalue interfaces.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Line
Grasshopper.Kernel.TypesGH_LineGH_LineProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_LineProxy : GH_GooProxy<GH_Line>

    Public Class GH_LineProxy
    	Inherits GH_GooProxy(Of GH_Line)

The GH_LineGH_LineProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_LineGH_LineProxy|
Initializes a new instance of the GH_LineGH_LineProxy class
Top

Properties

| Name| Description
---|---|---
|
Ax|
|
Ay|
|
Az|
|
Bx|
|
By|
|
Bz|
|
Length|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com