---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_IGH_DataTree.htm
scraped_at: 2025-09-08T16:19:25.080508
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[IGH_DataTree Interface](../html/T_Grasshopper_Kernel_Data_IGH_DataTree.htm
"IGH_DataTree Interface")

[IGH_DataTree
Methods](../html/Methods_T_Grasshopper_Kernel_Data_IGH_DataTree.htm
"IGH_DataTree Methods")

!Click or drag to
resize

# IGH_DataTree Interface

---

Utility interface for detection of DataTree generic instances.

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_DataTree

    Public Interface IGH_DataTree

The IGH_DataTree type exposes the following members.

Methods

| Name| Description
---|---|---
|
MergeWithParameter|
Utility function for assigning Script Data Trees to parameters.
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com