---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Expressions_GH_ScriptVariantType.htm
scraped_at: 2025-09-08T16:19:43.167932
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Expressions](../html/N_Grasshopper_Kernel_Expressions.htm
"Grasshopper.Kernel.Expressions")

[GH_CharType
Enumeration](../html/T_Grasshopper_Kernel_Expressions_GH_CharType.htm
"GH_CharType Enumeration")

[GH_CodeString
Class](../html/T_Grasshopper_Kernel_Expressions_GH_CodeString.htm
"GH_CodeString Class")

[GH_CodeStringSegment
Class](../html/T_Grasshopper_Kernel_Expressions_GH_CodeStringSegment.htm
"GH_CodeStringSegment Class")

[GH_ExpressionParser
Class](../html/T_Grasshopper_Kernel_Expressions_GH_ExpressionParser.htm
"GH_ExpressionParser Class")

[GH_ExpressionString
Class](../html/T_Grasshopper_Kernel_Expressions_GH_ExpressionString.htm
"GH_ExpressionString Class")

[GH_ExpressionSyntaxWriter
Class](../html/T_Grasshopper_Kernel_Expressions_GH_ExpressionSyntaxWriter.htm
"GH_ExpressionSyntaxWriter Class")

[GH_OperatorType
Enumeration](../html/T_Grasshopper_Kernel_Expressions_GH_OperatorType.htm
"GH_OperatorType Enumeration")

[GH_ParserOperator
Class](../html/T_Grasshopper_Kernel_Expressions_GH_ParserOperator.htm
"GH_ParserOperator Class")

[GH_ParserPrecedence
Enumeration](../html/T_Grasshopper_Kernel_Expressions_GH_ParserPrecedence.htm
"GH_ParserPrecedence Enumeration")

[GH_ParserSymbol
Class](../html/T_Grasshopper_Kernel_Expressions_GH_ParserSymbol.htm
"GH_ParserSymbol Class")

[GH_ParserTokenClass
Enumeration](../html/T_Grasshopper_Kernel_Expressions_GH_ParserTokenClass.htm
"GH_ParserTokenClass Enumeration")

[GH_ScriptVariant
Class](../html/T_Grasshopper_Kernel_Expressions_GH_ScriptVariant.htm
"GH_ScriptVariant Class")

[GH_ScriptVariantType
Enumeration](../html/T_Grasshopper_Kernel_Expressions_GH_ScriptVariantType.htm
"GH_ScriptVariantType Enumeration")

[GH_SignatureException
Class](../html/T_Grasshopper_Kernel_Expressions_GH_SignatureException.htm
"GH_SignatureException Class")

[GH_SolverException
Class](../html/T_Grasshopper_Kernel_Expressions_GH_SolverException.htm
"GH_SolverException Class")

[GH_SyntaxException
Class](../html/T_Grasshopper_Kernel_Expressions_GH_SyntaxException.htm
"GH_SyntaxException Class")

[GH_Variant Class](../html/T_Grasshopper_Kernel_Expressions_GH_Variant.htm
"GH_Variant Class")

[GH_VariantType
Enumeration](../html/T_Grasshopper_Kernel_Expressions_GH_VariantType.htm
"GH_VariantType Enumeration")

!Click or drag to
resize

# GH_ScriptVariantType Enumeration

---

**Namespace:**
Grasshopper.Kernel.Expressions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public enum GH_ScriptVariantType

    Public Enumeration GH_ScriptVariantType

Members

| Member name| Value| Description
---|---|---|---
| nothing| 0|
| boolean| 1|
| integer| 2|
| double| 3|
| string| 5|
| datetime| 6|
| point| 10|
| vector| 11|
| plane| 12|
| object| 20|

See Also

#### Reference

Grasshopper.Kernel.Expressions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com