---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Geometry_SpatialTrees_TreeDelegates.htm
scraped_at: 2025-09-08T16:19:55.203810
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Geometry.SpatialTrees](../html/N_Grasshopper_Kernel_Geometry_SpatialTrees.htm
"Grasshopper.Kernel.Geometry.SpatialTrees")

[TreeDelegates
Class](../html/T_Grasshopper_Kernel_Geometry_SpatialTrees_TreeDelegates.htm
"TreeDelegates Class")

[TreeDelegates
Methods](../html/Methods_T_Grasshopper_Kernel_Geometry_SpatialTrees_TreeDelegates.htm
"TreeDelegates Methods")

!Click or drag to
resize

# TreeDelegates Class

---

Provides a bunch of standard coordinate extractor methods.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.Geometry.SpatialTreesTreeDelegates

**Namespace:**
Grasshopper.Kernel.Geometry.SpatialTrees
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class TreeDelegates

    Public NotInheritable Class TreeDelegates

The TreeDelegates type exposes the following members.

Methods

| Name| Description
---|---|---
|
Node2Coordinates|
|
Node3Coordinates|
|
Point2dCoordinates|
|
Point2fCoordinates|
|
Point3dCoordinates|
|
Point3fCoordinates|
|
PointCoordinates|
Top

See Also

#### Reference

Grasshopper.Kernel.Geometry.SpatialTrees
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com