---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelContentEnablerLoader.htm
scraped_at: 2025-09-08T16:22:35.856473
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelContentEnablerLoader
Class](../html/T_Grasshopper_Rhinoceros_ModelContentEnablerLoader.htm
"ModelContentEnablerLoader Class")

[ModelContentEnablerLoader Constructor
](../html/M_Grasshopper_Rhinoceros_ModelContentEnablerLoader__ctor.htm
"ModelContentEnablerLoader Constructor ")

[ModelContentEnablerLoader
Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelContentEnablerLoader.htm
"ModelContentEnablerLoader Methods")

!Click or drag to
resize

# ModelContentEnablerLoader Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_AssemblyPriority
Grasshopper.RhinocerosModelContentEnablerLoader

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class ModelContentEnablerLoader : GH_AssemblyPriority

    Public Class ModelContentEnablerLoader
    	Inherits GH_AssemblyPriority

The ModelContentEnablerLoader type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelContentEnablerLoader|
Initializes a new instance of the ModelContentEnablerLoader class
Top

Methods

| Name| Description
---|---|---
|
PriorityLoad|
(Overrides
GH_AssemblyPriorityPriorityLoad.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com