---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Curve.htm
scraped_at: 2025-09-08T16:20:29.404728
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Curve Class](../html/T_Grasshopper_Kernel_Types_GH_Curve.htm "GH_Curve
Class")

[GH_Curve Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Curve__ctor.htm "GH_Curve
Constructor ")

[GH_Curve
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Curve.htm
"GH_Curve Properties")

[GH_Curve Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Curve.htm
"GH_Curve Methods")

[GH_Curve Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Curve.htm
"GH_Curve Fields")

!Click or drag to
resize

# GH_Curve Class

---

Represents a 3D spline curve.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooCurve
Grasshopper.Kernel.TypesGH_GeometricGooCurve
Grasshopper.Kernel.TypesGH_Curve

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Curve : GH_GeometricGoo<Curve>,
    	IGH_BakeAwareData, IGH_PreviewData

    Public Class GH_Curve
    	Inherits GH_GeometricGoo(Of Curve)
    	Implements IGH_BakeAwareData, IGH_PreviewData

The GH_Curve type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Curve|  Default
constructor, creates an invalid curve.
|
GH_Curve(Curve)|  Create a
duplicate of an existing curve.
|
GH_Curve(GH_Curve)|  Create
a duplicate of another GH_Curve. This constructor also copies reference data.
|
GH_Curve(Guid)|  Create a
new referenced curve that references a Rhino curve object with the specified
ID.
| GH_Curve(Guid,
Int32)|  Create a new
references edge curve that references an edge index in a Rhino Brep object.
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
(Overrides
GH_GeometricGooTBoundingbox.)
|
ClippingBox|
|
IsGeometryLoaded|
Gets the load state of this curve object. The curve is considered to be loaded
when the local OnCurve instance is not null.  (Overrides
GH_GeometricGooTIsGeometryLoaded.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  Gets the validity
of this curve. If the curve is referenced but cannot be loaded, the curve is
not valid.  (Overrides
GH_GeometricGooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
ReferenceEdge|  Gets
or sets the edge index for a referenced curve. If the index >= 0 then an edge
reference is implied.
|
ReferenceID|
(Overrides
GH_GeometricGooTReferenceID.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  (Overrides
GH_GeometricGooTValue.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
|
CastFrom|  Remote to Local
caster function. This stuff is complex, don't concern yourself with casting
logic.  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToT(T)|  Local to
Remote caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GeometricGooTCastToQ(Q).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
ClearCaches|  Clears
all volatile caches for this instance. The boundingbox is cleared, and if the
curve is referenced, the local instance of the curve is erased.  (Overrides
GH_GeometricGooTClearCaches.)
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|  (Overrides
GH_GeometricGooTDuplicate.)
|
DuplicateCurve|
Create a duplicate of this curve.
|
DuplicateGeometry|
Create a duplicate of this curve.  (Overrides
GH_GeometricGooTDuplicateGeometry.)
|
EmitProxy|  Returns a
proxy that represents this curve. Do not call this function unless you're
(Overrides
GH_GeometricGooTEmitProxy.)
|
GetBoundingBox|
(Overrides
GH_GeometricGooTGetBoundingBox(Transform).)
|
LoadGeometry|  If the
geometry is referenced and not yet loaded, attempts to load the geometry.
(Overrides
GH_GeometricGooTLoadGeometry.)
|
LoadGeometry(RhinoDoc)|
If the curve is referenced and not yet loaded, attempts to load the curve.
(Overrides
GH_GeometricGooTLoadGeometry(RhinoDoc).)
|
MakeDeformable|
Converts the local geometry into deformable nurbs curve geometry. This method
will not destroy Reference data.
|
Morph|  (Overrides
GH_GeometricGooTMorph(SpaceMorph).)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|  Format the
curve using default grasshopper formatting logic.  (Overrides
GH_GooTToString.)
|
Transform|  (Overrides
GH_GeometricGooTTransform(Transform).)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com