---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Undo_Actions_GH_RemoveStateAction.htm
scraped_at: 2025-09-08T16:22:22.859020
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Undo.Actions](../html/N_Grasshopper_Kernel_Undo_Actions.htm
"Grasshopper.Kernel.Undo.Actions")

[GH_RemoveStateAction
Class](../html/T_Grasshopper_Kernel_Undo_Actions_GH_RemoveStateAction.htm
"GH_RemoveStateAction Class")

[GH_RemoveStateAction Constructor
](../html/M_Grasshopper_Kernel_Undo_Actions_GH_RemoveStateAction__ctor.htm
"GH_RemoveStateAction Constructor ")

[GH_RemoveStateAction
Properties](../html/Properties_T_Grasshopper_Kernel_Undo_Actions_GH_RemoveStateAction.htm
"GH_RemoveStateAction Properties")

[GH_RemoveStateAction
Methods](../html/Methods_T_Grasshopper_Kernel_Undo_Actions_GH_RemoveStateAction.htm
"GH_RemoveStateAction Methods")

[GH_RemoveStateAction
Fields](../html/Fields_T_Grasshopper_Kernel_Undo_Actions_GH_RemoveStateAction.htm
"GH_RemoveStateAction Fields")

!Click or drag to
resize

# GH_RemoveStateAction Class

---

Record the removal of a single solution state from a document.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.UndoGH_UndoAction
Grasshopper.Kernel.UndoGH_ArchivedUndoAction
Grasshopper.Kernel.Undo.ActionsGH_RemoveStateAction

**Namespace:**
Grasshopper.Kernel.Undo.Actions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RemoveStateAction : GH_ArchivedUndoAction

    Public Class GH_RemoveStateAction
    	Inherits GH_ArchivedUndoAction

The GH_RemoveStateAction type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_RemoveStateAction|
Initializes a new instance of the GH_RemoveStateAction class
Top

Properties

| Name| Description
---|---|---
|
ExpiresDisplay|
Override this property if you want the Rhino viewport display to refresh upon
undo completion.  (Inherited from
GH_UndoAction.)
|
ExpiresSolution|
Override this property if you want the Grasshopper solution to refresh upon
undo completion.  (Inherited from
GH_UndoAction.)
|
State|  (Inherited from
GH_UndoAction.)
Top

Methods

| Name| Description
---|---|---
|
Deserialize|
Deserializes the obj from the local archive.  (Inherited from
GH_ArchivedUndoAction.)
|
Internal_Redo|
(Overrides
GH_UndoActionInternal_Redo(GH_Document).)
|
Internal_Undo|
(Overrides
GH_UndoActionInternal_Undo(GH_Document).)
|
Read|
(Overrides
GH_ArchivedUndoActionRead(GH_IReader).)
|
Redo|  (Inherited from
GH_UndoAction.)
|
Serialize|
Serializes the obj into the local archive.  (Inherited from
GH_ArchivedUndoAction.)
|
SerializeToByteArray|
Serializes the obj into the local archive.  (Inherited from
GH_ArchivedUndoAction.)
|
Undo|  (Inherited from
GH_UndoAction.)
|
Write|
(Overrides
GH_ArchivedUndoActionWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_data|
Internal data storage for serialized archives.  (Inherited from
GH_ArchivedUndoAction.)
Top

See Also

#### Reference

Grasshopper.Kernel.Undo.Actions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com