---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_TreeRules.htm
scraped_at: 2025-09-08T16:19:24.085400
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_TreeRules Class](../html/T_Grasshopper_Kernel_Data_GH_TreeRules.htm
"GH_TreeRules Class")

[GH_TreeRules Constructor
](../html/M_Grasshopper_Kernel_Data_GH_TreeRules__ctor.htm "GH_TreeRules
Constructor ")

[GH_TreeRules
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_TreeRules.htm
"GH_TreeRules Properties")

[GH_TreeRules
Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_TreeRules.htm
"GH_TreeRules Methods")

[GH_TreeRules
Fields](../html/Fields_T_Grasshopper_Kernel_Data_GH_TreeRules.htm
"GH_TreeRules Fields")

!Click or drag to
resize

# GH_TreeRules Class

---

Represents an entire data tree rule set.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_TreeRules

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_TreeRules

    Public NotInheritable Class GH_TreeRules

The GH_TreeRules type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_TreeRules|  Constructs
a new rule set for testing data trees. Unless you know exactly what you are
doing, use the FromString() static method instead.
Top

Properties

| Name| Description
---|---|---
|
HasItemRule|  Gets
whether this rule set has a defined index rule.
|
HasPathRules|  Gets
whether this rule set has any path rules.
|
PathRuleCount|
Gets the number of defined path rules.
Top

Methods

| Name| Description
---|---|---
|
Apply(GH_Path)|  Apply all
the local rules to a path.
| Apply(GH_Path,
Int32)|  Apply all the
local rules to a path+index combination.
|
FromString|  Attempt
to parse a Pattern string.
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

Fields

| Name| Description
---|---|---
|
AllowedChars|
|
AndOperator|
|
AnyNumbersSymbol|
|
AnyNumberSymbol|
|
ItemBrackets|
|
ItemCloseBracket|
|
ItemOpenBracket|
|
NotOperator|
|
OrOperator|
|
PathBrackets|
|
PathCloseBracket|
|
PathOpenBracket|
|
PathSeparator|
|
RangeSymbol|
|
RuleBrackets|
|
RuleCloseBracket|
|
RuleOpenBracket|
|
Separator|
|
SequenceCode|
|
SequenceSymbol|
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com