---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Documentation_GH_List.htm
scraped_at: 2025-09-08T16:11:59.172255
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Documentation](../html/N_Grasshopper_Documentation.htm
"Grasshopper.Documentation")

[GH_List Class](../html/T_Grasshopper_Documentation_GH_List.htm "GH_List
Class")

[GH_List
Properties](../html/Properties_T_Grasshopper_Documentation_GH_List.htm
"GH_List Properties")

[GH_List Methods](../html/Methods_T_Grasshopper_Documentation_GH_List.htm
"GH_List Methods")

!Click or drag to
resize

# GH_List Class

---

Represents a list of items in the Grasshopper help.

Inheritance Hierarchy

SystemObject
Grasshopper.DocumentationGH_List

**Namespace:** Grasshopper.Documentation
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_List : IGH_Content

    Public Class GH_List
    	Implements IGH_Content

The GH_List type exposes the following members.

Properties

| Name| Description
---|---|---
|
Items|
|
Ordered|
Top

Methods

| Name| Description
---|---|---
|
Create(Boolean)|
|
Create(Boolean,
IEnumerableIGH_Content)|
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

See Also

#### Reference

Grasshopper.Documentation Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com