---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Render_ModelRenderContent_Attributes.htm
scraped_at: 2025-09-08T16:24:36.400878
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Render](../html/N_Grasshopper_Rhinoceros_Render.htm
"Grasshopper.Rhinoceros.Render")

[ModelRenderContent.Attributes
Class](../html/T_Grasshopper_Rhinoceros_Render_ModelRenderContent_Attributes.htm
"ModelRenderContent.Attributes Class")

[Attributes Constructor
](../html/Overload_Grasshopper_Rhinoceros_Render_ModelRenderContent_Attributes__ctor.htm
"Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Render_ModelRenderContent_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Render_ModelRenderContent_Attributes.htm
"Attributes Methods")

!Click or drag to
resize

# ModelRenderContentAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
Grasshopper.Rhinoceros.RenderModelRenderContentAttributes
Grasshopper.Rhinoceros.RenderModelRenderEnvironmentAttributes
Grasshopper.Rhinoceros.RenderModelRenderMaterialAttributes
Grasshopper.Rhinoceros.RenderModelRenderTextureAttributes

**Namespace:**
Grasshopper.Rhinoceros.Render
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class Attributes : ModelContentAttributes,
    	IEquatable<ModelRenderContentAttributes>

    Public MustInherit Class Attributes
    	Inherits ModelContentAttributes
    	Implements IEquatable(Of ModelRenderContentAttributes)

The ModelRenderContentAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelRenderContentAttributes|
Initializes a new instance of the ModelRenderContentAttributes class
|
ModelRenderContentAttributes(RenderContent)|
Initializes a new instance of the ModelRenderContentAttributes class
Top

Properties

| Name| Description
---|---|---
|
Name|  The last
component of the element Path.  (Inherited from
ModelContentAttributes.)
|
Notes|
(Inherited from
ModelContentAttributes.)
|
Parent|  Path
of the parent element in 'Root::Parent' format if nested.  (Inherited from
ModelContentAttributes.)
|
Path|  Full
content path in 'Root::Parent::Name' format if is nested.  (Inherited from
ModelContentAttributes.)
|
RenderContent|
|
Tags|  (Inherited
from
ModelContentAttributes.)
Top

Methods

| Name| Description
---|---|---
|
AsFrozen|
(Inherited from
ModelContentAttributes.)
|
Clone|  (Inherited
from
ModelDataAttributes.)
|
Equals(Object)|
(Inherited from
ModelContentAttributes.)
| Equals(Object,
IEqualityComparer)|
(Overrides ModelContentAttributesEquals(Object,
IEqualityComparer).)
|
GetHashCode|
(Inherited from
ModelContentAttributes.)
|
GetHashCode(IEqualityComparer)|
(Overrides
ModelContentAttributesGetHashCode(IEqualityComparer).)
|
IsValidContentName|
(Inherited from
ModelContentAttributes.)
|
Read|  (Inherited
from
ModelContentAttributes.)
|
ReadData|
(Overrides
ModelContentAttributesReadData(GH_IReader).)
|
SubClone|
(Overrides
ModelDataAttributesSubClone.)
|
ToDetails|
(Overrides
ModelDataAttributesToDetails.)
|
ToModelData|
(Inherited from
ModelDataAttributes.)
|
ToString|
(Inherited from
ModelContentAttributes.)
|
Write|
(Inherited from
ModelContentAttributes.)
|
WriteData|
(Overrides
ModelContentAttributesWriteData(GH_IWriter).)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Render Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com