---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_DragInfo.htm
scraped_at: 2025-09-08T16:12:30.295540
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_DragInfo Class](../html/T_Grasshopper_GUI_GH_DragInfo.htm "GH_DragInfo
Class")

[GH_DragInfo Constructor ](../html/M_Grasshopper_GUI_GH_DragInfo__ctor.htm
"GH_DragInfo Constructor ")

[GH_DragInfo Properties](../html/Properties_T_Grasshopper_GUI_GH_DragInfo.htm
"GH_DragInfo Properties")

[GH_DragInfo Methods](../html/Methods_T_Grasshopper_GUI_GH_DragInfo.htm
"GH_DragInfo Methods")

!Click or drag to
resize

# GH_DragInfo Class

---

Contains data used for UI drag operations.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_DragInfo

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DragInfo

    Public Class GH_DragInfo

The GH_DragInfo type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DragInfo|  Create a new DragInfo
instance.
Top

Properties

| Name| Description
---|---|---
|
Box_Drag|  Gets the dimensions
of the box as a result of the dragging op.
|
Box_Start|  Gets the dimensions
of the drag box prior to dragging.
|
Constraint|  Gets or sets the
directional constraint for the drag operation.
|
Point_Drag|  Gets the cursor
location at the current moment.
|
Point_Start|  Gets the cursor
location at the start of the drag.
|
Region|  Gets or sets the drag
limits. If the region is Rectangle.Empty then the region is ignored. For valid
results the Region should be larger than the dimensions of the drag box.
Top

Methods

| Name| Description
---|---|---
|
Drag|  Call this method to adjust
the drag data. Results will be automatically constrained and limited.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com