---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_IGH_GeometricGoo.htm
scraped_at: 2025-09-08T16:21:44.677350
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[IGH_GeometricGoo
Interface](../html/T_Grasshopper_Kernel_Types_IGH_GeometricGoo.htm
"IGH_GeometricGoo Interface")

[IGH_GeometricGoo
Properties](../html/Properties_T_Grasshopper_Kernel_Types_IGH_GeometricGoo.htm
"IGH_GeometricGoo Properties")

[IGH_GeometricGoo
Methods](../html/Methods_T_Grasshopper_Kernel_Types_IGH_GeometricGoo.htm
"IGH_GeometricGoo Methods")

!Click or drag to
resize

# IGH_GeometricGoo Interface

---

Base interface for all Data inside Grasshoper that could pass for Geometry

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_GeometricGoo : IGH_Goo

    Public Interface IGH_GeometricGoo
    	Inherits IGH_Goo

The IGH_GeometricGoo type exposes the following members.

Properties

| Name| Description
---|---|---
|
Boundingbox|
Gets the (cached) boundingbox for this geometry. Not all geometry types cache
boundingbox results.
|
IsGeometryLoaded|
Gets a value indicating whether or not this geometry is currently loaded
(assuming it is referenced). Not all IGH_GeometricGoo implementations support
referenced geometry.
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.
|
IsValid|  Gets a value
indicating whether or not the current value is valid.  (Inherited from
IGH_Goo.)
|
IsValidWhyNot|  Gets a
string describing the state of "invalidness". If the instance _is_ valid, then
this property should return Nothing or String.Empty.  (Inherited from
IGH_Goo.)
|
ReferenceID|
Gets or sets the Guid of the object that is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.
|
TypeDescription|
Gets a description of the type of the implementation.  (Inherited from
IGH_Goo.)
|
TypeName|  Gets the name of
the type of the implementation.  (Inherited from
IGH_Goo.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  Attempt a cast
from generic object  (Inherited from
IGH_Goo.)
|
CastToT|  Attempt a cast
to type T  (Inherited from IGH_Goo.)
|
ClearCaches|
Clears all caches. Typically if the geometry is referenced, this will erase
the local copy.
|
Duplicate|  Make a
complete duplicate of this instance. No shallow copies.  (Inherited from
IGH_Goo.)
|
DuplicateGeometry|
Make a complete duplicate of this geometry. No shallow copies.
|
EmitProxy|  Create a new
proxy for this instance. Return Null if this class does not support proxies.
(Inherited from IGH_Goo.)
|
GetBoundingBox|
Compute an aligned boundingbox.
|
LoadGeometry|
If the geometry is referenced and currently unloaded, forces loading of the
geometry. Not all IGH_GeometricGoo implementations support referenced
geometry.
|
LoadGeometry(RhinoDoc)|
If the geometry is referenced and currently unloaded, forces loading of the
geometry. Not all IGH_GeometricGoo implementations support referenced
geometry.
|
Morph|  Morph the
object or a deformable representation of the object.
|
ScriptVariable|  This
function will be called when the local IGH_Goo instance disapears into a user
Script. This would be an excellent place to cast your IGH_Goo type to a simple
data type.  (Inherited from
IGH_Goo.)
|
ToString|  Creates a string
description of the current instance value  (Inherited from
IGH_Goo.)
|
Transform|
Transforms the object or a deformable representation of the object.
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com