---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Colour.htm
scraped_at: 2025-09-08T16:20:26.342857
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Colour Class](../html/T_Grasshopper_Kernel_Types_GH_Colour.htm "GH_Colour
Class")

[GH_Colour Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Colour__ctor.htm "GH_Colour
Constructor ")

[GH_Colour
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Colour.htm
"GH_Colour Properties")

[GH_Colour Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Colour.htm
"GH_Colour Methods")

[GH_Colour Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Colour.htm
"GH_Colour Fields")

!Click or drag to
resize

# GH_Colour Class

---

Represents an ARGB colour. GH_Colour re-implements the framework
System.Drawing.Color type.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooColor
Grasshopper.Kernel.TypesGH_Colour

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Colour : GH_Goo<Color>

    Public Class GH_Colour
    	Inherits GH_Goo(Of Color)

The GH_Colour type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Colour|  Blank
constructor
|
GH_Colour(Color)|
Initializes a new instance of the GH_Colour class
|
GH_Colour(GH_Colour)|
Initializes a new instance of the GH_Colour class
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets the
validity of this instance.  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  (Overrides
GH_GooTCastFrom(Object).)
|
CastToT(T)|  (Overrides
GH_GooTCastToQ(Q).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
Duplicate|  (Overrides
GH_GooTDuplicate.)
|
DuplicateColour|
|
EmitProxy|  (Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com