---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_ListUtil.htm
scraped_at: 2025-09-08T16:17:03.456456
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_ListUtil Class](../html/T_Grasshopper_Kernel_GH_ListUtil.htm "GH_ListUtil
Class")

[GH_ListUtil Methods](../html/Methods_T_Grasshopper_Kernel_GH_ListUtil.htm
"GH_ListUtil Methods")

!Click or drag to
resize

# GH_ListUtil Class

---

Provides utilities for dealing with list of Data from input parameters.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_ListUtil

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_ListUtil

    Public NotInheritable Class GH_ListUtil

The GH_ListUtil type exposes the following members.

Methods

| Name| Description
---|---|---
|
CountNonNullRefsT|
Count all object references in L
|
CountNullRefsT|
Count all null references in L
|
EnsureNonNullCountT|
Tests a list to see if it contains sufficient non-null references.
|
FirstNonNullItemT|
Returns the index of the first non-null item in a list.
|
RemoveNullRefsT|
Remove all null references from a list of items.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com