---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Number.htm
scraped_at: 2025-09-08T16:21:11.551495
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Number Class](../html/T_Grasshopper_Kernel_Types_GH_Number.htm "GH_Number
Class")

[GH_Number Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Number__ctor.htm "GH_Number
Constructor ")

[GH_Number
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Number.htm
"GH_Number Properties")

[GH_Number Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Number.htm
"GH_Number Methods")

[GH_Number Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Number.htm
"GH_Number Fields")

!Click or drag to
resize

# GH_Number Class

---

Represents a double-precision floating point number. GH_Number re-implements
the framework System.Double type.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooDouble
Grasshopper.Kernel.TypesGH_Number
Grasshopper.Rhinoceros.DraftingModelLineWidth

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Number : GH_Goo<double>

    Public Class GH_Number
    	Inherits GH_Goo(Of Double)

The GH_Number type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Number|  Blank
constructor
|
GH_Number(Double)|
Initializes a new instance of the GH_Number class
|
GH_Number(GH_Number)|
Initializes a new instance of the GH_Number class
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets the
validity of this instance. If the number is NaN, then it is considered invalid
(Overrides GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  (Overrides
GH_GooTCastToQ(Q).)
|
Duplicate|  (Overrides
GH_GooTDuplicate.)
|
DuplicateNumber|
|
EmitProxy|  (Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com