---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Utility.htm
scraped_at: 2025-09-08T16:11:50.096117
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper

Utility Class

Utility Methods

!Click or drag to
resize

# Utility Class

---

Class with useful static methods.

Inheritance Hierarchy

SystemObject
GrasshopperUtility

**Namespace:** Grasshopper
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Utility

    Public NotInheritable Class Utility

The Utility type exposes the following members.

Methods

| Name| Description
---|---|---
|
DocumentAngleTolerance|
Returns the Angle Tolerance in degrees for the model document
|
DocumentTolerance|  Returns the
Absolute Tolerance of the model document
|
DocumentUnits|  Returns the unit
system for the model document
|
FixNewlines(String)|  Make sure all
newlines in a string adhere to the current platform standard.
|
FixNewlines(String, String)|  Make
sure all newlines in a string have a specific pattern.
|
InvokeDownloader|  Start an
asynchronous download operation. The download runs in a separate appdomain.
After triggering that process this method returns immediately.
|
InvokeGetter|  Call a getter
property via its name.
|
InvokeGetterSafe|  Call a getter
property via its name. No exceptions are thrown.
|
InvokeMethod(Object, String)|  Call
a method via its name.
|
InvokeMethod(Object, String,
Object)|  Call a method via its
name.
|
InvokeMethodSafe(Object,
String)|  Call a method via its
name. No exceptions are thrown.
|
InvokeMethodSafe(Object, String,
Object)|  Call a method via its
name. No exceptions are thrown.
|
InvokeSetter|  Call a setter
property via its name.
|
InvokeSetterSafe|  Call a setter
property via its name. No exceptions are thrown.
|
LikeOperator|  Exposes the VB.NET
Like operator as a static method.
|
SetDefaultTolerances|
Utility function to set absolute and angle tolerance fields.
|
SetDefaultUnits|  Utility
function to set model unit fields
|
TernaryIfT|  **Obsolete.** Type safe
implementation of the IIf conditional statement.
Top

See Also

#### Reference

Grasshopper Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com