---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_Transforms_Identity.htm
scraped_at: 2025-09-08T16:21:51.692278
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types.Transforms](../html/N_Grasshopper_Kernel_Types_Transforms.htm
"Grasshopper.Kernel.Types.Transforms")

[Identity Class](../html/T_Grasshopper_Kernel_Types_Transforms_Identity.htm
"Identity Class")

[Identity Constructor
](../html/M_Grasshopper_Kernel_Types_Transforms_Identity__ctor.htm "Identity
Constructor ")

[Identity
Properties](../html/Properties_T_Grasshopper_Kernel_Types_Transforms_Identity.htm
"Identity Properties")

[Identity
Methods](../html/Methods_T_Grasshopper_Kernel_Types_Transforms_Identity.htm
"Identity Methods")

!Click or drag to
resize

# Identity Class

---

Implements a null-transform.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.Types.TransformsIdentity

**Namespace:**
Grasshopper.Kernel.Types.Transforms
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class Identity : ITransform

    Public Class Identity
    	Implements ITransform

The Identity type exposes the following members.

Constructors

| Name| Description
---|---|---
|
Identity|
Initializes a new instance of the Identity class
Top

Properties

| Name| Description
---|---|---
|
Name|
Top

Methods

| Name| Description
---|---|---
|
Duplicate|
|
Read|
|
Reverse|
|
ToMatrix|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types.Transforms
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com