---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Expressions_GH_SignatureException.htm
scraped_at: 2025-09-08T16:19:44.167050
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Expressions](../html/N_Grasshopper_Kernel_Expressions.htm
"Grasshopper.Kernel.Expressions")

[GH_SignatureException
Class](../html/T_Grasshopper_Kernel_Expressions_GH_SignatureException.htm
"GH_SignatureException Class")

[GH_SignatureException Constructor
](../html/M_Grasshopper_Kernel_Expressions_GH_SignatureException__ctor.htm
"GH_SignatureException Constructor ")

[GH_SignatureException
Properties](../html/Properties_T_Grasshopper_Kernel_Expressions_GH_SignatureException.htm
"GH_SignatureException Properties")

!Click or drag to
resize

# GH_SignatureException Class

---

Inheritance Hierarchy

SystemObject
SystemException
Grasshopper.Kernel.ExpressionsGH_SignatureException

**Namespace:**
Grasshopper.Kernel.Expressions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_SignatureException : Exception

    Public Class GH_SignatureException
    	Inherits Exception

The GH_SignatureException type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_SignatureException|
Initializes a new instance of the GH_SignatureException class
Top

Properties

| Name| Description
---|---|---
|
Message|
(Overrides
[ExceptionMessage](https://docs.microsoft.com/dotnet/api/system.exception.message#system-
exception-message).)
Top

See Also

#### Reference

Grasshopper.Kernel.Expressions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com