---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Drafting_ModelLineWidth.htm
scraped_at: 2025-09-08T16:23:53.214059
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Drafting](../html/N_Grasshopper_Rhinoceros_Drafting.htm
"Grasshopper.Rhinoceros.Drafting")

[ModelLineWidth
Class](../html/T_Grasshopper_Rhinoceros_Drafting_ModelLineWidth.htm
"ModelLineWidth Class")

[ModelLineWidth Constructor
](../html/Overload_Grasshopper_Rhinoceros_Drafting_ModelLineWidth__ctor.htm
"ModelLineWidth Constructor ")

[ModelLineWidth
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Drafting_ModelLineWidth.htm
"ModelLineWidth Properties")

[ModelLineWidth
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Drafting_ModelLineWidth.htm
"ModelLineWidth Methods")

!Click or drag to
resize

# ModelLineWidth Class

---

Represents a Rhino model linetype.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooDouble
Grasshopper.Kernel.TypesGH_Number
Grasshopper.Rhinoceros.DraftingModelLineWidth

**Namespace:**
Grasshopper.Rhinoceros.Drafting
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelLineWidth : GH_Number,
    	IEquatable<ModelLineWidth>

    Public NotInheritable Class ModelLineWidth
    	Inherits GH_Number
    	Implements IEquatable(Of ModelLineWidth)

The ModelLineWidth type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelLineWidth|
Initializes a new instance of the ModelLineWidth class
|
ModelLineWidth(Double)|
Initializes a new instance of the ModelLineWidth class
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets the
validity of this instance. If the number is NaN, then it is considered invalid
(Inherited from GH_Number.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Inherited from
GH_Number.)
|
TypeDescription|
(Overrides
GH_NumberTypeDescription.)
|
TypeName|
(Overrides
GH_NumberTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|
(Overrides
GH_NumberCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  (Inherited
from GH_Number.)
|
Duplicate|
(Overrides
GH_NumberDuplicate.)
|
DuplicateNumber|
(Inherited from GH_Number.)
|
EmitProxy|  (Inherited
from GH_Number.)
|
Equals(ModelLineWidth)|
|
Equals(Object)|
(Overrides
[ObjectEquals(Object)](https://docs.microsoft.com/dotnet/api/system.object.equals#system-
object-equals\(system-object\)).)
|
GetHashCode|
(Overrides
[ObjectGetHashCode](https://docs.microsoft.com/dotnet/api/system.object.gethashcode#system-
object-gethashcode).)
|
Read|  (Inherited from
GH_Number.)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|
(Overrides
GH_NumberToString.)
|
Write|  (Inherited from
GH_Number.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Drafting
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com