---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_Component_GH_OutputParamManager.htm
scraped_at: 2025-09-08T16:15:43.118293
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_Component.GH_OutputParamManager
Class](../html/T_Grasshopper_Kernel_GH_Component_GH_OutputParamManager.htm
"GH_Component.GH_OutputParamManager Class")

[GH_OutputParamManager
Properties](../html/Properties_T_Grasshopper_Kernel_GH_Component_GH_OutputParamManager.htm
"GH_OutputParamManager Properties")

[GH_OutputParamManager
Methods](../html/Methods_T_Grasshopper_Kernel_GH_Component_GH_OutputParamManager.htm
"GH_OutputParamManager Methods")

!Click or drag to
resize

# GH_ComponentGH_OutputParamManager Class

---

This class is used during Component construction to add output parameters.

Inheritance Hierarchy

SystemObject
GH_ParamManager
Grasshopper.KernelGH_ComponentGH_OutputParamManager

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    protected class GH_OutputParamManager : GH_ParamManager

    Protected Class GH_OutputParamManager
    	Inherits GH_ParamManager

The GH_ComponentGH_OutputParamManager type exposes the following members.

Properties

| Name| Description
---|---|---
|
Param|
Gets the output parameter at the given index.  (Overrides
GH_ParamManager.Param.)
|
ParamCount|
Returns the number of output parameters already part of this component.
(Overrides GH_ParamManager.ParamCount.)
Top

Methods

| Name| Description
---|---|---
|
AddArcParameter|
Add a 3D Arc parameter to the output list of this component.
|
AddBooleanParameter|
Add a Boolean parameter to the output list of this component.
|
AddBoxParameter|
Add a 3D Box parameter to the output list of this component.
|
AddBrepParameter|
Add a Brep parameter to the output list of this component. Brep parameters can
handle both trimmed and untrimmed single or multi-faced Breps.
|
AddCircleParameter|
Add a 3D Circle parameter to the output list of this component.
|
AddColourParameter|
Add a ARGB Colour parameter to the output list of this component.
|
AddComplexNumberParameter|
Add a Complex Number parameter to the output list of this component.
|
AddCultureParameter|
Add a Culture parameter to the output list of this component.
|
AddCurveParameter|
Add a Curve parameter to the output list of this component. Curve parameters
can handle all curve types (Lines, Polylines, Circles, Arcs, NurbsCurves etc.)
|
AddFieldParameter|
Add a Field parameter to the output list of this component.
|
AddGenericParameter|
Add a Generic parameter to the output list of this component. Generic
parameters can handle all types of data.
|
AddGeometryParameter|
Add a Geometry parameter to the output list of this component. Geometry
parameters can handle all types that represent actual shapes.
|
AddGroupParameter|
Add a Transform Group parameter to the output list of this component. Groups
are collections of geometry that are transformed as one, they are not the same
as Rhino groups.
|
AddIntegerParameter|
Add a Integer parameter to the output list of this component.
|
AddInterval2DParameter|
Add a Interval2D (i.e. uv domain) parameter to the output list of this
component.
|
AddIntervalParameter|
Add a Interval (i.e. numeric domain) parameter to the output list of this
component.
|
AddLineParameter|
Add a 3D Line parameter to the output list of this component.
|
AddMatrixParameter|
Add a Matrix parameter to the output list of this component.
|
AddMeshFaceParameter|
Add a topological MeshFace parameter to the output list of this component.
|
AddMeshParameter|
Add a Mesh parameter to the output list of this component.
|
AddNumberParameter|
Add a floating point Number parameter to the output list of this component.
|
AddParameter(IGH_Param)|
Generic parameter addition. If you cannot use one of the utility methods
provided by this class, you can register a customized parameter using this
method.
| AddParameter(IGH_Param, String,
String, String,
GH_ParamAccess)|
Generic parameter addition. If you cannot use one of the utility methods
provided by this class, you can register a customized parameter using this
method.
|
AddPathParameter|
Add a Data Path parameter to the output list of this component.
|
AddPlaneParameter|
Add a 3D Plane parameter to the output list of this component.
|
AddPointParameter|
Add a 3D Point parameter to the output list of this component.
|
AddRectangleParameter|
Add a 3D Rectangle parameter to the output list of this component.
|
AddSubDParameter|
Add a Sub-D parameter to the output list of this component.
|
AddSurfaceParameter|
Add a Surface parameter to the output list of this component. Surface
parameters can handle both trimmed and untrimmed single-faced Breps.
|
AddTextParameter|
Add a Text parameter to the output list of this component.
|
AddTimeParameter|
Add a Time parameter to the output list of this component.
|
AddTransformParameter|
Add a Transformation parameter to the output list of this component.
|
AddVectorParameter|
Add a 3D Vector parameter to the output list of this component.
|
HideParameter|
Hide a specific output parameter. If the parameter at the given index
implement IGH_PreviewObject then the Hidden flag will be set to True.
Otherwise, nothing will happen.  (Overrides
GH_ParamManager.HideParameter(Int32).)
| Register_2DIntervalParam(String,
String,
String)|
Register a new two-dimensional OnInterval parameter
| Register_2DIntervalParam(String,
String, String,
GH_ParamAccess)|
Register a new two-dimensional OnInterval parameter
| Register_ArcParam(String, String,
String)|
Register a new 3D arc parameter
| Register_ArcParam(String, String,
String,
GH_ParamAccess)|
Register a new 3D arc parameter
| Register_BooleanParam(String,
String,
String)|
Register a new Boolean primitive parameter
| Register_BooleanParam(String,
String, String,
GH_ParamAccess)|
Register a new Boolean primitive parameter
| Register_BoxParam(String, String,
String)|
Register a new 3D box parameter
| Register_BoxParam(String, String,
String,
GH_ParamAccess)|
Register a new 3D box parameter
| Register_BRepParam(String, String,
String)|
Register a new 3D Brep parameter
| Register_BRepParam(String, String,
String,
GH_ParamAccess)|
Register a new 3D Brep parameter
| Register_CircleParam(String,
String,
String)|
Register a new 3D circle parameter
| Register_CircleParam(String,
String, String,
GH_ParamAccess)|
Register a new 3D circle parameter
| Register_ColourParam(String,
String,
String)|
Register a new Colour primitive parameter
| Register_ColourParam(String,
String, String,
GH_ParamAccess)|
Register a new Colour primitive parameter
| Register_ComplexParam(String,
String,
String)|
Register a new Complex primitive parameter
| Register_ComplexParam(String,
String, String,
GH_ParamAccess)|
Register a new Complex primitive parameter
| Register_CurveParam(String, String,
String)|
Register a new 3D curve parameter
| Register_CurveParam(String, String,
String,
GH_ParamAccess)|
Register a new 3D curve parameter
| Register_DoubleParam(String,
String,
String)|
Register a new Double primitive parameter
| Register_DoubleParam(String,
String, String,
GH_ParamAccess)|
Register a new Double primitive parameter
| Register_FieldParam(String, String,
String)|
Register a new field parameter
| Register_FieldParam(String, String,
String,
GH_ParamAccess)|
Register a new field parameter
| Register_GenericParam(String,
String,
String)|
Register a new Generic (Object) parameter
| Register_GenericParam(String,
String, String,
GH_ParamAccess)|
Register a new Generic (Object) parameter
| Register_GeometryParam(String,
String,
String)|
Register a new 3D geometry parameter
| Register_GeometryParam(String,
String, String,
GH_ParamAccess)|
Register a new 3D geometry parameter
| Register_GroupParam(String, String,
String)|
Register a new geometric group parameter
| Register_GroupParam(String, String,
String,
GH_ParamAccess)|
Register a new geometric group parameter
| Register_IntegerParam(String,
String,
String)|
Register a new Integer primitive parameter
| Register_IntegerParam(String,
String, String,
GH_ParamAccess)|
Register a new Integer primitive parameter
| Register_IntervalParam(String,
String,
String)|
Register a new Interval parameter
| Register_IntervalParam(String,
String, String,
GH_ParamAccess)|
Register a new Interval parameter
| Register_LineParam(String, String,
String)|
Register a new 3D line parameter
| Register_LineParam(String, String,
String,
GH_ParamAccess)|
Register a new 3D line parameter
| Register_MatrixParam(String,
String,
String)|
Register a new matrix parameter
| Register_MatrixParam(String,
String, String,
GH_ParamAccess)|
Register a new matrix parameter
| Register_MeshFaceParam(String,
String,
String)|
Register a new 3D Mesh face parameter
| Register_MeshFaceParam(String,
String, String,
GH_ParamAccess)|
Register a new 3D Mesh face parameter
| Register_MeshParam(String, String,
String)|
Register a new 3D Mesh parameter
| Register_MeshParam(String, String,
String,
GH_ParamAccess)|
Register a new 3D Mesh parameter
| Register_PathParam(String, String,
String)|
Register a new Data Structure path parameter
| Register_PathParam(String, String,
String,
GH_ParamAccess)|
Register a new Data Structure path parameter
| Register_PlaneParam(String, String,
String)|
Register a new 3D plane parameter
| Register_PlaneParam(String, String,
String,
GH_ParamAccess)|
Register a new 3D plane parameter
| Register_PointParam(String, String,
String)|
Register a new 3D point parameter
| Register_PointParam(String, String,
String,
GH_ParamAccess)|
Register a new 3D point parameter
| Register_RectangleParam(String,
String,
String)|
Register a new 3D rectangle parameter
| Register_RectangleParam(String,
String, String,
GH_ParamAccess)|
Register a new 3D rectangle parameter
| Register_StringParam(String,
String,
String)|
Register a new String primitive parameter
| Register_StringParam(String,
String, String,
GH_ParamAccess)|
Register a new String primitive parameter
| Register_SurfaceParam(String,
String,
String)|
Register a new 3D surface parameter
| Register_SurfaceParam(String,
String, String,
GH_ParamAccess)|
Register a new 3D surface parameter
| Register_TransformParam(String,
String,
String)|
Register a new Transform parameter
| Register_TransformParam(String,
String, String,
GH_ParamAccess)|
Register a new Transform parameter
| Register_VectorParam(String,
String,
String)|
Register a new 3D vector parameter
| Register_VectorParam(String,
String, String,
GH_ParamAccess)|
Register a new 3D vector parameter
|
RegisterParam(IGH_Param)|
Generic parameter registration. This class provides methods to register
standard parameters, but if you have a special type you're in charge of
setting it all up yourself.
| RegisterParam(IGH_Param,
GH_ParamAccess)|
Generic parameter registration. This class provides methods to register
standard parameters, but if you have a special type you're in charge of
setting it all up yourself.
| RegisterParam(IGH_Param, String,
String,
String)|
Generic parameter registration. This class provides methods to register
standard parameters, but if you have a special type you're in charge of
setting it all up yourself.
| RegisterParam(IGH_Param, String,
String, String,
GH_ParamAccess)|
Generic parameter registration. This class provides methods to register
standard parameters, but if you have a special type you're in charge of
setting it all up yourself.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com