---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Model_ModelLayer.htm
scraped_at: 2025-09-08T16:24:16.339641
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Model](../html/N_Grasshopper_Rhinoceros_Model.htm
"Grasshopper.Rhinoceros.Model")

[ModelLayer Class](../html/T_Grasshopper_Rhinoceros_Model_ModelLayer.htm
"ModelLayer Class")

[ModelLayer Constructor
](../html/Overload_Grasshopper_Rhinoceros_Model_ModelLayer__ctor.htm
"ModelLayer Constructor ")

[ModelLayer
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Model_ModelLayer.htm
"ModelLayer Properties")

[ModelLayer
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Model_ModelLayer.htm
"ModelLayer Methods")

[ModelLayer Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Model_ModelLayer.htm
"ModelLayer Type Conversions")

!Click or drag to
resize

# ModelLayer Class

---

Represents a Rhino model layer. Wraps the functionality of the Layer type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.RhinocerosModelComponentContent
Grasshopper.Rhinoceros.ModelModelLayer

**Namespace:**
Grasshopper.Rhinoceros.Model
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelLayer : ModelComponentContent,
    	IGH_BakeAwareData

    Public NotInheritable Class ModelLayer
    	Inherits ModelComponentContent
    	Implements IGH_BakeAwareData

The ModelLayer type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelLayer| Initializes
a new instance of the ModelLayer class
|
ModelLayer(ModelLayerAttributes)|
Initializes a new instance of the ModelLayer class
|
ModelLayer(Guid)|
Initializes a new instance of the ModelLayer class
|
ModelLayer(Layer)|
Initializes a new instance of the ModelLayer class
Top

Properties

| Name| Description
---|---|---
|
DisplayColor|
|
DraftingColor|
|
Hidden|
|
HiddenOnModel|
|
HiddenOnNewDetail|
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
Linetype|
|
LineWeight|
|
Locked|
|
Material|
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
!Static
member|
Unset|
|
UserText|
(Inherited from
ModelComponentContent.)
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelLayerAttributes to
ModelLayer)|
!Static
member| (Layer to
ModelLayer)|
!Static
member| (String to
ModelLayer)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Model Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com