---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Documentation_GH_Link.htm
scraped_at: 2025-09-08T16:11:58.137685
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Documentation](../html/N_Grasshopper_Documentation.htm
"Grasshopper.Documentation")

[GH_Link Class](../html/T_Grasshopper_Documentation_GH_Link.htm "GH_Link
Class")

[GH_Link
Properties](../html/Properties_T_Grasshopper_Documentation_GH_Link.htm
"GH_Link Properties")

[GH_Link Methods](../html/Methods_T_Grasshopper_Documentation_GH_Link.htm
"GH_Link Methods")

!Click or drag to
resize

# GH_Link Class

---

Represents a link to another location in the Help or some external address.

Inheritance Hierarchy

SystemObject
Grasshopper.DocumentationGH_Link

**Namespace:** Grasshopper.Documentation
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Link : IGH_Content

    Public Class GH_Link
    	Implements IGH_Content

The GH_Link type exposes the following members.

Properties

| Name| Description
---|---|---
|
Destination|  Gets the
link target.
|
IsSharedLink|  Gets
whether this link is a shared link. A shared link should not have text but it
should have a non-empty LinkId.
|
LinkId|  Gets the link ID.
The link ID is only used for shared links.
|
Target|  Gets the link type.
|
Text|  Gets the list text.
|
Tooltip|  Gets the link
tooltip text.
Top

Methods

| Name| Description
---|---|---
|
CreateExternalLink(String,
String)|
|
CreateExternalLink(String, String,
String)|
|
CreateGlossaryLink(String)|
|
CreateGlossaryLink(String,
String)|
|
CreateSharedLink(String,
String)|
|
CreateSharedLink(String, String,
String)|
|
CreateTopicLink(String,
String)|
|
CreateTopicLink(String, String,
String)|
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

See Also

#### Reference

Grasshopper.Documentation Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com