---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_Alias.htm
scraped_at: 2025-09-08T16:15:18.003697
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

GH_Alias Class

[GH_Alias Constructor ](../html/Overload_Grasshopper_Kernel_GH_Alias__ctor.htm
"GH_Alias Constructor ")

[GH_Alias Properties](../html/Properties_T_Grasshopper_Kernel_GH_Alias.htm
"GH_Alias Properties")

[GH_Alias Methods](../html/Methods_T_Grasshopper_Kernel_GH_Alias.htm "GH_Alias
Methods")

!Click or drag to
resize

# GH_Alias Class

---

Represents a single alias|target combo.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_Alias

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Alias : IComparable<GH_Alias>

    Public Class GH_Alias
    	Implements IComparable(Of GH_Alias)

The GH_Alias type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Alias| Initializes a new
instance of the GH_Alias class
|
GH_Alias(GH_Alias)| Initializes a
new instance of the GH_Alias class
| GH_Alias(String,
Guid)| Initializes a new instance
of the GH_Alias class
Top

Properties

| Name| Description
---|---|---
|
Alias|  Gets or sets the alias
string.
|
Target|  Gets or sets the alias
target.
Top

Methods

| Name| Description
---|---|---
|
AliasToString|
|
CompareTo|
|
StringToAlias|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com