---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_InstanceReference.htm
scraped_at: 2025-09-08T16:20:48.456020
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_InstanceReference
Class](../html/T_Grasshopper_Kernel_Types_GH_InstanceReference.htm
"GH_InstanceReference Class")

[GH_InstanceReference Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_InstanceReference__ctor.htm
"GH_InstanceReference Constructor ")

[GH_InstanceReference
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_InstanceReference.htm
"GH_InstanceReference Properties")

[GH_InstanceReference
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_InstanceReference.htm
"GH_InstanceReference Methods")

[GH_InstanceReference
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_InstanceReference.htm
"GH_InstanceReference Fields")

!Click or drag to
resize

# GH_InstanceReference Class

---

Represents block instance reference. Wraps the functionality of the
InstanceReferenceGeometry type.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooInstanceReferenceGeometry
Grasshopper.Kernel.TypesGH_GeometricGooInstanceReferenceGeometry
Grasshopper.Kernel.TypesGH_InstanceReference

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_InstanceReference : GH_GeometricGoo<InstanceReferenceGeometry>,
    	IGH_BakeAwareData, IGH_PreviewData, IGH_RenderAwareData

    Public Class GH_InstanceReference
    	Inherits GH_GeometricGoo(Of InstanceReferenceGeometry)
    	Implements IGH_BakeAwareData, IGH_PreviewData, IGH_RenderAwareData

The GH_InstanceReference type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_InstanceReference|
Default constructor, creates an invalid instance reference.
|
GH_InstanceReference(GH_InstanceReference)|
Create a duplicate of another GH_InstanceReference. This constructor also
copies reference data.
|
GH_InstanceReference(Guid)|
Create a new reference to a Rhino instance reference with the specified ID.
|
GH_InstanceReference(InstanceReferenceGeometry)|
Create a new reference to a Rhino instance reference with the specified ID.
|
GH_InstanceReference(Transform)|
Create a duplicate of an existing instance reference.
|
GH_InstanceReference(InstanceReferenceGeometry,
ModelInstanceDefinition)|
Create a new reference to a Rhino instance reference with the specified ID.
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
(Overrides
GH_GeometricGooTBoundingbox.)
|
ClippingBox|
|
InstanceDefinition|
|
IsGeometryLoaded|
Gets the load state of this instance reference object. The instance reference
is considered to be loaded when the local instance is not null.  (Overrides
GH_GeometricGooTIsGeometryLoaded.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Overrides
GH_GeometricGooTIsReferencedGeometry.)
|
IsValid|  Gets
the validity of this instance reference. If the instance reference is
referenced but cannot be loaded, the instance reference is not valid.
(Overrides
GH_GeometricGooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
ModelTransform|
|
ReferenceID|
(Overrides
GH_GeometricGooTReferenceID.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|
(Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets
the value of this type. Note that if the type has a ReferenceID this value
might get destroyed in the future.  (Inherited from
GH_GeometricGooT.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
|
CastFrom|
Remote to Local caster function. This stuff is complex, don't concern yourself
with casting logic.  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|
Local to Remote caster function. This stuff is complex, don't concern yourself
with casting logic.  (Overrides
GH_GeometricGooTCastToQ(Q).)
|
ClearCaches|
Clears all volatile caches for this instance. The boundingbox is cleared, and
if the instance reference is referenced, the local instance of the instance
reference is erased.  (Overrides
GH_GeometricGooTClearCaches.)
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|
(Overrides
GH_GeometricGooTDuplicate.)
|
DuplicateGeometry|
Create a duplicate of this GH_InstanceReference.  (Overrides
GH_GeometricGooTDuplicateGeometry.)
|
DuplicateInstanceReference|
Create a duplicate of this GH_InstanceReference.
|
EmitProxy|
(Overrides
GH_GeometricGooTEmitProxy.)
|
GetBoundingBox|
(Overrides
GH_GeometricGooTGetBoundingBox(Transform).)
|
LoadGeometry|
If the geometry is referenced and not yet loaded, attempts to load the
geometry.  (Overrides
GH_GeometricGooTLoadGeometry.)
|
LoadGeometry(RhinoDoc)|
If the instance reference is referenced and not yet loaded, attempts to load
the instance reference.  (Overrides
GH_GeometricGooTLoadGeometry(RhinoDoc).)
|
Morph|
(Overrides
GH_GeometricGooTMorph(SpaceMorph).)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|
Format the instance reference using default grasshopper formatting logic.
(Overrides
GH_GooTToString.)
|
Transform|
(Overrides
GH_GeometricGooTTransform(Transform).)
|
Write|
(Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com