---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Geometry_SpatialTrees_Index3d_1.htm
scraped_at: 2025-09-08T16:19:53.206143
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Geometry.SpatialTrees](../html/N_Grasshopper_Kernel_Geometry_SpatialTrees.htm
"Grasshopper.Kernel.Geometry.SpatialTrees")

[Index3d(T)
Class](../html/T_Grasshopper_Kernel_Geometry_SpatialTrees_Index3d_1.htm
"Index3d\(T\) Class")

[Index3d(T) Constructor
](../html/M_Grasshopper_Kernel_Geometry_SpatialTrees_Index3d_1__ctor.htm
"Index3d\(T\) Constructor ")

[Index3d(T)
Properties](../html/Properties_T_Grasshopper_Kernel_Geometry_SpatialTrees_Index3d_1.htm
"Index3d\(T\) Properties")

[Index3d(T)
Methods](../html/Methods_T_Grasshopper_Kernel_Geometry_SpatialTrees_Index3d_1.htm
"Index3d\(T\) Methods")

!Click or drag to
resize

# Index3dT Class

---

Represents an element index within a Tree3d instance.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.Geometry.SpatialTreesIndex3dT

**Namespace:**
Grasshopper.Kernel.Geometry.SpatialTrees
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class Index3d<T> : IComparable<Index3d<T>>

    Public Class Index3d(Of T)
    	Implements IComparable(Of Index3d(Of T))

#### Type Parameters

T

The Index3dT type exposes the following members.

Constructors

| Name| Description
---|---|---
|
Index3dT|
Initializes a new instance of the Index3dT class
Top

Properties

| Name| Description
---|---|---
|
GlobalIndex|
Gets the item index within the tree global list.
|
Item|  Gets
the actual item.
|
LocalIndex|
Gets the index within the node index list.
|
Node|  Gets
the node of the tree in which this element is stored.
Top

Methods

| Name| Description
---|---|---
|
CompareTo|
Top

See Also

#### Reference

Grasshopper.Kernel.Geometry.SpatialTrees
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com