---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_NamedView.htm
scraped_at: 2025-09-08T16:14:38.847248
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_NamedView Class](../html/T_Grasshopper_GUI_Canvas_GH_NamedView.htm
"GH_NamedView Class")

[GH_NamedView Constructor
](../html/Overload_Grasshopper_GUI_Canvas_GH_NamedView__ctor.htm "GH_NamedView
Constructor ")

[GH_NamedView
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_GH_NamedView.htm
"GH_NamedView Properties")

[GH_NamedView
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_NamedView.htm
"GH_NamedView Methods")

[GH_NamedView Events](../html/Events_T_Grasshopper_GUI_Canvas_GH_NamedView.htm
"GH_NamedView Events")

!Click or drag to
resize

# GH_NamedView Class

---

Named views are used both to store named views but also to allow smooth
programmatic canvas navigation.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_NamedView

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_NamedView : GH_ISerializable

    Public Class GH_NamedView
    	Implements GH_ISerializable

The GH_NamedView type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_NamedView|  Create a
default named view.
| GH_NamedView(Rectangle,
RectangleF)|  Create a new
view useful for box-fit transitions.
| GH_NamedView(GH_Viewport, Point,
PointF)|  Create a new
view useful for point match transitions.
| GH_NamedView(GH_Viewport,
Rectangle, PointF)|
Create a new view useful for point inclusion transitions.
| GH_NamedView(String, PointF,
Single, GH_NamedViewType)|
Create a new named view.
Top

Properties

| Name| Description
---|---|---
|
Name|  Gets or sets the name
of the view.
|
Point|  Gets or sets the
anchor point of the named view.
|
Type|  Gets or sets a value
indicating whether the anchor point represents the target or the center.
|
Zoom|  Gets or sets the zoom
factor of the named view.
Top

Methods

| Name| Description
---|---|---
|
LoadFromViewport|
Create a named view from a viewport.
|
Read|
|
SetToViewport(GH_Canvas)|
Set the named view to the canvas viewport and redraw the canvas.
|
SetToViewport(GH_Viewport)|
Set the named view to a viewport.
| SetToViewport(GH_Canvas,
Int32)|  Animates
a view transition.
|
Write|
Top

Events

| Name| Description
---|---|---
|
SmoothFrame|  This
event is raised during smooth animations.
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com