---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_GHXHarvester.htm
scraped_at: 2025-09-08T16:16:56.427716
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_GHXHarvester Class](../html/T_Grasshopper_Kernel_GH_GHXHarvester.htm
"GH_GHXHarvester Class")

[GH_GHXHarvester
Methods](../html/Methods_T_Grasshopper_Kernel_GH_GHXHarvester.htm
"GH_GHXHarvester Methods")

!Click or drag to
resize

# GH_GHXHarvester Class

---

Provides static methods for harvesting data from GHX and GH files.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_GHXHarvester

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_GHXHarvester

    Public NotInheritable Class GH_GHXHarvester

Methods

| Name| Description
---|---|---
|
HarvestBoundingBoxes(GH_Archive)|
Harvest all attribute bounding boxes from a GHX/GH archive.
|
HarvestBoundingBoxes(GH_IReader)|
Harvest all attribute bounding boxes from a GHX/GH node.
|
HarvestBoundingBoxes(String)|
Harvest all attribute bounding boxes from a GHX/GH archive.
|
HarvestPivots(GH_Archive)|
Harvest all attribute pivots from a GHX/GH archive.
|
HarvestPivots(GH_IReader)|
Harvest all attribute pivots from a GHX/GH node.
|
HarvestPivots(String)|
Harvest all attribute pivots from a GHX/GH archive.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com