---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_TooltipDisplayEventArgs.htm
scraped_at: 2025-09-08T16:13:14.450422
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_TooltipDisplayEventArgs
Class](../html/T_Grasshopper_GUI_GH_TooltipDisplayEventArgs.htm
"GH_TooltipDisplayEventArgs Class")

[GH_TooltipDisplayEventArgs
Properties](../html/Properties_T_Grasshopper_GUI_GH_TooltipDisplayEventArgs.htm
"GH_TooltipDisplayEventArgs Properties")

!Click or drag to
resize

# GH_TooltipDisplayEventArgs Class

---

Event arguments used in the Tooltip Component.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.GUIGH_TooltipDisplayEventArgs

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_TooltipDisplayEventArgs : EventArgs

    Public NotInheritable Class GH_TooltipDisplayEventArgs
    	Inherits EventArgs

The GH_TooltipDisplayEventArgs type exposes the following members.

Properties

| Name| Description
---|---|---
|
Control|  Gets the
control for whom the tooltip is about to be displayed.
|
Description|
Gets or sets the description of the tooltip. This field is optional.
|
Diagram|  Gets or
sets the image that is displayed in the details section of the tooltip. This
field is optional, but when it is defined, the Description property is
ignored.
|
Icon|  Gets or sets
the icon that is displayed in the upper left hand corner of the tooltip. This
field is optional.
|
Point|  Gets the
point in control coordinates for the tooltip locus.
|
Region|  Gets or
sets the active region (in control coordinates) for this tooltip. Once a
tooltip is shown inside the region, the tooltip will 'stick' to the mouse for
as long as the mouse remains within this region. By default the region is set
to Rectangle.Empty, which indicates that region tracking is not used for this
tooltip.
|
Text|  Gets or sets
the text of the tooltip. If you do not set the Text property, you must set the
Title property or the tooltip will not be shown.
|
Title|  Gets or sets
the title of the tooltip. If you do not set the Title property, you must set
the Text property or the tooltip will not be shown.
|
Valid|  Gets whether
there is currently enough data to display a tooltip.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com