---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Undo_Actions_GH_WireAction.htm
scraped_at: 2025-09-08T16:22:23.821386
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Undo.Actions](../html/N_Grasshopper_Kernel_Undo_Actions.htm
"Grasshopper.Kernel.Undo.Actions")

[GH_WireAction
Class](../html/T_Grasshopper_Kernel_Undo_Actions_GH_WireAction.htm
"GH_WireAction Class")

[GH_WireAction Constructor
](../html/M_Grasshopper_Kernel_Undo_Actions_GH_WireAction__ctor.htm
"GH_WireAction Constructor ")

[GH_WireAction
Properties](../html/Properties_T_Grasshopper_Kernel_Undo_Actions_GH_WireAction.htm
"GH_WireAction Properties")

[GH_WireAction
Methods](../html/Methods_T_Grasshopper_Kernel_Undo_Actions_GH_WireAction.htm
"GH_WireAction Methods")

!Click or drag to
resize

# GH_WireAction Class

---

Records any change to the input wires of a given parameter.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.UndoGH_UndoAction
Grasshopper.Kernel.Undo.ActionsGH_WireAction

**Namespace:**
Grasshopper.Kernel.Undo.Actions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_WireAction : GH_UndoAction

    Public Class GH_WireAction
    	Inherits GH_UndoAction

The GH_WireAction type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_WireAction|
Initializes a new instance of the GH_WireAction class
Top

Properties

| Name| Description
---|---|---
|
ExpiresDisplay|
Override this property if you want the Rhino viewport display to refresh upon
undo completion.  (Inherited from
GH_UndoAction.)
|
ExpiresSolution|
(Overrides
GH_UndoActionExpiresSolution.)
|
State|  (Inherited from
GH_UndoAction.)
Top

Methods

| Name| Description
---|---|---
|
Internal_Redo|
(Overrides
GH_UndoActionInternal_Redo(GH_Document).)
|
Internal_Undo|
(Overrides
GH_UndoActionInternal_Undo(GH_Document).)
|
Read|  (Inherited from
GH_UndoAction.)
|
Redo|  (Inherited from
GH_UndoAction.)
|
Undo|  (Inherited from
GH_UndoAction.)
|
Write|  (Inherited from
GH_UndoAction.)
Top

See Also

#### Reference

Grasshopper.Kernel.Undo.Actions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com