---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_DetailView.htm
scraped_at: 2025-09-08T16:20:31.362088
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_DetailView Class](../html/T_Grasshopper_Kernel_Types_GH_DetailView.htm
"GH_DetailView Class")

[GH_DetailView Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_DetailView__ctor.htm
"GH_DetailView Constructor ")

[GH_DetailView
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_DetailView.htm
"GH_DetailView Properties")

[GH_DetailView
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_DetailView.htm
"GH_DetailView Methods")

[GH_DetailView
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_DetailView.htm
"GH_DetailView Fields")

!Click or drag to
resize

# GH_DetailView Class

---

Represents a Rhino model detail view. Wraps the functionality of the
DetailView type.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooDetailView
Grasshopper.Kernel.TypesGH_GeometricGooDetailView
Grasshopper.Kernel.TypesGH_DetailView

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DetailView : GH_GeometricGoo<DetailView>

    Public Class GH_DetailView
    	Inherits GH_GeometricGoo(Of DetailView)

The GH_DetailView type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DetailView|  Default
constructor, creates an invalid detail view.
|
GH_DetailView(DetailView)|
Create a duplicate of an existing detail view.
|
GH_DetailView(GH_DetailView)|
Create a duplicate of another GH_DetailView. This constructor also copies
reference data.
|
GH_DetailView(Guid)|
Create a new referenced detail view that references a Rhino detail view with
the specified ID.
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
(Overrides
GH_GeometricGooTBoundingbox.)
|
IsGeometryLoaded|
Gets the load state of this detail view object. The detail view is considered
to be loaded when the local detail view instance is not null.  (Overrides
GH_GeometricGooTIsGeometryLoaded.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  Gets the
validity of this detail view. If the detail view is referenced but cannot be
loaded, the detail view is not valid.  (Overrides
GH_GeometricGooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
ReferenceID|
(Overrides
GH_GeometricGooTReferenceID.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  (Overrides
GH_GeometricGooTValue.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|
Attempt a cast from generic object.  (Inherited from
GH_GeometricGooT.)
|
CastToT(T)|
(Overrides
GH_GeometricGooTCastToQ(Q).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
ClearCaches|
Clears all volatile caches for this instance. The boundingbox is cleared, and
if the detail view is referenced, the local instance of the detail view is
erased.  (Overrides
GH_GeometricGooTClearCaches.)
|
Duplicate|
(Overrides
GH_GeometricGooTDuplicate.)
|
DuplicateDetailView|
Create a duplicate of this hatch.
|
DuplicateGeometry|
Create a duplicate of this hatch.  (Overrides
GH_GeometricGooTDuplicateGeometry.)
|
EmitProxy|
Create a new proxy for this instance. Return Null if this class does not
support proxies.  (Inherited from
GH_GeometricGooT.)
|
GetBoundingBox|
(Overrides
GH_GeometricGooTGetBoundingBox(Transform).)
|
LoadGeometry|  If
the geometry is referenced and not yet loaded, attempts to load the geometry.
(Overrides
GH_GeometricGooTLoadGeometry.)
|
LoadGeometry(RhinoDoc)|
If the detail view is referenced and not yet loaded, attempts to load the
detail view.  (Overrides
GH_GeometricGooTLoadGeometry(RhinoDoc).)
|
Morph|  (Overrides
GH_GeometricGooTMorph(SpaceMorph).)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|  Format the
detail view using default grasshopper formatting logic.  (Overrides
GH_GooTToString.)
|
Transform|
(Overrides
GH_GeometricGooTTransform(Transform).)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com