---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_CanvasDropTargetValidator.htm
scraped_at: 2025-09-08T16:14:27.801452
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_CanvasDropTargetValidator
Class](../html/T_Grasshopper_GUI_Canvas_GH_CanvasDropTargetValidator.htm
"GH_CanvasDropTargetValidator Class")

[GH_CanvasDropTargetValidator Constructor
](../html/M_Grasshopper_GUI_Canvas_GH_CanvasDropTargetValidator__ctor.htm
"GH_CanvasDropTargetValidator Constructor ")

[GH_CanvasDropTargetValidator
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_GH_CanvasDropTargetValidator.htm
"GH_CanvasDropTargetValidator Properties")

[GH_CanvasDropTargetValidator
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_CanvasDropTargetValidator.htm
"GH_CanvasDropTargetValidator Methods")

!Click or drag to
resize

# GH_CanvasDropTargetValidator Class

---

Utility validator for restricting component creation.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_CanvasValidator
Grasshopper.GUI.CanvasGH_CanvasDropTargetValidator

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_CanvasDropTargetValidator : GH_CanvasValidator

    Public Class GH_CanvasDropTargetValidator
    	Inherits GH_CanvasValidator

The GH_CanvasDropTargetValidator type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_CanvasDropTargetValidator|
Initializes a new instance of the GH_CanvasDropTargetValidator class
Top

Properties

| Name| Description
---|---|---
|
Canvas|  Gets the
canvas this validator is associated with.  (Inherited from
GH_CanvasValidator.)
|
Document|  Gets
the document (if it exists) that is currently loaded in the canvas.
(Inherited from
GH_CanvasValidator.)
|
DropDelegate|
Gets or sets the delegate to be invoked when a component is dropped inside the
dropregion.
|
DropID|
Gets or sets the ID for the allowed component.
|
DropRegion|
Gets or sets the dropregion for this validator. Regions are cloned so you can
dispose of the original immedately after assignment.
|
DropText|
Gets or sets the text to display.
Top

Methods

| Name| Description
---|---|---
|
AddedToCanvas|
(Overrides
GH_CanvasValidatorAddedToCanvas(GH_Canvas).)
|
AppliesToDocument|
(Overrides
GH_CanvasValidatorAppliesToDocument(Guid).)
|
CanAcceptObject|
(Overrides
GH_CanvasValidatorCanAcceptObject(Guid).)
|
CanCreateObject|
(Overrides GH_CanvasValidatorCanCreateObject(Guid,
PointF).)
|
CanCreateWire|
(Inherited from
GH_CanvasValidator.)
|
CanDeleteObject|
(Overrides
GH_CanvasValidatorCanDeleteObject(IGH_DocumentObject).)
|
CanDeleteWire|
(Inherited from
GH_CanvasValidator.)
|
CanDragObject|
(Overrides GH_CanvasValidatorCanDragObject(IGH_DocumentObject,
PointF).)
|
CanNavigateCanvas|
(Inherited from
GH_CanvasValidator.)
|
CanShowCanvasMenu|
(Overrides
GH_CanvasValidatorCanShowCanvasMenu(PointF).)
|
CanShowComponentSearchBox|
(Overrides
GH_CanvasValidatorCanShowComponentSearchBox(PointF).)
|
CanShowObjectMenu|
(Inherited from
GH_CanvasValidator.)
|
RemovedFromCanvas|
(Overrides
GH_CanvasValidatorRemovedFromCanvas(GH_Canvas).)
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com