---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Transform.htm
scraped_at: 2025-09-08T16:21:39.673964
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Transform Class](../html/T_Grasshopper_Kernel_Types_GH_Transform.htm
"GH_Transform Class")

[GH_Transform Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Transform__ctor.htm
"GH_Transform Constructor ")

[GH_Transform
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Transform.htm
"GH_Transform Properties")

[GH_Transform
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Transform.htm
"GH_Transform Methods")

[GH_Transform
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Transform.htm
"GH_Transform Fields")

!Click or drag to
resize

# GH_Transform Class

---

Represents a collection of transformations.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooTransform
Grasshopper.Kernel.TypesGH_Transform

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Transform : GH_Goo<Transform>

    Public Class GH_Transform
    	Inherits GH_Goo(Of Transform)

The GH_Transform type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Transform| Initializes
a new instance of the GH_Transform class
|
GH_Transform(GH_Transform)|
Initializes a new instance of the GH_Transform class
|
GH_Transform(ITransform)|
Initializes a new instance of the GH_Transform class
|
GH_Transform(Transform)|
Initializes a new instance of the GH_Transform class
Top

Properties

| Name| Description
---|---|---
|
CompoundTransforms|
Gets the internal set of transforms. If you modify the compound
transformations, you _must_ call ClearCaches().
|
IsValid|  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  (Overrides
GH_GooTValue.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToQ(Q)|
(Overrides
GH_GooTCastToQ(Q).)
|
ClearCaches|  Erase
the compound transformation caches.
|
Duplicate|
(Overrides
GH_GooTDuplicate.)
|
EmitProxy|  Returns a
proxy that represents this transform. Do not call this function unless you're
(Overrides
GH_GooTEmitProxy.)
|
GetInverse|
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com