---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_PointCloud_PointCloudProxy.htm
scraped_at: 2025-09-08T16:21:20.561556
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_PointCloud.PointCloudProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_PointCloud_PointCloudProxy.htm
"GH_PointCloud.PointCloudProxy Class")

[GH_PointCloud.PointCloudProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_PointCloud_PointCloudProxy__ctor.htm
"GH_PointCloud.PointCloudProxy Constructor ")

[PointCloudProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_PointCloud_PointCloudProxy.htm
"PointCloudProxy Properties")

[PointCloudProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_PointCloud_PointCloudProxy.htm
"PointCloudProxy Methods")

!Click or drag to
resize

# GH_PointCloudPointCloudProxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_PointCloud
Grasshopper.Kernel.TypesGH_PointCloudPointCloudProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class PointCloudProxy : GH_GooProxy<GH_PointCloud>

    Public Class PointCloudProxy
    	Inherits GH_GooProxy(Of GH_PointCloud)

The GH_PointCloudPointCloudProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PointCloudPointCloudProxy|
Initializes a new instance of the GH_PointCloudPointCloudProxy class
Top

Properties

| Name| Description
---|---|---
|
ContainsColors|
|
ContainsHiddenFlags|
|
ContainsNormals|
|
ContainsValues|
|
HiddenPointCount|
|
ObjectID|
|
PointCount|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com