---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_ResizeBorder.htm
scraped_at: 2025-09-08T16:14:46.885110
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_ResizeBorder Class](../html/T_Grasshopper_GUI_Canvas_GH_ResizeBorder.htm
"GH_ResizeBorder Class")

[GH_ResizeBorder Constructor
](../html/Overload_Grasshopper_GUI_Canvas_GH_ResizeBorder__ctor.htm
"GH_ResizeBorder Constructor ")

[GH_ResizeBorder
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_GH_ResizeBorder.htm
"GH_ResizeBorder Properties")

[GH_ResizeBorder
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_ResizeBorder.htm
"GH_ResizeBorder Methods")

!Click or drag to
resize

# GH_ResizeBorder Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_Border
Grasshopper.GUI.CanvasGH_ResizeBorder

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ResizeBorder : GH_Border

    Public Class GH_ResizeBorder
    	Inherits GH_Border

The GH_ResizeBorder type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ResizeBorder(GH_Border)|
Create a new instance of the GH_ResizeBorder class.
| GH_ResizeBorder(RectangleF,
GH_BorderTopology)|
Create a new instance of the GH_ResizeBorder class.
Top

Properties

| Name| Description
---|---|---
|
Anchor|  Gets or sets
the anchor point for sizing operations. This point is determined automatically
when you call Setup(), however you can alter it afterwards if you want.
|
Region|  Gets the shape of
the border.  (Inherited from
GH_Border.)
|
Size_Cursor|  Gets the
cursor associated with this border.  (Inherited from
GH_Border.)
|
Topology|  Gets the type of
border.  (Inherited from GH_Border.)
Top

Methods

| Name| Description
---|---|---
|
Contains|  Test a point for
border inclusion.  (Inherited from
GH_Border.)
| Setup(IGH_Attributes,
PointF)|  Set up a new
sizing operation.
| Setup(IGH_Attributes, PointF,
SizeF)|  Set up a new
sizing operation.
| Setup(RectangleF, PointF,
PointF)|  Set up a new
sizing operation.
| Setup(IGH_Attributes, PointF,
SizeF, SizeF)|  Set up
a new sizing operation.
| Setup(RectangleF, PointF, PointF,
SizeF)|  Set up a new
sizing operation.
| Setup(RectangleF, PointF, PointF,
SizeF, SizeF)|  Set up
a new sizing operation.
|
Solve|  Solve a resizing
step.
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com