---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_IGH_CanvasValidator.htm
scraped_at: 2025-09-08T16:14:52.899190
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[IGH_CanvasValidator
Interface](../html/T_Grasshopper_GUI_Canvas_IGH_CanvasValidator.htm
"IGH_CanvasValidator Interface")

[IGH_CanvasValidator
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_IGH_CanvasValidator.htm
"IGH_CanvasValidator Methods")

!Click or drag to
resize

# IGH_CanvasValidator Interface

---

'Interface used for limiting a collection of typical actions on the canvas. Do
not implement this interface directly if you can help it, instead inherit from
GH_CanvasValidator.

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_CanvasValidator

    Public Interface IGH_CanvasValidator

The IGH_CanvasValidator type exposes the following members.

Methods

| Name| Description
---|---|---
|
AddedToCanvas|
This method will be called by the Canvas when this validator is added to it.
|
AppliesToDocument|
Test whether this validator applies to a specific document.
|
CanAcceptObject|
Validates whether a specific component can be accepted by the canvas at all.
|
CanCreateObject|
Validates whether a specific component may be inserted at a specific point.
|
CanCreateWire|
Validates whether a wire-operation can commence.
|
CanDeleteObject|
Validates whether a specific object can be deleted.
|
CanDeleteWire|
Validates whether a wire can be deleted.
|
CanDragObject|
Validates whether some components can be dragged.
|
CanNavigateCanvas|
Validates whether the canvas can be navigated (panning, zooming etc)
|
CanShowCanvasMenu|
Validates whether the canvas menus (both the radial and the old-fashioned one)
are allowed to pop up at a specific point.
|
CanShowComponentSearchBox|
Validates whether the double-click-component-search-window is allowed to pop
up at a specific point.
|
CanShowObjectMenu|
Validates whether the object menu can be shown.
|
RemovedFromCanvas|
This method will be called by the Canvas when this validator is removed from
it.
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com