---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_GeometryGroup_GH_GeometryGroupProxy.htm
scraped_at: 2025-09-08T16:20:42.395808
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_GeometryGroup.GH_GeometryGroupProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_GeometryGroup_GH_GeometryGroupProxy.htm
"GH_GeometryGroup.GH_GeometryGroupProxy Class")

[GH_GeometryGroup.GH_GeometryGroupProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_GeometryGroup_GH_GeometryGroupProxy__ctor.htm
"GH_GeometryGroup.GH_GeometryGroupProxy Constructor ")

[GH_GeometryGroupProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_GeometryGroup_GH_GeometryGroupProxy.htm
"GH_GeometryGroupProxy Properties")

[GH_GeometryGroupProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_GeometryGroup_GH_GeometryGroupProxy.htm
"GH_GeometryGroupProxy Methods")

!Click or drag to
resize

# GH_GeometryGroupGH_GeometryGroupProxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_GeometryGroup
Grasshopper.Kernel.TypesGH_GeometryGroupGH_GeometryGroupProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_GeometryGroupProxy : GH_GooProxy<GH_GeometryGroup>

    Public Class GH_GeometryGroupProxy
    	Inherits GH_GooProxy(Of GH_GeometryGroup)

The GH_GeometryGroupGH_GeometryGroupProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_GeometryGroupGH_GeometryGroupProxy|
Initializes a new instance of the GH_GeometryGroupGH_GeometryGroupProxy class
Top

Properties

| Name| Description
---|---|---
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
Top

Methods

| Name| Description
---|---|---
|
Construct|  Override
this method to supply a custom UI during proxy construction.  (Inherited from
GH_GooProxyT.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com