---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_ModelNamedView.htm
scraped_at: 2025-09-08T16:23:20.066075
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[ModelNamedView
Class](../html/T_Grasshopper_Rhinoceros_Display_ModelNamedView.htm
"ModelNamedView Class")

[ModelNamedView
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_ModelNamedView.htm
"ModelNamedView Properties")

[ModelNamedView
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_ModelNamedView.htm
"ModelNamedView Methods")

[ModelNamedView Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Display_ModelNamedView.htm
"ModelNamedView Type Conversions")

!Click or drag to
resize

# ModelNamedView Class

---

Represents a Rhino named view. Wraps a ViewInfo instance in the named views
table.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.Rhinoceros.DisplayModelNamedView

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

**Since:** 8.14

Syntax

C#

VB

Copy

    public sealed class ModelNamedView : ModelContent,
    	IGH_BakeAwareData

    Public NotInheritable Class ModelNamedView
    	Inherits ModelContent
    	Implements IGH_BakeAwareData

The ModelNamedView type exposes the following members.

Properties

| Name| Description
---|---|---
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelContentCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelNamedViewAttributes to
ModelNamedView)|
!Static
member| (ViewInfo to
ModelNamedView)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com