---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DocumentEventServer.htm
scraped_at: 2025-09-08T16:16:27.285251
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocumentEventServer
Class](../html/T_Grasshopper_Kernel_GH_DocumentEventServer.htm
"GH_DocumentEventServer Class")

[GH_DocumentEventServer Constructor
](../html/M_Grasshopper_Kernel_GH_DocumentEventServer__ctor.htm
"GH_DocumentEventServer Constructor ")

[GH_DocumentEventServer
Properties](../html/Properties_T_Grasshopper_Kernel_GH_DocumentEventServer.htm
"GH_DocumentEventServer Properties")

[GH_DocumentEventServer
Methods](../html/Methods_T_Grasshopper_Kernel_GH_DocumentEventServer.htm
"GH_DocumentEventServer Methods")

!Click or drag to
resize

# GH_DocumentEventServer Class

---

RhinoCommon only event server.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_DocumentEventServer

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DocumentEventServer : IGH_DebugDescription

    Public Class GH_DocumentEventServer
    	Implements IGH_DebugDescription

The GH_DocumentEventServer type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DocumentEventServer|
Create and register a new event server.
Top

Properties

| Name| Description
---|---|---
|
Enabled|  Gets or
sets the enabled state flag for this event watcher.
|
GuidTableRefCount|
Gets the number of stored ids in the Guid Table.
Top

Methods

| Name| Description
---|---|---
|
AppendToDebugLog|
|
ClearGuidTable|
Clear the entire ID table.
|
CreateGuidTable|
Create the entire ID table from scratch.
|
EnsureGuidTable|
Create the entire ID table if it doesn't exist yet.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com