---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_PreviewBoundary.htm
scraped_at: 2025-09-08T16:17:33.582012
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_PreviewBoundary Class](../html/T_Grasshopper_Kernel_GH_PreviewBoundary.htm
"GH_PreviewBoundary Class")

[GH_PreviewBoundary Constructor
](../html/M_Grasshopper_Kernel_GH_PreviewBoundary__ctor.htm
"GH_PreviewBoundary Constructor ")

[GH_PreviewBoundary
Properties](../html/Properties_T_Grasshopper_Kernel_GH_PreviewBoundary.htm
"GH_PreviewBoundary Properties")

[GH_PreviewBoundary
Methods](../html/Methods_T_Grasshopper_Kernel_GH_PreviewBoundary.htm
"GH_PreviewBoundary Methods")

!Click or drag to
resize

# GH_PreviewBoundary Class

---

A closed boundary for filtering previewed objects.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_PreviewBoundary

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PreviewBoundary : GH_ISerializable

    Public Class GH_PreviewBoundary
    	Implements GH_ISerializable

The GH_PreviewBoundary type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PreviewBoundary|
Create a new preview boundary.
Top

Properties

| Name| Description
---|---|---
|
Boundary|  Gets the
boundary region.
|
Limits|  Gets the limits
of the boundary.
|
Points|  Gets the array
of points this boundary was made from.
Top

Methods

| Name| Description
---|---|---
|
IsVisible|  Gets
whether a specific object is visible within this boundary.
|
Read|
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com