---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_RuleComplex.htm
scraped_at: 2025-09-08T16:19:11.012451
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_RuleComplex Class](../html/T_Grasshopper_Kernel_Data_GH_RuleComplex.htm
"GH_RuleComplex Class")

[GH_RuleComplex Constructor
](../html/M_Grasshopper_Kernel_Data_GH_RuleComplex__ctor.htm "GH_RuleComplex
Constructor ")

[GH_RuleComplex
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_RuleComplex.htm
"GH_RuleComplex Properties")

[GH_RuleComplex
Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_RuleComplex.htm
"GH_RuleComplex Methods")

!Click or drag to
resize

# GH_RuleComplex Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_RuleComplex

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RuleComplex : IGH_Rule

    Public Class GH_RuleComplex
    	Implements IGH_Rule

The GH_RuleComplex type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_RuleComplex|
Initializes a new instance of the GH_RuleComplex class
Top

Properties

| Name| Description
---|---|---
|
Kind|
|
Notation|
Top

Methods

| Name| Description
---|---|---
|
Apply|
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com