---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_PreviewArgs.htm
scraped_at: 2025-09-08T16:17:32.579529
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_PreviewArgs Class](../html/T_Grasshopper_Kernel_GH_PreviewArgs.htm
"GH_PreviewArgs Class")

[GH_PreviewArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_PreviewArgs.htm
"GH_PreviewArgs Properties")

!Click or drag to
resize

# GH_PreviewArgs Class

---

This class is passed to Objects that implement IGH_PreviewObject during
drawing operations.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_PreviewArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PreviewArgs : IGH_PreviewArgs

    Public Class GH_PreviewArgs
    	Implements IGH_PreviewArgs

The GH_PreviewArgs type exposes the following members.

Properties

| Name| Description
---|---|---
|
DefaultCurveThickness|
Gets the curve thickness as defined by the viewport display scheme.
|
Display|  Gets the Pipeline
that is being used to draw the current preview.
|
Document|  Gets the
Grasshopper document that is currently drawing the preview.
|
MeshingParameters|
Gets the meshing parameters to be used during meshing breps.
|
ShadeMaterial|  Gets
the document default material for unselected Faces.
|
ShadeMaterial_Selected|
Gets the document default material for selected Faces.
|
Viewport|  Gets the
Viewport in which the current preview is drawn.
|
WireColour|  Gets the
document default colour for unselected Wires.
|
WireColour_Selected|
Gets the document default colour for selected Wires.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com