---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_ModelDisplayMode.htm
scraped_at: 2025-09-08T16:23:18.079953
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[ModelDisplayMode
Class](../html/T_Grasshopper_Rhinoceros_Display_ModelDisplayMode.htm
"ModelDisplayMode Class")

[ModelDisplayMode Constructor
](../html/Overload_Grasshopper_Rhinoceros_Display_ModelDisplayMode__ctor.htm
"ModelDisplayMode Constructor ")

[ModelDisplayMode
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_ModelDisplayMode.htm
"ModelDisplayMode Properties")

[ModelDisplayMode
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_ModelDisplayMode.htm
"ModelDisplayMode Methods")

[ModelDisplayMode Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Display_ModelDisplayMode.htm
"ModelDisplayMode Type Conversions")

!Click or drag to
resize

# ModelDisplayMode Class

---

Represents a Rhino display mode. Wraps the functionality of the
DisplayModeDescription type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.Rhinoceros.DisplayModelDisplayMode

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelDisplayMode : ModelContent,
    	IGH_BakeAwareData

    Public NotInheritable Class ModelDisplayMode
    	Inherits ModelContent
    	Implements IGH_BakeAwareData

The ModelDisplayMode type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelDisplayMode|
Initializes a new instance of the ModelDisplayMode class
|
ModelDisplayMode(ModelDisplayModeAttributes)|
Initializes a new instance of the ModelDisplayMode class
|
ModelDisplayMode(DisplayModeDescription)|
Initializes a new instance of the ModelDisplayMode class
|
ModelDisplayMode(Guid)|
Initializes a new instance of the ModelDisplayMode class
Top

Properties

| Name| Description
---|---|---
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
!Static
member|
Unset|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Overrides
ModelContentTooltipString.)
|
ToString|
(Overrides
ModelContentToString.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelDisplayModeAttributes to
ModelDisplayMode)|
!Static
member| (DisplayModeDescription to
ModelDisplayMode)|
!Static
member| (Guid to
ModelDisplayMode)|
!Static
member| (String to
ModelDisplayMode)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com