---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_CanvasViewportChangedEventArgs.htm
scraped_at: 2025-09-08T16:14:31.809312
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_CanvasViewportChangedEventArgs
Class](../html/T_Grasshopper_GUI_Canvas_GH_CanvasViewportChangedEventArgs.htm
"GH_CanvasViewportChangedEventArgs Class")

[GH_CanvasViewportChangedEventArgs
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_GH_CanvasViewportChangedEventArgs.htm
"GH_CanvasViewportChangedEventArgs Properties")

!Click or drag to
resize

# GH_CanvasViewportChangedEventArgs Class

---

These arguments are used in the ViewportChanged event on GH_Canvas.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.GUI.CanvasGH_CanvasViewportChangedEventArgs

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_CanvasViewportChangedEventArgs : EventArgs

    Public Class GH_CanvasViewportChangedEventArgs
    	Inherits EventArgs

The GH_CanvasViewportChangedEventArgs type exposes the following members.

Properties

| Name| Description
---|---|---
|
Canvas|
Gets the Canvas whose viewport was changed.
|
Viewport|
Gets the new Viewport.
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com