---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Undo_GH_ArchivedUndoAction.htm
scraped_at: 2025-09-08T16:21:59.805640
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Undo](../html/N_Grasshopper_Kernel_Undo.htm
"Grasshopper.Kernel.Undo")

[GH_ArchivedUndoAction
Class](../html/T_Grasshopper_Kernel_Undo_GH_ArchivedUndoAction.htm
"GH_ArchivedUndoAction Class")

[GH_ArchivedUndoAction Constructor
](../html/M_Grasshopper_Kernel_Undo_GH_ArchivedUndoAction__ctor.htm
"GH_ArchivedUndoAction Constructor ")

[GH_ArchivedUndoAction
Properties](../html/Properties_T_Grasshopper_Kernel_Undo_GH_ArchivedUndoAction.htm
"GH_ArchivedUndoAction Properties")

[GH_ArchivedUndoAction
Methods](../html/Methods_T_Grasshopper_Kernel_Undo_GH_ArchivedUndoAction.htm
"GH_ArchivedUndoAction Methods")

[GH_ArchivedUndoAction
Fields](../html/Fields_T_Grasshopper_Kernel_Undo_GH_ArchivedUndoAction.htm
"GH_ArchivedUndoAction Fields")

!Click or drag to
resize

# GH_ArchivedUndoAction Class

---

Base class implementation for undo actions that require (de)serialization of
data.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.UndoGH_UndoAction
Grasshopper.Kernel.UndoGH_ArchivedUndoAction
Grasshopper.Kernel.Undo.ActionsGH_AddStateAction
Grasshopper.Kernel.Undo.ActionsGH_GenericObjectAction
Grasshopper.Kernel.Undo.ActionsGH_RemoveObjectAction
Grasshopper.Kernel.Undo.ActionsGH_RemoveStateAction

**Namespace:** Grasshopper.Kernel.Undo
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_ArchivedUndoAction : GH_UndoAction

    Public MustInherit Class GH_ArchivedUndoAction
    	Inherits GH_UndoAction

The GH_ArchivedUndoAction type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ArchivedUndoAction|
Initializes a new instance of the GH_ArchivedUndoAction class
Top

Properties

| Name| Description
---|---|---
|
ExpiresDisplay|
Override this property if you want the Rhino viewport display to refresh upon
undo completion.  (Inherited from
GH_UndoAction.)
|
ExpiresSolution|
Override this property if you want the Grasshopper solution to refresh upon
undo completion.  (Inherited from
GH_UndoAction.)
|
State|  (Inherited from
GH_UndoAction.)
Top

Methods

| Name| Description
---|---|---
|
Deserialize|
Deserializes the obj from the local archive.
|
Internal_Redo|
(Inherited from GH_UndoAction.)
|
Internal_Undo|
(Inherited from GH_UndoAction.)
|
Read|  (Overrides
GH_UndoActionRead(GH_IReader).)
|
Redo|  (Inherited from
GH_UndoAction.)
|
Serialize|
Serializes the obj into the local archive.
|
SerializeToByteArray|
Serializes the obj into the local archive.
|
Undo|  (Inherited from
GH_UndoAction.)
|
Write|
(Overrides
GH_UndoActionWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_data|
Internal data storage for serialized archives.
Top

See Also

#### Reference

Grasshopper.Kernel.Undo Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com