---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_FontControl.htm
scraped_at: 2025-09-08T16:12:35.326308
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_FontControl Class](../html/T_Grasshopper_GUI_GH_FontControl.htm
"GH_FontControl Class")

[GH_FontControl Constructor
](../html/M_Grasshopper_GUI_GH_FontControl__ctor.htm "GH_FontControl
Constructor ")

[GH_FontControl
Properties](../html/Properties_T_Grasshopper_GUI_GH_FontControl.htm
"GH_FontControl Properties")

[GH_FontControl Methods](../html/Methods_T_Grasshopper_GUI_GH_FontControl.htm
"GH_FontControl Methods")

!Click or drag to
resize

# GH_FontControl Class

---

Represents a control that offers both Font preview and Picking methods.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsUserControl
Grasshopper.GUIGH_FontControl

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_FontControl : UserControl

    Public Class GH_FontControl
    	Inherits UserControl

The GH_FontControl type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_FontControl| Initializes a
new instance of the GH_FontControl class
Top

Properties

| Name| Description
---|---|---
|
AllowFamilyOverride|
|
AllowSizeOverride|
|
AllowStyleOverride|
Top

Methods

| Name| Description
---|---|---
|
Dispose| Releases the
unmanaged resources used by the GH_FontControl and optionally releases the
managed resources (Overrides
[ContainerControlDispose(Boolean)](https://docs.microsoft.com/dotnet/api/system.windows.forms.containercontrol.dispose#system-
windows-forms-containercontrol-dispose\(system-boolean\)).)
|
OnLayout| Raises the
Layout
event. (Overrides
[ContainerControlOnLayout(LayoutEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.containercontrol.onlayout#system-
windows-forms-containercontrol-onlayout\(system-windows-forms-
layouteventargs\)).)
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com