---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Theme_GH_Theme.htm
scraped_at: 2025-09-08T16:15:13.981244
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Theme](../html/N_Grasshopper_GUI_Theme.htm
"Grasshopper.GUI.Theme")

[GH_Theme Class](../html/T_Grasshopper_GUI_Theme_GH_Theme.htm "GH_Theme
Class")

[GH_Theme Constructor
](../html/Overload_Grasshopper_GUI_Theme_GH_Theme__ctor.htm "GH_Theme
Constructor ")

[GH_Theme Properties](../html/Properties_T_Grasshopper_GUI_Theme_GH_Theme.htm
"GH_Theme Properties")

[GH_Theme Methods](../html/Methods_T_Grasshopper_GUI_Theme_GH_Theme.htm
"GH_Theme Methods")

!Click or drag to
resize

# GH_Theme Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.ThemeGH_Theme

**Namespace:** Grasshopper.GUI.Theme
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Theme : GH_ISerializable

    Public Class GH_Theme
    	Implements GH_ISerializable

The GH_Theme type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Theme|  Create a new default
theme.
|
GH_Theme(GH_Theme)|  Make a
duplicate of another theme.
Top

Properties

| Name| Description
---|---|---
|
BackGround|  Gets the theme
background settings.
!Static
member|
DefaultTheme|
|
Objects|  Gets the theme
objects and ZUI settings.
|
Page|  Gets the theme page and
grid settings.
|
Palettes|  Gets the theme
palette settings.
|
Wires|  Gets the theme wire
settings.
Top

Methods

| Name| Description
---|---|---
|
LoadTheme|  Instantiate all
palette and gui defaults. This function reads the colour values out of
grasshopper_gui.xml settings database if it exists.
|
Read|
|
SaveTheme|  Store all
palette and gui defaults. This function writes the colour values out to
grasshopper_gui.xml settings database.
|
Write|
Top

See Also

#### Reference

Grasshopper.GUI.Theme Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com