---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DocumentAssociations.htm
scraped_at: 2025-09-08T16:16:25.335891
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocumentAssociations
Class](../html/T_Grasshopper_Kernel_GH_DocumentAssociations.htm
"GH_DocumentAssociations Class")

[GH_DocumentAssociations Constructor
](../html/M_Grasshopper_Kernel_GH_DocumentAssociations__ctor.htm
"GH_DocumentAssociations Constructor ")

[GH_DocumentAssociations
Methods](../html/Methods_T_Grasshopper_Kernel_GH_DocumentAssociations.htm
"GH_DocumentAssociations Methods")

!Click or drag to
resize

# GH_DocumentAssociations Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_DocumentAssociations

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DocumentAssociations

    Public Class GH_DocumentAssociations

The GH_DocumentAssociations type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DocumentAssociations|
Initializes a new instance of the GH_DocumentAssociations class
Top

Methods

| Name| Description
---|---|---
|
Associate|  Add
an association between a Rhino and a Grasshopper file. If a similar
association already exists, it will be overwritten. This function reads and
writes to the disk, it is SLOW. Only call it when you KNOW something changed.
|
GetGrasshopperAssociations|
Find all the Grasshopper ghx files that have been associated with a given
Rhino file.
|
GetRhinoAssociations|
Find all the Rhino 3dm files that have been associated with a given
Grasshopper file.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com