---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Render_ObjectRenderMaterial_Value.htm
scraped_at: 2025-09-08T16:24:50.451990
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Render](../html/N_Grasshopper_Rhinoceros_Render.htm
"Grasshopper.Rhinoceros.Render")

[ObjectRenderMaterial.Value
Structure](../html/T_Grasshopper_Rhinoceros_Render_ObjectRenderMaterial_Value.htm
"ObjectRenderMaterial.Value Structure")

[Value Constructor
](../html/Overload_Grasshopper_Rhinoceros_Render_ObjectRenderMaterial_Value__ctor.htm
"Value Constructor ")

[Value
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Render_ObjectRenderMaterial_Value.htm
"Value Properties")

[Value
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Render_ObjectRenderMaterial_Value.htm
"Value Methods")

[Value Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Render_ObjectRenderMaterial_Value.htm
"Value Type Conversions")

!Click or drag to
resize

# ObjectRenderMaterialValue Structure

---

**Namespace:**
Grasshopper.Rhinoceros.Render
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct Value : GH_ISerializable, IEquatable<ObjectRenderMaterialValue>,
    	IComparable<ObjectRenderMaterialValue>, IComparable

    Public Structure Value
    	Implements GH_ISerializable, IEquatable(Of ObjectRenderMaterialValue),
    	IComparable(Of ObjectRenderMaterialValue), IComparable

The ObjectRenderMaterialValue type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectRenderMaterialValue(ModelRenderMaterial)|
Initializes a new instance of the ObjectRenderMaterialValue class
|
ObjectRenderMaterialValue(ObjectMaterialSource)|
Initializes a new instance of the ObjectRenderMaterialValue class
|
ObjectRenderMaterialValue(ObjectMaterialSource,
ModelRenderMaterial)|
Initializes a new instance of the ObjectRenderMaterialValue class
Top

Properties

| Name| Description
---|---|---
!Static
member|
ByLayer|
!Static
member|
ByParent|
!Static
member|
Default|
|
Material|
|
Source|
Top

Methods

| Name| Description
---|---|---
|
CompareTo(Object)|
|
CompareTo(ObjectRenderMaterialValue)|
|
Deconstruct|
|
Equals(Object)|
(Overrides
[ValueTypeEquals(Object)](https://docs.microsoft.com/dotnet/api/system.valuetype.equals#system-
valuetype-equals\(system-object\)).)
|
Equals(ObjectRenderMaterialValue)|
|
GetHashCode|
(Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
|
ToString|
(Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelRenderMaterial to
ObjectRenderMaterialValue)|
!Static
member| (ObjectMaterialSource to
ObjectRenderMaterialValue)|
!Static
member| (ObjectRenderMaterialValue to
ModelRenderMaterial)|
!Static
member| (ObjectRenderMaterialValue to
ObjectMaterialSource)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Render Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com