---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_UVInterval.htm
scraped_at: 2025-09-08T16:21:48.697968
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[UVInterval Structure](../html/T_Grasshopper_Kernel_Types_UVInterval.htm
"UVInterval Structure")

[UVInterval Constructor
](../html/M_Grasshopper_Kernel_Types_UVInterval__ctor.htm "UVInterval
Constructor ")

[UVInterval
Properties](../html/Properties_T_Grasshopper_Kernel_Types_UVInterval.htm
"UVInterval Properties")

!Click or drag to
resize

# UVInterval Structure

---

UVInterval data type. Do not confuse this with GH_Interval2D.

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct UVInterval

    Public Structure UVInterval

The UVInterval type exposes the following members.

Constructors

| Name| Description
---|---|---
|
UVInterval| Initializes a
new instance of the UVInterval class
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets a value
indicating whether or not this UVInterval is valid.
|
U|  Gets or sets the U
interval.
|
U0|  Gets or sets the T0 value
of the U domain.
|
U1|  Gets or sets the T1 value
of the U domain.
|
V|  Gets or sets the V
interval.
|
V0|  Gets or sets the T0 value
of the V domain.
|
V1|  Gets or sets the T1 value
of the V domain.
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com