---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_GHALoadingEventArgs.htm
scraped_at: 2025-09-08T16:16:55.404981
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_GHALoadingEventArgs
Class](../html/T_Grasshopper_Kernel_GH_GHALoadingEventArgs.htm
"GH_GHALoadingEventArgs Class")

[GH_GHALoadingEventArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_GHALoadingEventArgs.htm
"GH_GHALoadingEventArgs Properties")

!Click or drag to
resize

# GH_GHALoadingEventArgs Class

---

Event arguments used in the GH_GHALoaded event on GH_ComponentServer.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_GHALoadingEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_GHALoadingEventArgs : EventArgs

    Public Class GH_GHALoadingEventArgs
    	Inherits EventArgs

The GH_GHALoadingEventArgs type exposes the following members.

Properties

| Name| Description
---|---|---
|
Assembly|  Gets
the assembly that was loaded from the GHA file.
|
FileName|  Gets
the location of the gha file.
|
Icon|  Gets the
official icon of the GHA file.
|
Id|  Gets the Id of the
GHA file.
|
LoadingMechanism|
Gets the mechanism that was used to load the file.
|
Name|  Gets the
official name of the GHA file.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com