---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_BezierSolver.htm
scraped_at: 2025-09-08T16:12:15.183202
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_BezierSolver Class](../html/T_Grasshopper_GUI_GH_BezierSolver.htm
"GH_BezierSolver Class")

[GH_BezierSolver Constructor
](../html/M_Grasshopper_GUI_GH_BezierSolver__ctor.htm "GH_BezierSolver
Constructor ")

[GH_BezierSolver
Methods](../html/Methods_T_Grasshopper_GUI_GH_BezierSolver.htm
"GH_BezierSolver Methods")

!Click or drag to
resize

# GH_BezierSolver Class

---

Class for evaluating four-point bezier curves as used in GDI+

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_BezierSolver

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_BezierSolver

    Public Class GH_BezierSolver

The GH_BezierSolver type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_BezierSolver| Initializes a
new instance of the GH_BezierSolver class
Top

Methods

| Name| Description
---|---|---
|
AngleAt|  Evaluate the
tangent angle of a Bezier span.
|
PointAt|  Evaluate a Bezier
span.
|
TangentAt|  Evaluate the
tangent vector of a Bezier span.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com