---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_UpgradeUtil.htm
scraped_at: 2025-09-08T16:18:08.731913
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_UpgradeUtil Class](../html/T_Grasshopper_Kernel_GH_UpgradeUtil.htm
"GH_UpgradeUtil Class")

[GH_UpgradeUtil Constructor
](../html/M_Grasshopper_Kernel_GH_UpgradeUtil__ctor.htm "GH_UpgradeUtil
Constructor ")

[GH_UpgradeUtil
Methods](../html/Methods_T_Grasshopper_Kernel_GH_UpgradeUtil.htm
"GH_UpgradeUtil Methods")

!Click or drag to
resize

# GH_UpgradeUtil Class

---

Exposes several utility functions for migrating parameters and wires between
components useful while upgrading components.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_UpgradeUtil

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_UpgradeUtil

    Public Class GH_UpgradeUtil

The GH_UpgradeUtil type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_UpgradeUtil| Initializes a
new instance of the GH_UpgradeUtil class
Top

Methods

| Name| Description
---|---|---
|
MigrateInputParameters(IGH_Component,
IGH_Component)|
Migrate all input parameters.
|
MigrateInputParameters(IGH_Component, IGH_Component, Int32,
Int32)|
Migrate a bunch of input parameters.
|
MigrateOutputParameters(IGH_Component,
IGH_Component)|
Migrate all output parameters.
|
MigrateOutputParameters(IGH_Component, IGH_Component, Int32,
Int32)|
Migrate a bunch of output parameters.
|
MigrateRecipients(IEnumerableIGH_Param,
IGH_Param)|
Utility method for bulk assigning a bunch of sources.
|
MigrateRecipients(IGH_Param,
IGH_Param)|
Migrate all recipients from A to B, while maintaining order.
|
MigrateSources(IEnumerableIGH_Param,
IGH_Param)|
Utility method for bulk assigning a bunch of sources.
|
MigrateSources(IGH_Param,
IGH_Param)|  Migrate
all sources from A to B, while maintaining order.
|
ReplaceInputParameters|
Move all input parameters from one component to another. Only use this
function if the target component can handle the input layout of the source
component.
|
ReplaceOutputParameters|
Move all output parameters from one component to another. Only use this
function if the target component can handle the output layout of the source
component.
|
SwapComponents(IGH_Component,
IGH_Component)|
Replace an existing component with a different one. All parameters (input and
output) will be migrated.
|
SwapComponents(IGH_Component,
Guid)|  Replace an
existing component with a different one. All parameters (input and output)
will be migrated.
|
SwapComponents(IGH_Component, IGH_Component,
Boolean)|  Replace
an existing component with a different one. All parameters (input and output)
will be migrated.
|
SwapComponents(IGH_Component, Guid,
Boolean)|  Replace
an existing component with a different one. All parameters (input and output)
will be migrated.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com