---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_StateTagList.htm
scraped_at: 2025-09-08T16:18:03.707195
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_StateTagList Class](../html/T_Grasshopper_Kernel_GH_StateTagList.htm
"GH_StateTagList Class")

[GH_StateTagList Constructor
](../html/M_Grasshopper_Kernel_GH_StateTagList__ctor.htm "GH_StateTagList
Constructor ")

[GH_StateTagList
Properties](../html/Properties_T_Grasshopper_Kernel_GH_StateTagList.htm
"GH_StateTagList Properties")

[GH_StateTagList
Methods](../html/Methods_T_Grasshopper_Kernel_GH_StateTagList.htm
"GH_StateTagList Methods")

!Click or drag to
resize

# GH_StateTagList Class

---

Maintains a collection of IGH_StateTag objects.

Inheritance Hierarchy

SystemObject
System.Collections.GenericListIGH_StateTag
Grasshopper.KernelGH_StateTagList

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_StateTagList : List<IGH_StateTag>,
    	IGH_TooltipAwareObject

    Public Class GH_StateTagList
    	Inherits List(Of IGH_StateTag)
    	Implements IGH_TooltipAwareObject

The GH_StateTagList type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_StateTagList| Initializes
a new instance of the GH_StateTagList class
Top

Properties

| Name| Description
---|---|---
|
BoundingBox|  Gets the
boundingbox of all StateTags.
Top

Methods

| Name| Description
---|---|---
|
Layout|  Layout the
StateTags.
|
RenderStateTags|
Render all StateTags in this list to the designated Graphics surface.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com