---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Light.htm
scraped_at: 2025-09-08T16:20:55.464859
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Light Class](../html/T_Grasshopper_Kernel_Types_GH_Light.htm "GH_Light
Class")

[GH_Light Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Light__ctor.htm "GH_Light
Constructor ")

[GH_Light
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Light.htm
"GH_Light Properties")

[GH_Light Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Light.htm
"GH_Light Methods")

[GH_Light Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Light.htm
"GH_Light Fields")

!Click or drag to
resize

# GH_Light Class

---

Represents an implementation of a Rhino Light class.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooLight
Grasshopper.Kernel.TypesGH_GeometricGooLight
Grasshopper.Kernel.TypesGH_Light

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Light : GH_GeometricGoo<Light>,
    	IGH_PreviewData, IGH_BakeAwareData

    Public Class GH_Light
    	Inherits GH_GeometricGoo(Of Light)
    	Implements IGH_PreviewData, IGH_BakeAwareData

The GH_Light type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Light|  Default
constructor, creates an new light
|
GH_Light(GH_Light)|  Create
a duplicate of another GH_Light. This constructor also copies reference data.
|
GH_Light(Guid)|  Create a
new referenced light that references a Rhino light with the specified ID.
|
GH_Light(Light)|  Create a
duplicate of an existing light.
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
(Overrides
GH_GeometricGooTBoundingbox.)
|
ClippingBox|
|
IsGeometryLoaded|
Gets the load state of this light object. The light is considered to be loaded
when the local light instance is not null.  (Overrides
GH_GeometricGooTIsGeometryLoaded.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  Gets the validity
of this light. If the light is referenced but cannot be loaded, then the light
is not valid.  (Overrides
GH_GeometricGooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
ReferenceID|
(Overrides
GH_GeometricGooTReferenceID.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  (Overrides
GH_GeometricGooTValue.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
|
CastFrom|  Remote to Local
caster function. This stuff is complex, don't concern yourself with casting
logic.  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  Local to
Remote caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GeometricGooTCastToQ(Q).)
|
ClearCaches|  Clears
all volatile caches for this instance. The boundingbox is cleared, and if the
light is referenced, the local instance of the light is erased.  (Overrides
GH_GeometricGooTClearCaches.)
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|  (Overrides
GH_GeometricGooTDuplicate.)
|
DuplicateGeometry|
Create a duplicate of this light.  (Overrides
GH_GeometricGooTDuplicateGeometry.)
|
DuplicateLight|
Create a duplicate of this light.
|
EmitProxy|
Create a new proxy for this instance. Return Null if this class does not
support proxies.  (Inherited from
GH_GeometricGooT.)
|
GetBoundingBox|
(Overrides
GH_GeometricGooTGetBoundingBox(Transform).)
|
LoadGeometry|  If the
geometry is referenced and not yet loaded, attempts to load the geometry.
(Overrides
GH_GeometricGooTLoadGeometry.)
|
LoadGeometry(RhinoDoc)|
If the light is referenced and not yet loaded, attempts to load the light.
(Overrides
GH_GeometricGooTLoadGeometry(RhinoDoc).)
|
Morph|  (Overrides
GH_GeometricGooTMorph(SpaceMorph).)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|  Format the
dimension using default grasshopper formatting logic.  (Overrides
GH_GooTToString.)
|
Transform|  (Overrides
GH_GeometricGooTTransform(Transform).)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com