---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_GeometryGroup.htm
scraped_at: 2025-09-08T16:20:41.399459
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_GeometryGroup
Class](../html/T_Grasshopper_Kernel_Types_GH_GeometryGroup.htm
"GH_GeometryGroup Class")

[GH_GeometryGroup Constructor
](../html/M_Grasshopper_Kernel_Types_GH_GeometryGroup__ctor.htm
"GH_GeometryGroup Constructor ")

[GH_GeometryGroup
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_GeometryGroup.htm
"GH_GeometryGroup Properties")

[GH_GeometryGroup
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_GeometryGroup.htm
"GH_GeometryGroup Methods")

!Click or drag to
resize

# GH_GeometryGroup Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GeometryGroup

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_GeometryGroup : IGH_GeometricGoo,
    	IGH_BakeAwareData, IGH_RenderAwareData, IGH_PreviewData

    Public Class GH_GeometryGroup
    	Implements IGH_GeometricGoo, IGH_BakeAwareData, IGH_RenderAwareData, IGH_PreviewData

The GH_GeometryGroup type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_GeometryGroup|
Initializes a new instance of the GH_GeometryGroup class
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
|
ClippingBox|
|
IsGeometryLoaded|
|
IsReferencedGeometry|
|
IsValid|
|
IsValidWhyNot|
|
Name|
|
Objects|
|
ReferenceID|
|
TypeDescription|
|
TypeName|
Top

Methods

| Name| Description
---|---|---
|
AppendRenderGeometry|
|
BakeGeometry|
|
CastFrom|
|
CastToT|
|
ClearCaches|
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|
|
DuplicateGeometry|
|
EmitProxy|
|
GetBoundingBox|
|
LoadGeometry|
|
LoadGeometry(RhinoDoc)|
|
Morph|
|
Read|
|
ScriptVariable|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Transform|
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com