---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_RuleNumber.htm
scraped_at: 2025-09-08T16:19:14.031121
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_RuleNumber Class](../html/T_Grasshopper_Kernel_Data_GH_RuleNumber.htm
"GH_RuleNumber Class")

[GH_RuleNumber Constructor
](../html/M_Grasshopper_Kernel_Data_GH_RuleNumber__ctor.htm "GH_RuleNumber
Constructor ")

[GH_RuleNumber
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_RuleNumber.htm
"GH_RuleNumber Properties")

[GH_RuleNumber
Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_RuleNumber.htm
"GH_RuleNumber Methods")

!Click or drag to
resize

# GH_RuleNumber Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_RuleNumber

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RuleNumber : IGH_Rule

    Public Class GH_RuleNumber
    	Implements IGH_Rule

The GH_RuleNumber type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_RuleNumber|
Initializes a new instance of the GH_RuleNumber class
Top

Properties

| Name| Description
---|---|---
|
Kind|
|
Notation|
Top

Methods

| Name| Description
---|---|---
|
Apply|
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com