---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_ConnectivityDiagram.htm
scraped_at: 2025-09-08T16:15:53.138846
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_ConnectivityDiagram
Class](../html/T_Grasshopper_Kernel_GH_ConnectivityDiagram.htm
"GH_ConnectivityDiagram Class")

[GH_ConnectivityDiagram Constructor
](../html/Overload_Grasshopper_Kernel_GH_ConnectivityDiagram__ctor.htm
"GH_ConnectivityDiagram Constructor ")

[GH_ConnectivityDiagram
Properties](../html/Properties_T_Grasshopper_Kernel_GH_ConnectivityDiagram.htm
"GH_ConnectivityDiagram Properties")

[GH_ConnectivityDiagram
Methods](../html/Methods_T_Grasshopper_Kernel_GH_ConnectivityDiagram.htm
"GH_ConnectivityDiagram Methods")

!Click or drag to
resize

# GH_ConnectivityDiagram Class

---

Represents a complete connectivity diagram (topology) of a GH_Document. A
connectivity diagram is basically an undirected network of all the wires in a
document.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_ConnectivityDiagram

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ConnectivityDiagram

    Public Class GH_ConnectivityDiagram

The GH_ConnectivityDiagram type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ConnectivityDiagram(GH_ConnectivityDiagram)|
Create a duplicate of another Connectivity Diagram.
|
GH_ConnectivityDiagram(GH_Document)|
Create a new Connectivity Diagram from a GH_Document.
Top

Properties

| Name| Description
---|---|---
|
Node|  Get the
connectivity node with the specified ID.
|
NodeCount|  Gets
the number of connectivity nodes in this diagram.
|
Nodes|  Gets a proxy
for all the Nodes in this diagram.
Top

Methods

| Name| Description
---|---|---
|
ContainsID|
Test the diagram for a given Node ID.
|
GetAllInputs|
Get all the Nodes that are part of the specified node input.
|
GetAllOutputs|
Get all the Nodes that are part of the specified node output.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com