---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_TextDot_GH_TextDotProxy.htm
scraped_at: 2025-09-08T16:21:36.640108
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_TextDot.GH_TextDotProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_TextDot_GH_TextDotProxy.htm
"GH_TextDot.GH_TextDotProxy Class")

[GH_TextDot.GH_TextDotProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_TextDot_GH_TextDotProxy__ctor.htm
"GH_TextDot.GH_TextDotProxy Constructor ")

[GH_TextDotProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_TextDot_GH_TextDotProxy.htm
"GH_TextDotProxy Properties")

[GH_TextDotProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_TextDot_GH_TextDotProxy.htm
"GH_TextDotProxy Methods")

!Click or drag to
resize

# GH_TextDotGH_TextDotProxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_TextDot
Grasshopper.Kernel.TypesGH_TextDotGH_TextDotProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_TextDotProxy : GH_GooProxy<GH_TextDot>

    Public Class GH_TextDotProxy
    	Inherits GH_GooProxy(Of GH_TextDot)

The GH_TextDotGH_TextDotProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_TextDotGH_TextDotProxy|
Initializes a new instance of the GH_TextDotGH_TextDotProxy class
Top

Properties

| Name| Description
---|---|---
|
ObjectID|
|
Point|
|
SecondaryText|
|
Text|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com