---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DocumentTreeNode.htm
scraped_at: 2025-09-08T16:16:37.322362
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocumentTreeNode
Class](../html/T_Grasshopper_Kernel_GH_DocumentTreeNode.htm
"GH_DocumentTreeNode Class")

[GH_DocumentTreeNode Constructor
](../html/M_Grasshopper_Kernel_GH_DocumentTreeNode__ctor.htm
"GH_DocumentTreeNode Constructor ")

[GH_DocumentTreeNode
Properties](../html/Properties_T_Grasshopper_Kernel_GH_DocumentTreeNode.htm
"GH_DocumentTreeNode Properties")

!Click or drag to
resize

# GH_DocumentTreeNode Class

---

Represents a single node in a document tree.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_DocumentTreeNode

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DocumentTreeNode

    Public Class GH_DocumentTreeNode

The GH_DocumentTreeNode type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DocumentTreeNode|
Create a new node instance.
Top

Properties

| Name| Description
---|---|---
|
Document|  Gets the
document at this node.
|
SubNodes|  Gets a
collection of subnodes.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com