---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_LoadingAttribute.htm
scraped_at: 2025-09-08T16:17:04.428136
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_LoadingAttribute
Class](../html/T_Grasshopper_Kernel_GH_LoadingAttribute.htm
"GH_LoadingAttribute Class")

[GH_LoadingAttribute Constructor
](../html/M_Grasshopper_Kernel_GH_LoadingAttribute__ctor.htm
"GH_LoadingAttribute Constructor ")

!Click or drag to
resize

# GH_LoadingAttribute Class

---

Assembly loading behaviour attribute.

Inheritance Hierarchy

SystemObject
SystemAttribute
Grasshopper.KernelGH_LoadingAttribute

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_LoadingAttribute : Attribute

    Public Class GH_LoadingAttribute
    	Inherits Attribute

The GH_LoadingAttribute type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_LoadingAttribute|
Initializes a new instance of the GH_LoadingAttribute class
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com