---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_IndexRange.htm
scraped_at: 2025-09-08T16:19:00.970198
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_IndexRange Structure](../html/T_Grasshopper_Kernel_Data_GH_IndexRange.htm
"GH_IndexRange Structure")

[GH_IndexRange Constructor
](../html/Overload_Grasshopper_Kernel_Data_GH_IndexRange__ctor.htm
"GH_IndexRange Constructor ")

[GH_IndexRange
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_IndexRange.htm
"GH_IndexRange Properties")

[GH_IndexRange
Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_IndexRange.htm
"GH_IndexRange Methods")

!Click or drag to
resize

# GH_IndexRange Structure

---

Represents a range of indices.

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct GH_IndexRange : GH_ISerializable

    Public Structure GH_IndexRange
    	Implements GH_ISerializable

The GH_IndexRange type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_IndexRange(Int32)|
Create a new singular range.
| GH_IndexRange(Int32,
Int32)|  Create a new
range.
Top

Properties

| Name| Description
---|---|---
|
Index0|  Gets the first
index in the range.
|
Index1|  Gets the last
index in the range.
!Static
member|
InvalidRange|
Gets the predefined invalid range.
|
IsSingular|  Gets
whether the range has zero length.
|
IsValid|  Gets whether
this range is valid.
|
Length|  Gets the length
of the range.
!Static
member|
MaxValue|
Top

Methods

| Name| Description
---|---|---
|
AdjacentTo|  Tests
whether this range is adjacent to another.
|
Contains(GH_IndexRange)|
Tests whether a specified range is entirely contained within this range.
|
Contains(Int32)|
Tests whether a specified index is defined by this range.
|
Intersection|
Create the intersection between two ranges.
|
IntersectsWith|
Tests whether certain indices are described by both this and another range.
|
Split|  Split a range
into two using an integer index.
|
ToString|  (Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
|
Union|  Create a range
which contains both input ranges.
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com