---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_RotationalTuningData_1.htm
scraped_at: 2025-09-08T16:13:01.395148
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_RotationalTuningData(T)
Class](../html/T_Grasshopper_GUI_GH_RotationalTuningData_1.htm
"GH_RotationalTuningData\(T\) Class")

[GH_RotationalTuningData(T) Constructor
](../html/Overload_Grasshopper_GUI_GH_RotationalTuningData_1__ctor.htm
"GH_RotationalTuningData\(T\) Constructor ")

[GH_RotationalTuningData(T)
Properties](../html/Properties_T_Grasshopper_GUI_GH_RotationalTuningData_1.htm
"GH_RotationalTuningData\(T\) Properties")

[GH_RotationalTuningData(T)
Methods](../html/Methods_T_Grasshopper_GUI_GH_RotationalTuningData_1.htm
"GH_RotationalTuningData\(T\) Methods")

!Click or drag to
resize

# GH_RotationalTuningDataT Class

---

Utility class for keeping track of rotational mouse events.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_RotationalTuningDataT

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RotationalTuningData<T>

    Public Class GH_RotationalTuningData(Of T)

#### Type Parameters

T

    Basic type for initial conditions.

The GH_RotationalTuningDataT type exposes the following members.

Constructors

| Name| Description
---|---|---
| GH_RotationalTuningDataT(T,
PointF)|  Create a new
instance of the rotational tuning data.
| GH_RotationalTuningDataT(T, PointF,
PointF)|  Create a
new instance of the rotational tuning data.
Top

Properties

| Name| Description
---|---|---
|
Frame|  Gets the
frame at the given index.
|
FrameCount|
Gets the total number of recorded frames.
|
InitialValue|
Gets the initial value.
|
Pivot|  Gets or sets
the rotational pivot. You only need to set this if the pivot changes.
Top

Methods

| Name| Description
---|---|---
|
AddFrame|  Grow
the tuning track by one point and compute the angle.
|
TotalAngle|
Compute the total angle from the first to the last frame.
|
TotalTurns|
Compute the total number of full turns from the first to the last frame.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com