---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Integer.htm
scraped_at: 2025-09-08T16:20:50.441351
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Integer Class](../html/T_Grasshopper_Kernel_Types_GH_Integer.htm
"GH_Integer Class")

[GH_Integer Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Integer__ctor.htm "GH_Integer
Constructor ")

[GH_Integer
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Integer.htm
"GH_Integer Properties")

[GH_Integer Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Integer.htm
"GH_Integer Methods")

[GH_Integer Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Integer.htm
"GH_Integer Fields")

!Click or drag to
resize

# GH_Integer Class

---

Represents a 32-bit signed integer. GH_Integer re-implements the framework
System.Int32 type.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooInt32
Grasshopper.Kernel.TypesGH_Integer

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Integer : GH_Goo<int>

    Public Class GH_Integer
    	Inherits GH_Goo(Of Integer)

The GH_Integer type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Integer|  Blank
constructor
|
GH_Integer(GH_Integer)|
Initializes a new instance of the GH_Integer class
|
GH_Integer(Int32)|
Initializes a new instance of the GH_Integer class
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets the
validity of this instance. Integers are always valid.  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Inherited from
GH_GooT.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  (Overrides
GH_GooTCastToQ(Q).)
|
Duplicate|  (Overrides
GH_GooTDuplicate.)
|
DuplicateInteger|
|
EmitProxy|  (Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com