---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Base_GH_DigitScrollerBase.htm
scraped_at: 2025-09-08T16:13:39.587084
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Base](../html/N_Grasshopper_GUI_Base.htm
"Grasshopper.GUI.Base")

[GH_DigitScrollerBase
Class](../html/T_Grasshopper_GUI_Base_GH_DigitScrollerBase.htm
"GH_DigitScrollerBase Class")

[GH_DigitScrollerBase Constructor
](../html/M_Grasshopper_GUI_Base_GH_DigitScrollerBase__ctor.htm
"GH_DigitScrollerBase Constructor ")

[GH_DigitScrollerBase
Properties](../html/Properties_T_Grasshopper_GUI_Base_GH_DigitScrollerBase.htm
"GH_DigitScrollerBase Properties")

[GH_DigitScrollerBase
Methods](../html/Methods_T_Grasshopper_GUI_Base_GH_DigitScrollerBase.htm
"GH_DigitScrollerBase Methods")

[GH_DigitScrollerBase
Events](../html/Events_T_Grasshopper_GUI_Base_GH_DigitScrollerBase.htm
"GH_DigitScrollerBase Events")

!Click or drag to
resize

# GH_DigitScrollerBase Class

---

Provides Numeric digit scrolling GUI not tied to a control-handle.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.BaseGH_TextBoxInputBase
Grasshopper.GUI.BaseGH_DigitScrollerBase

**Namespace:** Grasshopper.GUI.Base
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DigitScrollerBase : GH_TextBoxInputBase

    Public Class GH_DigitScrollerBase
    	Inherits GH_TextBoxInputBase

The GH_DigitScrollerBase type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DigitScrollerBase|
Initializes a new instance of the GH_DigitScrollerBase class
Top

Properties

| Name| Description
---|---|---
|
AllowRadixDrag|
Gets or sets a value indicating whether the radix is allowed to be dragged
around.
|
AllowTextInput|
Gets or sets whether text input is allowed by double click.
|
AmplifyMotion|
Gets or sets a value indicating whether vertical mouse drags should be
amplified as the mouse moves further and further.
|
BackgroundGradient|
Gets or sets the background Gradient. If the gradient is not null, it
overrides the background colours.
|
BottomColour|
Gets or sets the colour used along the bottom edge of the control.
|
Bounds|  Gets or
sets the Bounds for this scroller.  (Overrides GH_TextBoxInputBase.Bounds.)
|
DecimalPlaces|
Gets or sets the number of decimal places available in this scroller. Unlike
Radix, this property maintains the decimal position of the value represented
by this scroller.
|
DigitAlign|
Gets or sets the digit align mode.
|
Digits|  Gets or
sets the number of digits available in this scroller.
|
DrawBackground|
Gets or sets whether the background is drawn in this control.
|
DrawBorder|
Gets or sets whether the border is drawn in this control.
|
DrawShadows|
Gets or sets whether shadows are drawn in this control.
|
EdgeColour|
Gets or sets the edge colour of the control.
|
Epsilon|  Gets the
smallest possible change in the value.
|
Font|  Gets or sets
the Font for this scroller.  (Overrides
GH_TextBoxInputBaseFont.)
|
IsTextInput|
Gets whether the text input box is currently on screen.  (Inherited from
GH_TextBoxInputBase.)
|
MaximumValue|
Gets or sets the upper bound of the scroll value.
|
MinimumValue|
Gets or sets the lower bound of the scroll value.
|
Prefix|  Gets or
sets the prefix text to be displayed on the scroller.
|
PrefixBox|  Gets
the box containing the prefix string. If there is no prefix the PrefixBox will
be Rectangle.Empty
|
Radix|  Gets or sets
the radix index of this scroller.
|
RadixBox|  Gets
the Radix box for this control, if there is no radix box, Rectangle.Empty will
be returned.
|
RailColour|
Gets or sets the colour used for the rail line.
|
RaiseEvents|
Gets or sets whether this scroller raises the ValueChanged event.
|
ScrollBoxes|
Gets all scroll boxes (from left to right) for this control, not including the
radix box.
|
ShadowColour|
Gets or sets the colour used for the shadows.
|
ShadowSize|
Gets or sets the size of the drop shadow along all four edges.
|
SignBox|  Gets the
Sign box for this control.
|
Suffix|  Gets or
sets the suffix text to be displayed on the scroller.
|
SuffixBox|  Gets
the box containing the suffix string. If there is no suffix the PrefixBox will
have zero width
|
TextColour|
Gets or sets the colour used for the text inside the scrolls.
|
TopColour|  Gets
or sets the colour used along the top edge of the control.
|
Value|  Gets or sets
the value displayed in this scroller.
Top

Methods

| Name| Description
---|---|---
|
HandleTextInputAccepted|
(Overrides
GH_TextBoxInputBaseHandleTextInputAccepted(String).)
|
HideTextInputBox|
Hides the text-input override form (if it is displayed).  (Inherited from
GH_TextBoxInputBase.)
|
MouseDown|
Respond to mouse-down events.
|
MouseMove|
Respond to mouse-move events.
|
MouseUp|  Respond
to mouse-up events.
|
OnInvalidated|
Raise the Invalidated event.
|
OnValueChanged|
Raise the ValueChanged event.
|
Render|  Render all
UI elements.
|
RespondToEnter|
(Inherited from
GH_TextBoxInputBase.)
|
RespondToEscape|
(Inherited from
GH_TextBoxInputBase.)
|
SetupScroller|
Set the minimum, maximum and value fields simultaneously.
|
ShowTextInputBox(Control)|
| ShowTextInputBox(Control,
Boolean)|
| ShowTextInputBox(Control, Boolean,
Matrix)|
| ShowTextInputBox(Control, String,
Boolean)|
Display a floating text-box on top of the owner control.  (Inherited from
GH_TextBoxInputBase.)
| ShowTextInputBox(Control, String,
Boolean,
Boolean)|
Display a floating text-box on top of the owner control.  (Inherited from
GH_TextBoxInputBase.)
| ShowTextInputBox(Control, String,
Boolean, Boolean,
Matrix)|
Display a floating text-box on top of the owner control.  (Inherited from
GH_TextBoxInputBase.)
Top

Events

| Name| Description
---|---|---
|
Invalidated|
Raised whenever the display of this scroller is changed, but not the value.
|
ValueChanged|
Raised whenever the value of this scroller is changed due to User-Interface
methods.
Top

See Also

#### Reference

Grasshopper.GUI.Base Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com