---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_ModelView.htm
scraped_at: 2025-09-08T16:23:26.102020
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[ModelView Class](../html/T_Grasshopper_Rhinoceros_Display_ModelView.htm
"ModelView Class")

[ModelView Constructor
](../html/Overload_Grasshopper_Rhinoceros_Display_ModelView__ctor.htm
"ModelView Constructor ")

[ModelView
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_ModelView.htm
"ModelView Properties")

[ModelView
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_ModelView.htm
"ModelView Methods")

!Click or drag to
resize

# ModelView Class

---

Represents a 3D view frustum. Wraps the functionality of the ViewportInfo
type.

Inheritance Hierarchy

SystemObject
Grasshopper.Rhinoceros.DisplayModelView

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelView : IGH_GeometricGoo,
    	IEquatable<ModelView>, IGH_PreviewData, IGH_BakeAwareData

    Public NotInheritable Class ModelView
    	Implements IGH_GeometricGoo, IEquatable(Of ModelView),
    	IGH_PreviewData, IGH_BakeAwareData

The ModelView type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelView| Initializes
a new instance of the ModelView class
|
ModelView(Guid)|
Create a new referenced view that references a RhinoView or NamedView object
with the specified ref_guid.
|
ModelView(ModelView)|
Initializes a new instance of the ModelView class
|
ModelView(RhinoView)|
Initializes a new instance of the ModelView class
|
ModelView(RhinoViewport)|
Initializes a new instance of the ModelView class
|
ModelView(ViewInfo)|
Initializes a new instance of the ModelView class
|
ModelView(ViewportInfo)|
Initializes a new instance of the ModelView class
| ModelView(ViewportInfo,
String)| Initializes
a new instance of the ModelView class
Top

Properties

| Name| Description
---|---|---
|
IsValid|
|
Title|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToQ|
|
Equals(ModelView)|
|
Equals(Object)|
(Overrides
[ObjectEquals(Object)](https://docs.microsoft.com/dotnet/api/system.object.equals#system-
object-equals\(system-object\)).)
|
GetBoundingBox|
|
GetHashCode|
(Overrides
[ObjectGetHashCode](https://docs.microsoft.com/dotnet/api/system.object.gethashcode#system-
object-gethashcode).)
|
Morph|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
ToViewportInfo|
|
Transform|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com