---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_AnnotationDateTimeFormat.htm
scraped_at: 2025-09-08T16:22:51.958140
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations](../html/N_Grasshopper_Rhinoceros_Annotations.htm
"Grasshopper.Rhinoceros.Annotations")

[AnnotationDateTimeFormat
Class](../html/T_Grasshopper_Rhinoceros_Annotations_AnnotationDateTimeFormat.htm
"AnnotationDateTimeFormat Class")

[AnnotationDateTimeFormat Constructor
](../html/Overload_Grasshopper_Rhinoceros_Annotations_AnnotationDateTimeFormat__ctor.htm
"AnnotationDateTimeFormat Constructor ")

[AnnotationDateTimeFormat
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_AnnotationDateTimeFormat.htm
"AnnotationDateTimeFormat Properties")

[AnnotationDateTimeFormat
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_AnnotationDateTimeFormat.htm
"AnnotationDateTimeFormat Methods")

!Click or drag to
resize

# AnnotationDateTimeFormat Class

---

Represents a Date Time format.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooString
Grasshopper.Kernel.TypesGH_String
Grasshopper.Rhinoceros.AnnotationsAnnotationDateTimeFormat

**Namespace:**
Grasshopper.Rhinoceros.Annotations
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class AnnotationDateTimeFormat : GH_String,
    	IEquatable<AnnotationDateTimeFormat>

    Public NotInheritable Class AnnotationDateTimeFormat
    	Inherits GH_String
    	Implements IEquatable(Of AnnotationDateTimeFormat)

The AnnotationDateTimeFormat type exposes the following members.

Constructors

| Name| Description
---|---|---
|
AnnotationDateTimeFormat|
Initializes a new instance of the AnnotationDateTimeFormat class
|
AnnotationDateTimeFormat(GH_String)|
Initializes a new instance of the AnnotationDateTimeFormat class
|
AnnotationDateTimeFormat(String)|
Initializes a new instance of the AnnotationDateTimeFormat class
Top

Properties

| Name| Description
---|---|---
|
DisplayName|
|
IsValid|  Gets the
validity of this instance. String are valid if they are not null.  (Inherited
from GH_String.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Inherited from
GH_String.)
|
TypeDescription|
(Inherited from GH_String.)
|
TypeName|  (Inherited
from GH_String.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|
(Overrides
GH_StringCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  (Inherited
from GH_String.)
|
Duplicate|
(Overrides
GH_StringDuplicate.)
|
DuplicateString|
(Inherited from GH_String.)
|
EmitProxy|  (Inherited
from GH_String.)
|
Equals(AnnotationDateTimeFormat)|
|
Equals(Object)|
(Overrides
[ObjectEquals(Object)](https://docs.microsoft.com/dotnet/api/system.object.equals#system-
object-equals\(system-object\)).)
|
GetHashCode|
(Overrides
[ObjectGetHashCode](https://docs.microsoft.com/dotnet/api/system.object.gethashcode#system-
object-gethashcode).)
|
Read|  (Inherited from
GH_String.)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  (Inherited
from GH_String.)
|
Write|  (Inherited from
GH_String.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com