---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_RenderArgs.htm
scraped_at: 2025-09-08T16:17:46.643542
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_RenderArgs Class](../html/T_Grasshopper_Kernel_GH_RenderArgs.htm
"GH_RenderArgs Class")

[GH_RenderArgs Constructor
](../html/Overload_Grasshopper_Kernel_GH_RenderArgs__ctor.htm "GH_RenderArgs
Constructor ")

[GH_RenderArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_RenderArgs.htm
"GH_RenderArgs Properties")

[GH_RenderArgs Methods](../html/Methods_T_Grasshopper_Kernel_GH_RenderArgs.htm
"GH_RenderArgs Methods")

!Click or drag to
resize

# GH_RenderArgs Class

---

This class is passed to objects that implement IGH_RenderAwareData or
IGH_RenderAwareObject during render queue operations.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_RenderArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RenderArgs

    Public Class GH_RenderArgs

The GH_RenderArgs type exposes the following members.

Constructors

| Name| Description
---|---|---
| GH_RenderArgs(RhinoDoc,
ViewportInfo, RenderPrimitiveList, Guid, DictionaryInt32,
RenderMaterial)|
**Obsolete.** Create new render arguments.
| GH_RenderArgs(RhinoDoc,
ViewportInfo, RenderPrimitiveList, Guid, RenderMaterial,
RenderMaterial)|  **Obsolete.**
Create new render arguments.
Top

Properties

| Name| Description
---|---|---
|
Document|  Gets the rhino
document from whence the render originated.
|
MaterialNormal|
**Obsolete.** Gets the material hint to use for unselected objects.
|
MaterialSelected|
**Obsolete.** Gets the material hint to use for selected objects.
|
ModelTransform|  Gets
the current model transform.
|
PluginId|  Gets the render
plugin id that is about to render this geometry.
|
Viewport|  Gets the
viewport details involved in this rendering.
|
ViewportName|  Gets the
viewport name involved in this rendering.
Top

Methods

| Name| Description
---|---|---
|
PopModelTransform|
|
PushModelTransform|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com