---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DocFilePathEventArgs.htm
scraped_at: 2025-09-08T16:16:05.198555
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocFilePathEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DocFilePathEventArgs.htm
"GH_DocFilePathEventArgs Class")

[GH_DocFilePathEventArgs Constructor
](../html/M_Grasshopper_Kernel_GH_DocFilePathEventArgs__ctor.htm
"GH_DocFilePathEventArgs Constructor ")

[GH_DocFilePathEventArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_DocFilePathEventArgs.htm
"GH_DocFilePathEventArgs Properties")

!Click or drag to
resize

# GH_DocFilePathEventArgs Class

---

These arguments are passed along with FilePathChanged events on GH_Document.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_DocFilePathEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DocFilePathEventArgs : EventArgs

    Public Class GH_DocFilePathEventArgs
    	Inherits EventArgs

The GH_DocFilePathEventArgs type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DocFilePathEventArgs|
Create a new instance of the GH_DocFilePathEventArgs class.
Top

Properties

| Name| Description
---|---|---
|
Document|  Gets
the document that raised this event.
|
NewFilePath|
Gets the new filepath, the one currently assigned to this document.
|
OldFilePath|
Gets the old filepath, prior to the change that triggered this event.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com