---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_TrackerFrame.htm
scraped_at: 2025-09-08T16:13:15.462602
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_TrackerFrame Structure](../html/T_Grasshopper_GUI_GH_TrackerFrame.htm
"GH_TrackerFrame Structure")

[GH_TrackerFrame Constructor
](../html/M_Grasshopper_GUI_GH_TrackerFrame__ctor.htm "GH_TrackerFrame
Constructor ")

[GH_TrackerFrame Fields](../html/Fields_T_Grasshopper_GUI_GH_TrackerFrame.htm
"GH_TrackerFrame Fields")

!Click or drag to
resize

# GH_TrackerFrame Structure

---

Represents a single frame in a mouse-tracker history. A frame represents all
relevant mouse and keyboard data at a given time.

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct GH_TrackerFrame

    Public Structure GH_TrackerFrame

The GH_TrackerFrame type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_TrackerFrame| Initializes a
new instance of the GH_TrackerFrame class
Top

Fields

| Name| Description
---|---|---
|
Buttons|  The state of the
mouse buttons of the frame.
|
Keys|  The state of the modifier
keys (Contro, Shift and Alt) of the frame.
|
PositionControl|  The
position (in control coordinates) of the frame.
|
PositionScreen|  The
position (in screen coordinates) of the frame.
|
Tag|  Optional Tag object (to be
supplied by user).
|
Time|  The time at which this
frame was recorded.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com