---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_GeometricGoo_1.htm
scraped_at: 2025-09-08T16:20:39.404402
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_GeometricGoo(T)
Class](../html/T_Grasshopper_Kernel_Types_GH_GeometricGoo_1.htm
"GH_GeometricGoo\(T\) Class")

[GH_GeometricGoo(T) Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_GeometricGoo_1__ctor.htm
"GH_GeometricGoo\(T\) Constructor ")

[GH_GeometricGoo(T)
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_GeometricGoo_1.htm
"GH_GeometricGoo\(T\) Properties")

[GH_GeometricGoo(T)
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_GeometricGoo_1.htm
"GH_GeometricGoo\(T\) Methods")

[GH_GeometricGoo(T)
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_GeometricGoo_1.htm
"GH_GeometricGoo\(T\) Fields")

!Click or drag to
resize

# GH_GeometricGooT Class

---

Abstract base implementation of IGH_GeometricGoo. If you implement
IGH_GeometricGoo, use this for a booster.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooT
Grasshopper.Kernel.TypesGH_GeometricGooT
More...

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_GeometricGoo<T> : GH_Goo<T>,
    	IGH_GeometricGoo

    Public MustInherit Class GH_GeometricGoo(Of T)
    	Inherits GH_Goo(Of T)
    	Implements IGH_GeometricGoo

#### Type Parameters

T

The GH_GeometricGooT type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_GeometricGooT|
Blank constructor, m_value will be set to default (null for reference types,
zeroes for value types)
|
GH_GeometricGooT(T)|
Data constructor, m_value will be set to internal_data.
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
Gets the boundingbox for this geometry.
|
IsGeometryLoaded|
Gets a value indicating whether or not this geometry is currently loaded
(assuming it is referenced). Not all IGH_GeometricGoo implementations support
referenced geometry. The default is to always return True.
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.
|
IsValid|  Gets a
value indicating whether or not the current value is valid.  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Inherited from
GH_GooT.)
|
ReferenceID|
Gets or sets the Guid of the object that is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry. The default
implementation is to always return Guid.Empty.
|
TypeDescription|
Gets a description of the type of the implementation.  (Inherited from
GH_GooT.)
|
TypeName|  Gets the name
of the type of the implementation.  (Inherited from
GH_GooT.)
|
Value|  Gets or sets
the value of this type. Note that if the type has a ReferenceID this value
might get destroyed in the future.  (Overrides
GH_GooTValue.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|
Attempt a cast from generic object.  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Overrides
GH_GooTCastToQ(Q).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
ClearCaches|
Clears all caches. Typically if the geometry is referenced, this will erase
the local copy. If your T is a value-type, you must override this function and
specifically unset the local value.
|
Duplicate|  Make
a complete duplicate of this instance. No shallow copies.  (Overrides
GH_GooTDuplicate.)
|
DuplicateGeometry|
Make a complete duplicate of this geometry. No shallow copies.
|
EmitProxy|
Create a new proxy for this instance. Return Null if this class does not
support proxies.  (Overrides
GH_GooTEmitProxy.)
|
GetBoundingBox|
Compute an aligned boundingbox.
|
LoadGeometry|
If the geometry is referenced and currently unloaded, forces loading of the
geometry. Not all IGH_GeometricGoo implementations support referenced
geometry.
|
LoadGeometry(RhinoDoc)|
If the geometry is referenced and currently unloaded, forces loading of the
geometry. Not all IGH_GeometricGoo implementations support referenced
geometry. The default is to always return True.
|
Morph|  Morph the
object or a deformable representation of the object.
|
Read|  Default behaviour is to
return True.  (Inherited from
GH_GooT.)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  Creates a
string description of the current instance value.  (Inherited from
GH_GooT.)
|
Transform|
Transforms the object or a deformable representation of the object.
|
Write|  Default behaviour is
to return True.  (Inherited from
GH_GooT.)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooT
Grasshopper.Kernel.TypesGH_GeometricGooT
Grasshopper.Kernel.TypesGH_AnnotationBase
Grasshopper.Kernel.TypesGH_Arc
Grasshopper.Kernel.TypesGH_Box
Grasshopper.Kernel.TypesGH_Brep
Grasshopper.Kernel.TypesGH_Circle
Grasshopper.Kernel.TypesGH_Curve
Grasshopper.Kernel.TypesGH_DetailView
Grasshopper.Kernel.TypesGH_Extrusion
Grasshopper.Kernel.TypesGH_Hatch
Grasshopper.Kernel.TypesGH_InstanceReference
Grasshopper.Kernel.TypesGH_Light
Grasshopper.Kernel.TypesGH_Line
Grasshopper.Kernel.TypesGH_Mesh
Grasshopper.Kernel.TypesGH_Plane
Grasshopper.Kernel.TypesGH_PointCloud
Grasshopper.Kernel.TypesGH_Rectangle
Grasshopper.Kernel.TypesGH_SubD
Grasshopper.Kernel.TypesGH_Surface
Grasshopper.Kernel.TypesGH_TextDot

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com