---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_PreviewMeshData.htm
scraped_at: 2025-09-08T16:18:39.858056
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_PreviewMeshData
Interface](../html/T_Grasshopper_Kernel_IGH_PreviewMeshData.htm
"IGH_PreviewMeshData Interface")

[IGH_PreviewMeshData
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_PreviewMeshData.htm
"IGH_PreviewMeshData Methods")

!Click or drag to
resize

# IGH_PreviewMeshData Interface

---

Implement this interface if your data deals with preview meshes.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_PreviewMeshData

    Public Interface IGH_PreviewMeshData

The IGH_PreviewMeshData type exposes the following members.

Methods

| Name| Description
---|---|---
|
DestroyPreviewMeshes|
Erase all cached preview meshes.
|
GetPreviewMeshes|
Gets all the preview meshes associated with this data.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com