---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_ConnectivityNode.htm
scraped_at: 2025-09-08T16:15:55.125838
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_ConnectivityNode
Class](../html/T_Grasshopper_Kernel_GH_ConnectivityNode.htm
"GH_ConnectivityNode Class")

[GH_ConnectivityNode Constructor
](../html/M_Grasshopper_Kernel_GH_ConnectivityNode__ctor.htm
"GH_ConnectivityNode Constructor ")

[GH_ConnectivityNode
Properties](../html/Properties_T_Grasshopper_Kernel_GH_ConnectivityNode.htm
"GH_ConnectivityNode Properties")

!Click or drag to
resize

# GH_ConnectivityNode Class

---

Represents a single node in a Grasshopper connectivity diagram. A single node
represents a single IGH_Param instance.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_ConnectivityNode

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ConnectivityNode

    Public Class GH_ConnectivityNode

The GH_ConnectivityNode type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ConnectivityNode|
Initializes a new instance of the GH_ConnectivityNode class
Top

Properties

| Name| Description
---|---|---
|
NodeID|  Gets the
InstanceID of the Parameter that this node represents.
|
NodeIn|  Gets the list
of IDs that are connected to the input of this node.
|
NodeOut|  Gets the
list of IDs that are connected to the input of this node.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com