---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_PreviewExpiredEventArgs.htm
scraped_at: 2025-09-08T16:17:34.592802
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_PreviewExpiredEventArgs
Class](../html/T_Grasshopper_Kernel_GH_PreviewExpiredEventArgs.htm
"GH_PreviewExpiredEventArgs Class")

[GH_PreviewExpiredEventArgs Constructor
](../html/M_Grasshopper_Kernel_GH_PreviewExpiredEventArgs__ctor.htm
"GH_PreviewExpiredEventArgs Constructor ")

[GH_PreviewExpiredEventArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_PreviewExpiredEventArgs.htm
"GH_PreviewExpiredEventArgs Properties")

[GH_PreviewExpiredEventArgs
Fields](../html/Fields_T_Grasshopper_Kernel_GH_PreviewExpiredEventArgs.htm
"GH_PreviewExpiredEventArgs Fields")

!Click or drag to
resize

# GH_PreviewExpiredEventArgs Class

---

Arguments for preview events.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_PreviewExpiredEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PreviewExpiredEventArgs : EventArgs

    Public Class GH_PreviewExpiredEventArgs
    	Inherits EventArgs

The GH_PreviewExpiredEventArgs type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PreviewExpiredEventArgs|
Initializes a new instance of the GH_PreviewExpiredEventArgs class
Top

Properties

| Name| Description
---|---|---
|
ForceRedraw|
Top

Fields

| Name| Description
---|---|---
|
m_redraw|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com