---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_TextEntity.htm
scraped_at: 2025-09-08T16:21:37.678491
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_TextEntity Class](../html/T_Grasshopper_Kernel_Types_GH_TextEntity.htm
"GH_TextEntity Class")

[GH_TextEntity Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_TextEntity__ctor.htm
"GH_TextEntity Constructor ")

[GH_TextEntity
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_TextEntity.htm
"GH_TextEntity Properties")

[GH_TextEntity
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_TextEntity.htm
"GH_TextEntity Methods")

[GH_TextEntity
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_TextEntity.htm
"GH_TextEntity Fields")

!Click or drag to
resize

# GH_TextEntity Class

---

Represents an implementation of a Rhino text entity.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooAnnotationBase
Grasshopper.Kernel.TypesGH_GeometricGooAnnotationBase
Grasshopper.Kernel.TypesGH_AnnotationBase
Grasshopper.Kernel.TypesGH_TextEntity

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_TextEntity : GH_AnnotationBase

    Public Class GH_TextEntity
    	Inherits GH_AnnotationBase

The GH_TextEntity type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_TextEntity|  Default
constructor, creates an invalid text entity.
|
GH_TextEntity(GH_TextEntity)|
Create a duplicate of another GH_TextEntity. This constructor also copies
reference data.
|
GH_TextEntity(Guid)|
Create a new referenced text entity that references a Rhino text object with
the specified ID.
|
GH_TextEntity(TextEntity)|
Create a duplicate of an existing text entity.
| GH_TextEntity(TextEntity,
ModelAnnotationStyle)|
Create a duplicate of an existing text entity.
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
(Inherited from
GH_AnnotationBase.)
|
ClippingBox|
(Inherited from
GH_AnnotationBase.)
|
IsGeometryLoaded|
Gets the load state of this annotation object. The annotation is considered to
be loaded when the local annotation instance is not null.  (Inherited from
GH_AnnotationBase.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  Gets the
validity of this dimension. If the dimension is referenced but cannot be
loaded, then the dimension is not valid.  (Inherited from
GH_AnnotationBase.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Inherited
from GH_AnnotationBase.)
|
ReferenceID|
(Inherited from
GH_AnnotationBase.)
|
Style|  (Inherited
from GH_AnnotationBase.)
|
TypeDescription|
(Overrides
GH_AnnotationBaseTypeDescription.)
|
TypeName|  (Overrides
GH_AnnotationBaseTypeName.)
|
Value|
|
ValueType|
(Overrides
GH_AnnotationBaseValueType.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
(Inherited from
GH_AnnotationBase.)
|
CastFrom|  Remote to
Local caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToT(T)|
Local to Remote caster function. This stuff is complex, don't concern yourself
with casting logic.  (Inherited from
GH_AnnotationBase.)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  Local
to Remote caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_AnnotationBaseCastToT(T).)
|
ClearCaches|
Clears all volatile caches for this instance. The boundingbox is cleared, and
if the annotation is referenced, the local instance of the annotation is
erased.  (Inherited from
GH_AnnotationBase.)
|
DrawViewportMeshes|
(Inherited from
GH_AnnotationBase.)
|
DrawViewportWires|
(Inherited from
GH_AnnotationBase.)
|
Duplicate|
(Inherited from
GH_AnnotationBase.)
|
DuplicateAnnotation|
Create a duplicate of this annotation.  (Overrides
GH_AnnotationBaseDuplicateAnnotation.)
|
DuplicateGeometry|
Create a duplicate of this annotation.  (Inherited from
GH_AnnotationBase.)
|
DuplicateTextEntity|
Create a duplicate of this text entity.
|
EmitProxy|
(Inherited from
GH_AnnotationBase.)
|
GetBoundingBox|
(Inherited from
GH_AnnotationBase.)
|
GetOverrides|
(Inherited from
GH_AnnotationBase.)
|
LoadGeometry|
If the geometry is referenced and not yet loaded, attempts to load the
geometry.  (Inherited from
GH_AnnotationBase.)
|
LoadGeometry(RhinoDoc)|
If the annotation is referenced and not yet loaded, attempts to load the
leader.  (Inherited from
GH_AnnotationBase.)
|
Morph|  (Inherited
from GH_AnnotationBase.)
|
Read|  (Inherited
from GH_AnnotationBase.)
|
ScriptVariable|
(Inherited from
GH_AnnotationBase.)
|
SetOverrides|
(Inherited from
GH_AnnotationBase.)
|
ToString|  Format the
text entity using default grasshopper formatting logic.  (Overrides
GH_AnnotationBaseToString.)
|
Transform|
(Inherited from
GH_AnnotationBase.)
|
Write|  (Inherited
from GH_AnnotationBase.)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com