---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_YakDownloadFormEto_MissingObjectItem.htm
scraped_at: 2025-09-08T16:13:24.496794
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_YakDownloadFormEto.MissingObjectItem
Class](../html/T_Grasshopper_GUI_GH_YakDownloadFormEto_MissingObjectItem.htm
"GH_YakDownloadFormEto.MissingObjectItem Class")

[GH_YakDownloadFormEto.MissingObjectItem Constructor
](../html/M_Grasshopper_GUI_GH_YakDownloadFormEto_MissingObjectItem__ctor.htm
"GH_YakDownloadFormEto.MissingObjectItem Constructor ")

[MissingObjectItem
Properties](../html/Properties_T_Grasshopper_GUI_GH_YakDownloadFormEto_MissingObjectItem.htm
"MissingObjectItem Properties")

!Click or drag to
resize

# GH_YakDownloadFormEtoMissingObjectItem Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_YakDownloadFormEtoMissingObjectItem

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class MissingObjectItem

    Public NotInheritable Class MissingObjectItem

The GH_YakDownloadFormEtoMissingObjectItem type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_YakDownloadFormEtoMissingObjectItem|
Initializes a new instance of the GH_YakDownloadFormEtoMissingObjectItem class
Top

Properties

| Name| Description
---|---|---
|
Id|
|
Name|
|
Version|
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com