---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_LinearDimension.htm
scraped_at: 2025-09-08T16:20:58.488955
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_LinearDimension
Class](../html/T_Grasshopper_Kernel_Types_GH_LinearDimension.htm
"GH_LinearDimension Class")

[GH_LinearDimension Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_LinearDimension__ctor.htm
"GH_LinearDimension Constructor ")

[GH_LinearDimension
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_LinearDimension.htm
"GH_LinearDimension Properties")

[GH_LinearDimension
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_LinearDimension.htm
"GH_LinearDimension Methods")

[GH_LinearDimension
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_LinearDimension.htm
"GH_LinearDimension Fields")

!Click or drag to
resize

# GH_LinearDimension Class

---

Represents an implementation of a Rhino linear dimension.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooAnnotationBase
Grasshopper.Kernel.TypesGH_GeometricGooAnnotationBase
Grasshopper.Kernel.TypesGH_AnnotationBase
Grasshopper.Kernel.TypesGH_Dimension
Grasshopper.Kernel.TypesGH_LinearDimension

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_LinearDimension : GH_Dimension

    Public Class GH_LinearDimension
    	Inherits GH_Dimension

The GH_LinearDimension type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_LinearDimension|
Default constructor, creates an invalid linear dimension.
|
GH_LinearDimension(GH_LinearDimension)|
Create a duplicate of another GH_LinearDimension. This constructor also copies
reference data.
|
GH_LinearDimension(Guid)|
Create a new referenced linear dimension that references a Rhino dimension
with the specified ID.
|
GH_LinearDimension(LinearDimension)|
Create a duplicate of an existing linear dimension.
| GH_LinearDimension(LinearDimension,
ModelAnnotationStyle)|
Create a duplicate of an existing linear dimension.
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
(Inherited from
GH_AnnotationBase.)
|
ClippingBox|
(Inherited from
GH_AnnotationBase.)
|
IsGeometryLoaded|
Gets the load state of this annotation object. The annotation is considered to
be loaded when the local annotation instance is not null.  (Inherited from
GH_AnnotationBase.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  Gets the
validity of this dimension. If the dimension is referenced but cannot be
loaded, then the dimension is not valid.  (Inherited from
GH_AnnotationBase.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Inherited
from GH_AnnotationBase.)
|
ReferenceID|
(Inherited from
GH_AnnotationBase.)
|
Style|  (Inherited
from GH_AnnotationBase.)
|
TypeDescription|
(Overrides
GH_AnnotationBaseTypeDescription.)
|
TypeName|
(Overrides
GH_AnnotationBaseTypeName.)
|
Value|
|
ValueType|
(Overrides
GH_DimensionValueType.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
(Inherited from
GH_AnnotationBase.)
|
CastFrom|
Remote to Local caster function. This stuff is complex, don't concern yourself
with casting logic.  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToT(T)|
Local to Remote caster function. This stuff is complex, don't concern yourself
with casting logic.  (Inherited from
GH_AnnotationBase.)
|
CastToT(T)|  Local to
Remote caster function. This stuff is complex, don't concern yourself with
casting logic.  (Inherited from
GH_Dimension.)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|
Local to Remote caster function. This stuff is complex, don't concern yourself
with casting logic.  (Overrides
GH_DimensionCastToT(T).)
|
ClearCaches|
Clears all volatile caches for this instance. The boundingbox is cleared, and
if the annotation is referenced, the local instance of the annotation is
erased.  (Inherited from
GH_AnnotationBase.)
|
DrawViewportMeshes|
(Inherited from
GH_AnnotationBase.)
|
DrawViewportWires|
(Inherited from
GH_AnnotationBase.)
|
Duplicate|
(Inherited from
GH_AnnotationBase.)
|
DuplicateAnnotation|
Create a duplicate of this annotation.  (Overrides
GH_AnnotationBaseDuplicateAnnotation.)
|
DuplicateGeometry|
Create a duplicate of this annotation.  (Inherited from
GH_AnnotationBase.)
|
DuplicateLinearDimension|
Create a duplicate of this linear dimension.
|
EmitProxy|
(Inherited from GH_Dimension.)
|
GetBoundingBox|
(Inherited from
GH_AnnotationBase.)
|
GetOverrides|
(Inherited from
GH_AnnotationBase.)
|
LoadGeometry|
If the geometry is referenced and not yet loaded, attempts to load the
geometry.  (Inherited from
GH_AnnotationBase.)
|
LoadGeometry(RhinoDoc)|
If the annotation is referenced and not yet loaded, attempts to load the
leader.  (Inherited from
GH_AnnotationBase.)
|
Morph|  (Inherited
from GH_AnnotationBase.)
|
Read|  (Inherited
from GH_AnnotationBase.)
|
ScriptVariable|
(Inherited from
GH_AnnotationBase.)
|
SetOverrides|
(Inherited from
GH_AnnotationBase.)
|
ToString|
Format the dimension using default grasshopper formatting logic.  (Overrides
GH_AnnotationBaseToString.)
|
Transform|
(Inherited from
GH_AnnotationBase.)
|
Write|  (Inherited
from GH_AnnotationBase.)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com