---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_CentralSettings_RibbonVisibleChangedEventHandler.htm
scraped_at: 2025-09-08T16:11:37.052905
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper

[CentralSettings Class](../html/T_Grasshopper_CentralSettings.htm
"CentralSettings Class")

[CentralSettings.AuthorAddressChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_AuthorAddressChangedEventHandler.htm
"CentralSettings.AuthorAddressChangedEventHandler Delegate")

[CentralSettings.AuthorCompanyChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_AuthorCompanyChangedEventHandler.htm
"CentralSettings.AuthorCompanyChangedEventHandler Delegate")

[CentralSettings.AuthorCopyrightChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_AuthorCopyrightChangedEventHandler.htm
"CentralSettings.AuthorCopyrightChangedEventHandler Delegate")

[CentralSettings.AuthorEMailChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_AuthorEMailChangedEventHandler.htm
"CentralSettings.AuthorEMailChangedEventHandler Delegate")

[CentralSettings.AuthorNameChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_AuthorNameChangedEventHandler.htm
"CentralSettings.AuthorNameChangedEventHandler Delegate")

[CentralSettings.AuthorPhoneChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_AuthorPhoneChangedEventHandler.htm
"CentralSettings.AuthorPhoneChangedEventHandler Delegate")

[CentralSettings.AuthorWebsiteChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_AuthorWebsiteChangedEventHandler.htm
"CentralSettings.AuthorWebsiteChangedEventHandler Delegate")

[CentralSettings.CanvasFancyWiresChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_CanvasFancyWiresChangedEventHandler.htm
"CentralSettings.CanvasFancyWiresChangedEventHandler Delegate")

[CentralSettings.CanvasFullNamesChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_CanvasFullNamesChangedEventHandler.htm
"CentralSettings.CanvasFullNamesChangedEventHandler Delegate")

[CentralSettings.CanvasObjectIconsChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_CanvasObjectIconsChangedEventHandler.htm
"CentralSettings.CanvasObjectIconsChangedEventHandler Delegate")

[CentralSettings.CanvasObsoleteTagsChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_CanvasObsoleteTagsChangedEventHandler.htm
"CentralSettings.CanvasObsoleteTagsChangedEventHandler Delegate")

[CentralSettings.CanvasRadialMenuChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_CanvasRadialMenuChangedEventHandler.htm
"CentralSettings.CanvasRadialMenuChangedEventHandler Delegate")

[CentralSettings.CanvasToolbarChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_CanvasToolbarChangedEventHandler.htm
"CentralSettings.CanvasToolbarChangedEventHandler Delegate")

[CentralSettings.CanvasZuiZoomLevelChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_CanvasZuiZoomLevelChangedEventHandler.htm
"CentralSettings.CanvasZuiZoomLevelChangedEventHandler Delegate")

[CentralSettings.ComponentCascadeMenusChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_ComponentCascadeMenusChangedEventHandler.htm
"CentralSettings.ComponentCascadeMenusChangedEventHandler Delegate")

[CentralSettings.CreateSolutionUndoRecordChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_CreateSolutionUndoRecordChangedEventHandler.htm
"CentralSettings.CreateSolutionUndoRecordChangedEventHandler Delegate")

[CentralSettings.FormattingChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_FormattingChangedEventHandler.htm
"CentralSettings.FormattingChangedEventHandler Delegate")

[CentralSettings.LoadMechanismChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_LoadMechanismChangedEventHandler.htm
"CentralSettings.LoadMechanismChangedEventHandler Delegate")

[CentralSettings.LoadProtectionChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_LoadProtectionChangedEventHandler.htm
"CentralSettings.LoadProtectionChangedEventHandler Delegate")

[CentralSettings.PanelDefaultFontChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_PanelDefaultFontChangedEventHandler.htm
"CentralSettings.PanelDefaultFontChangedEventHandler Delegate")

[CentralSettings.PreviewBumpZBufferChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_PreviewBumpZBufferChangedEventHandler.htm
"CentralSettings.PreviewBumpZBufferChangedEventHandler Delegate")

[CentralSettings.PreviewGumballsChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_PreviewGumballsChangedEventHandler.htm
"CentralSettings.PreviewGumballsChangedEventHandler Delegate")

[CentralSettings.PreviewMeshEdgesChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_PreviewMeshEdgesChangedEventHandler.htm
"CentralSettings.PreviewMeshEdgesChangedEventHandler Delegate")

[CentralSettings.PreviewPlaneRadiusChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_PreviewPlaneRadiusChangedEventHandler.htm
"CentralSettings.PreviewPlaneRadiusChangedEventHandler Delegate")

[CentralSettings.PreviewPointStyleChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_PreviewPointStyleChangedEventHandler.htm
"CentralSettings.PreviewPointStyleChangedEventHandler Delegate")

[CentralSettings.PruderyLevelChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_PruderyLevelChangedEventHandler.htm
"CentralSettings.PruderyLevelChangedEventHandler Delegate")

[CentralSettings.RibbonAllIconsChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_RibbonAllIconsChangedEventHandler.htm
"CentralSettings.RibbonAllIconsChangedEventHandler Delegate")

[CentralSettings.RibbonDrawTabIconsChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_RibbonDrawTabIconsChangedEventHandler.htm
"CentralSettings.RibbonDrawTabIconsChangedEventHandler Delegate")

[CentralSettings.RibbonSeparatorsChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_RibbonSeparatorsChangedEventHandler.htm
"CentralSettings.RibbonSeparatorsChangedEventHandler Delegate")

[CentralSettings.RibbonVisibleChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_RibbonVisibleChangedEventHandler.htm
"CentralSettings.RibbonVisibleChangedEventHandler Delegate")

[CentralSettings.TemplateFileChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_TemplateFileChangedEventHandler.htm
"CentralSettings.TemplateFileChangedEventHandler Delegate")

[CentralSettings.TooltipWiggleRadiusChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_TooltipWiggleRadiusChangedEventHandler.htm
"CentralSettings.TooltipWiggleRadiusChangedEventHandler Delegate")

[CentralSettings.UiScaleChangedEventHandler
Delegate](../html/T_Grasshopper_CentralSettings_UiScaleChangedEventHandler.htm
"CentralSettings.UiScaleChangedEventHandler Delegate")

[DataTree(T) Class](../html/T_Grasshopper_DataTree_1.htm "DataTree\(T\)
Class")

[DataTree(T).DuplicateT
Delegate](../html/T_Grasshopper_DataTree_1_DuplicateT.htm
"DataTree\(T\).DuplicateT Delegate")

[EtoExtensions Class](../html/T_Grasshopper_EtoExtensions.htm "EtoExtensions
Class")

[EtoExtensions.EtoWin32Window
Class](../html/T_Grasshopper_EtoExtensions_EtoWin32Window.htm
"EtoExtensions.EtoWin32Window Class")

Folders Class

Instances Class

[Instances.CanvasCreatedEventHandler
Delegate](../html/T_Grasshopper_Instances_CanvasCreatedEventHandler.htm
"Instances.CanvasCreatedEventHandler Delegate")

[Instances.CanvasDestroyedEventHandler
Delegate](../html/T_Grasshopper_Instances_CanvasDestroyedEventHandler.htm
"Instances.CanvasDestroyedEventHandler Delegate")

Tracing Class

Utility Class

Versioning Class

!Click or drag to
resize

# CentralSettingsRibbonVisibleChangedEventHandler Delegate

---

**Namespace:** Grasshopper
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public delegate void RibbonVisibleChangedEventHandler()

    Public Delegate Sub RibbonVisibleChangedEventHandler

See Also

#### Reference

Grasshopper Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com