---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_TagArtists_GH_TagArtist_WirePainter.htm
scraped_at: 2025-09-08T16:14:57.918623
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas.TagArtists](../html/N_Grasshopper_GUI_Canvas_TagArtists.htm
"Grasshopper.GUI.Canvas.TagArtists")

[GH_TagArtist_WirePainter
Class](../html/T_Grasshopper_GUI_Canvas_TagArtists_GH_TagArtist_WirePainter.htm
"GH_TagArtist_WirePainter Class")

[GH_TagArtist_WirePainter Constructor
](../html/M_Grasshopper_GUI_Canvas_TagArtists_GH_TagArtist_WirePainter__ctor.htm
"GH_TagArtist_WirePainter Constructor ")

[GH_TagArtist_WirePainter
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_TagArtists_GH_TagArtist_WirePainter.htm
"GH_TagArtist_WirePainter Properties")

[GH_TagArtist_WirePainter
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_TagArtists_GH_TagArtist_WirePainter.htm
"GH_TagArtist_WirePainter Methods")

!Click or drag to
resize

# GH_TagArtist_WirePainter Class

---

IGH_TagArtist implementation for drawing individual wires.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.Canvas.TagArtistsGH_TagArtist
Grasshopper.GUI.Canvas.TagArtistsGH_TagArtist_WirePainter

**Namespace:**
Grasshopper.GUI.Canvas.TagArtists
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_TagArtist_WirePainter : GH_TagArtist

    Public Class GH_TagArtist_WirePainter
    	Inherits GH_TagArtist

The GH_TagArtist_WirePainter type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_TagArtist_WirePainter|
Initializes a new instance of the GH_TagArtist_WirePainter class
Top

Properties

| Name| Description
---|---|---
|
ID|  Gets the ID of
this TagArtist object.  (Inherited from
GH_TagArtist.)
!Static
member|
WirePainter_ID|
Top

Methods

| Name| Description
---|---|---
|
Paint|
(Overrides GH_TagArtistPaint(GH_Canvas,
GH_CanvasChannel).)
Top

See Also

#### Reference

Grasshopper.GUI.Canvas.TagArtists
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com