---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Documentation_GH_Parser.htm
scraped_at: 2025-09-08T16:12:01.161570
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Documentation](../html/N_Grasshopper_Documentation.htm
"Grasshopper.Documentation")

[GH_Parser Class](../html/T_Grasshopper_Documentation_GH_Parser.htm "GH_Parser
Class")

[GH_Parser
Properties](../html/Properties_T_Grasshopper_Documentation_GH_Parser.htm
"GH_Parser Properties")

[GH_Parser Methods](../html/Methods_T_Grasshopper_Documentation_GH_Parser.htm
"GH_Parser Methods")

!Click or drag to
resize

# GH_Parser Class

---

Provides parsing methods for the Grasshopper Markdown flavour.

Inheritance Hierarchy

SystemObject
Grasshopper.DocumentationGH_Parser

**Namespace:** Grasshopper.Documentation
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Parser

    Public Class GH_Parser

The GH_Parser type exposes the following members.

Properties

| Name| Description
---|---|---
!Static
member|
Whitespace|  Gets an
array of characters that are considered to be whitespace. At the moment, this
array contains the space char and the tab char, it does not contain feeds or
breaks.
Top

Methods

| Name| Description
---|---|---
|
IsChapterHeaderLine|
Test whether a line represents a chapter header underline. Chapter header
underlines contain at least 4 consecutive equals symbols preceded or followed
by any amount of white space.
|
IsCommentLine|
Test whether a line is a comment. Commented lines begin with double slashes
(//) and are ignored during parsing.
|
IsLinkLine(String)|
Test whether a line represents a referenced link target. Note; this is a quick
check. The link might still be invalid, use the IsLinkLine overload to include
validity checks.
|
IsLinkLine(String, String, String,
String)|  Test
whether a line represents a referenced link target.
|
IsListLine|  Test
whether a line contains a list item.
|
IsParagraphHeaderLine|
Test whether a line represents a paragraph header underline. Paragraph header
underlines contain at least 4 consecutive dashes preceded or followed by any
amount of white space.
|
IsQuoteLine|  Test
whether a line is a block quote line. Block quotes start with a larger than
symbol.
|
StringToFragment|
Parse a block of text and return it as an interpreted IGH_Fragment.
Top

See Also

#### Reference

Grasshopper.Documentation Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com