---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_DigitScroller.htm
scraped_at: 2025-09-08T16:12:24.259696
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_DigitScroller Class](../html/T_Grasshopper_GUI_GH_DigitScroller.htm
"GH_DigitScroller Class")

[GH_DigitScroller Constructor
](../html/M_Grasshopper_GUI_GH_DigitScroller__ctor.htm "GH_DigitScroller
Constructor ")

[GH_DigitScroller
Properties](../html/Properties_T_Grasshopper_GUI_GH_DigitScroller.htm
"GH_DigitScroller Properties")

[GH_DigitScroller
Methods](../html/Methods_T_Grasshopper_GUI_GH_DigitScroller.htm
"GH_DigitScroller Methods")

[GH_DigitScroller
Events](../html/Events_T_Grasshopper_GUI_GH_DigitScroller.htm
"GH_DigitScroller Events")

!Click or drag to
resize

# GH_DigitScroller Class

---

Provides the standard Grasshopper Digit scroller as a winforms Control.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsUserControl
GH_TextInputBaseControl
Grasshopper.GUIGH_DigitScroller

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DigitScroller : GH_TextInputBaseControl

    Public Class GH_DigitScroller
    	Inherits GH_TextInputBaseControl

The GH_DigitScroller type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DigitScroller| Initializes
a new instance of the GH_DigitScroller class
Top

Properties

| Name| Description
---|---|---
|
AllowRadixDrag|  Gets
or sets whether the radix symbol can be dragged.
|
AllowTextInput|  Gets
or sets whether the control accepts text input override.
|
Amplify|  Gets or sets
whether vertical mouse movement ought to be amplified.
|
DecimalPlaces|  Gets
or sets the number of decimal places.
|
DigitAlign|  Gets or sets
the digit align mode
|
Digits|  Gets or sets the
number of digits displayed in the scroller.
|
DigitScroller|  Gets
the internal scroller object.
|
Epsilon|  Gets the smallest
possible change with the current settings.
|
MaximumValue|  Gets or
sets the upper bound of the scroll value.
|
MinimumValue|  Gets or
sets the lower bound of the scroll value.
|
Prefix|  Gets or sets the
prefix text
|
Radix|  Gets or sets the radix
point index.
|
Suffix|  Gets or sets the
prefix text
|
Value|  Gets or sets the value
of this scroller.
Top

Methods

| Name| Description
---|---|---
|
Input_Assign|
(Overrides GH_TextInputBaseControl.Input_Assign(String).)
|
Input_Parse|  (Overrides
GH_TextInputBaseControl.Input_Parse(String).)
|
Input_Supply|
(Overrides GH_TextInputBaseControl.Input_Supply.)
|
OnPaint|  (Overrides
[ControlOnPaint(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.control.onpaint#system-
windows-forms-control-onpaint\(system-windows-forms-painteventargs\)).)
|
OnPaintBackground|
(Overrides
[ScrollableControlOnPaintBackground(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.scrollablecontrol.onpaintbackground#system-
windows-forms-scrollablecontrol-onpaintbackground\(system-windows-forms-
painteventargs\)).)
Top

Events

| Name| Description
---|---|---
|
ValueChanged|
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com