---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Render_ModelRenderSkylight_Attributes.htm
scraped_at: 2025-09-08T16:24:42.428160
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Render](../html/N_Grasshopper_Rhinoceros_Render.htm
"Grasshopper.Rhinoceros.Render")

[ModelRenderSkylight.Attributes
Class](../html/T_Grasshopper_Rhinoceros_Render_ModelRenderSkylight_Attributes.htm
"ModelRenderSkylight.Attributes Class")

[ModelRenderSkylight.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_Render_ModelRenderSkylight_Attributes__ctor.htm
"ModelRenderSkylight.Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Render_ModelRenderSkylight_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Render_ModelRenderSkylight_Attributes.htm
"Attributes Methods")

!Click or drag to
resize

# ModelRenderSkylightAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
Grasshopper.Rhinoceros.RenderModelRenderSkylightAttributes

**Namespace:**
Grasshopper.Rhinoceros.Render
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Attributes : ModelContentAttributes,
    	IEquatable<ModelRenderSkylightAttributes>

    Public NotInheritable Class Attributes
    	Inherits ModelContentAttributes
    	Implements IEquatable(Of ModelRenderSkylightAttributes)

The ModelRenderSkylightAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelRenderSkylightAttributes|
Initializes a new instance of the ModelRenderSkylightAttributes class
Top

Properties

| Name| Description
---|---|---
|
Enabled|
|
Environment|
|
EnvironmentOverride|
|
Name|  The last
component of the element Path.  (Inherited from
ModelContentAttributes.)
|
Notes|
(Inherited from
ModelContentAttributes.)
|
Parent|  Path
of the parent element in 'Root::Parent' format if nested.  (Inherited from
ModelContentAttributes.)
|
Path|  Full
content path in 'Root::Parent::Name' format if is nested.  (Inherited from
ModelContentAttributes.)
|
Tags|  (Inherited
from
ModelContentAttributes.)
Top

Methods

| Name| Description
---|---|---
|
Clone|  (Inherited
from
ModelDataAttributes.)
|
Equals(Object)|
(Inherited from
ModelContentAttributes.)
|
GetHashCode|
(Inherited from
ModelContentAttributes.)
|
ToDetails|
(Overrides
ModelDataAttributesToDetails.)
|
ToModelData|
(Overrides
ModelDataAttributesToModelData.)
|
ToString|
(Inherited from
ModelContentAttributes.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Render Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com