---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_ModelAnnotationStyle.htm
scraped_at: 2025-09-08T16:23:03.017250
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations](../html/N_Grasshopper_Rhinoceros_Annotations.htm
"Grasshopper.Rhinoceros.Annotations")

[ModelAnnotationStyle
Class](../html/T_Grasshopper_Rhinoceros_Annotations_ModelAnnotationStyle.htm
"ModelAnnotationStyle Class")

[ModelAnnotationStyle Constructor
](../html/Overload_Grasshopper_Rhinoceros_Annotations_ModelAnnotationStyle__ctor.htm
"ModelAnnotationStyle Constructor ")

[ModelAnnotationStyle
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_ModelAnnotationStyle.htm
"ModelAnnotationStyle Properties")

[ModelAnnotationStyle
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_ModelAnnotationStyle.htm
"ModelAnnotationStyle Methods")

[ModelAnnotationStyle Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Annotations_ModelAnnotationStyle.htm
"ModelAnnotationStyle Type Conversions")

!Click or drag to
resize

# ModelAnnotationStyle Class

---

Represents a Rhino model annotation style. Wraps the functionality of the
DimensionStyle type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.RhinocerosModelComponentContent
Grasshopper.Rhinoceros.AnnotationsModelAnnotationStyle

**Namespace:**
Grasshopper.Rhinoceros.Annotations
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelAnnotationStyle : ModelComponentContent,
    	IGH_BakeAwareData

    Public NotInheritable Class ModelAnnotationStyle
    	Inherits ModelComponentContent
    	Implements IGH_BakeAwareData

The ModelAnnotationStyle type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelAnnotationStyle|
Initializes a new instance of the ModelAnnotationStyle class
|
ModelAnnotationStyle(ModelAnnotationStyleAttributes)|
Initializes a new instance of the ModelAnnotationStyle class
|
ModelAnnotationStyle(DimensionStyle)|
Initializes a new instance of the ModelAnnotationStyle class
|
ModelAnnotationStyle(Guid)|
Initializes a new instance of the ModelAnnotationStyle class
Top

Properties

| Name| Description
---|---|---
|
ArrowSettings|
|
DimensionScale|
|
DimensionSettings|
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
LeaderSettings|
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
|
TextSettings|
|
ToleranceSettings|
|
UnitsSettings|
!Static
member|
Unset|
|
UserText|
(Inherited from
ModelComponentContent.)
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelContentCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelAnnotationStyleAttributes to
ModelAnnotationStyle)|
!Static
member| (DimensionStyle to
ModelAnnotationStyle)|
!Static
member| (String to
ModelAnnotationStyle)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com