---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Render_ModelRenderMaterial.htm
scraped_at: 2025-09-08T16:24:39.436070
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Render](../html/N_Grasshopper_Rhinoceros_Render.htm
"Grasshopper.Rhinoceros.Render")

[ModelRenderMaterial
Class](../html/T_Grasshopper_Rhinoceros_Render_ModelRenderMaterial.htm
"ModelRenderMaterial Class")

[ModelRenderMaterial Constructor
](../html/Overload_Grasshopper_Rhinoceros_Render_ModelRenderMaterial__ctor.htm
"ModelRenderMaterial Constructor ")

[ModelRenderMaterial
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Render_ModelRenderMaterial.htm
"ModelRenderMaterial Properties")

[ModelRenderMaterial
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Render_ModelRenderMaterial.htm
"ModelRenderMaterial Methods")

[ModelRenderMaterial Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Render_ModelRenderMaterial.htm
"ModelRenderMaterial Type Conversions")

!Click or drag to
resize

# ModelRenderMaterial Class

---

Represents a Rhino render material. Wraps the functionality of the
RenderMaterial type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.Rhinoceros.RenderModelRenderContent
Grasshopper.Rhinoceros.RenderModelRenderMaterial

**Namespace:**
Grasshopper.Rhinoceros.Render
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelRenderMaterial : ModelRenderContent,
    	IGH_BakeAwareData

    Public NotInheritable Class ModelRenderMaterial
    	Inherits ModelRenderContent
    	Implements IGH_BakeAwareData

The ModelRenderMaterial type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelRenderMaterial|
Initializes a new instance of the ModelRenderMaterial class
|
ModelRenderMaterial(ModelRenderMaterialAttributes)|
Initializes a new instance of the ModelRenderMaterial class
|
ModelRenderMaterial(Guid)|
Initializes a new instance of the ModelRenderMaterial class
|
ModelRenderMaterial(Material)|
Initializes a new instance of the ModelRenderMaterial class
|
ModelRenderMaterial(RenderMaterial)|
Initializes a new instance of the ModelRenderMaterial class
Top

Properties

| Name| Description
---|---|---
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
Name|
(Overrides
ModelContentName.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
|
TypeName|
(Overrides
ModelRenderContentTypeName.)
!Static
member|
Unset|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
CastToT(T)|
(Overrides
ModelContentCastToT(T).)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelRenderMaterialAttributes to
ModelRenderMaterial)|
!Static
member| (ColorRGBA to
ModelRenderMaterial)|
!Static
member| (Material to
ModelRenderMaterial)|
!Static
member| (RenderMaterial to
ModelRenderMaterial)|
!Static
member| (String to
ModelRenderMaterial)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Render Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com