---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_RotationalFrame.htm
scraped_at: 2025-09-08T16:13:00.383058
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_RotationalFrame
Structure](../html/T_Grasshopper_GUI_GH_RotationalFrame.htm
"GH_RotationalFrame Structure")

[GH_RotationalFrame
Properties](../html/Properties_T_Grasshopper_GUI_GH_RotationalFrame.htm
"GH_RotationalFrame Properties")

!Click or drag to
resize

# GH_RotationalFrame Structure

---

Represents a single frame in a rotational tuning history.

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct GH_RotationalFrame

    Public Structure GH_RotationalFrame

The GH_RotationalFrame type exposes the following members.

Properties

| Name| Description
---|---|---
|
Angle|  Gets or sets the
local angle of the rotation event.
|
Pivot|  Gets or sets the
pivot of the event.
|
Point|  Gets or sets the
location of the rotation event.
|
Time|  Gets or sets the time
when the event was recorded.
Top

Remarks

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com