---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Expressions_GH_ParserOperator.htm
scraped_at: 2025-09-08T16:19:38.146855
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Expressions](../html/N_Grasshopper_Kernel_Expressions.htm
"Grasshopper.Kernel.Expressions")

[GH_ParserOperator
Class](../html/T_Grasshopper_Kernel_Expressions_GH_ParserOperator.htm
"GH_ParserOperator Class")

[GH_ParserOperator Constructor
](../html/M_Grasshopper_Kernel_Expressions_GH_ParserOperator__ctor.htm
"GH_ParserOperator Constructor ")

[GH_ParserOperator
Methods](../html/Methods_T_Grasshopper_Kernel_Expressions_GH_ParserOperator.htm
"GH_ParserOperator Methods")

[GH_ParserOperator
Fields](../html/Fields_T_Grasshopper_Kernel_Expressions_GH_ParserOperator.htm
"GH_ParserOperator Fields")

!Click or drag to
resize

# GH_ParserOperator Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.ExpressionsGH_ParserOperator

**Namespace:**
Grasshopper.Kernel.Expressions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ParserOperator : IComparable<GH_ParserOperator>

    Public Class GH_ParserOperator
    	Implements IComparable(Of GH_ParserOperator)

The GH_ParserOperator type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ParserOperator|
Initializes a new instance of the GH_ParserOperator class
Top

Methods

| Name| Description
---|---|---
|
CompareTo|
|
Equals|
(Overrides
[ObjectEquals(Object)](https://docs.microsoft.com/dotnet/api/system.object.equals#system-
object-equals\(system-object\)).)
Top

Fields

| Name| Description
---|---|---
|
m_description|
|
m_name|
|
m_precedence|
|
m_symbol|
|
m_type|
Top

See Also

#### Reference

Grasshopper.Kernel.Expressions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com