---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_ObjectDisplayColor_Value.htm
scraped_at: 2025-09-08T16:23:32.123254
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[ObjectDisplayColor.Value
Structure](../html/T_Grasshopper_Rhinoceros_Display_ObjectDisplayColor_Value.htm
"ObjectDisplayColor.Value Structure")

[Value Constructor
](../html/Overload_Grasshopper_Rhinoceros_Display_ObjectDisplayColor_Value__ctor.htm
"Value Constructor ")

[Value
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_ObjectDisplayColor_Value.htm
"Value Properties")

[Value
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_ObjectDisplayColor_Value.htm
"Value Methods")

[Value Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Display_ObjectDisplayColor_Value.htm
"Value Type Conversions")

!Click or drag to
resize

# ObjectDisplayColorValue Structure

---

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct Value : GH_ISerializable, IEquatable<ObjectDisplayColorValue>,
    	IComparable<ObjectDisplayColorValue>, IComparable

    Public Structure Value
    	Implements GH_ISerializable, IEquatable(Of ObjectDisplayColorValue),
    	IComparable(Of ObjectDisplayColorValue), IComparable

The ObjectDisplayColorValue type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectDisplayColorValue(ModelColor)|
Initializes a new instance of the ObjectDisplayColorValue class
|
ObjectDisplayColorValue(ObjectColorSource)|
Initializes a new instance of the ObjectDisplayColorValue class
|
ObjectDisplayColorValue(ObjectColorSource,
ModelColor)|
Initializes a new instance of the ObjectDisplayColorValue class
Top

Properties

| Name| Description
---|---|---
!Static
member|
ByLayer|
!Static
member|
ByMaterial|
!Static
member|
ByParent|
|
Color|
|
Source|
Top

Methods

| Name| Description
---|---|---
|
CompareTo(Object)|
|
CompareTo(ObjectDisplayColorValue)|
|
Deconstruct|
|
Equals(Object)|
(Overrides
[ValueTypeEquals(Object)](https://docs.microsoft.com/dotnet/api/system.valuetype.equals#system-
valuetype-equals\(system-object\)).)
|
Equals(ObjectDisplayColorValue)|
|
GetHashCode|
(Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
|
ToString|
(Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelColor to
ObjectDisplayColorValue)|
!Static
member| (ObjectColorSource to
ObjectDisplayColorValue)|
!Static
member| (ObjectDisplayColorValue to
ModelColor)|
!Static
member| (ObjectDisplayColorValue to
ObjectColorSource)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com