---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_GDI_Util.htm
scraped_at: 2025-09-08T16:12:41.326583
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_GDI_Util Class](../html/T_Grasshopper_GUI_GH_GDI_Util.htm "GH_GDI_Util
Class")

[GH_GDI_Util Methods](../html/Methods_T_Grasshopper_GUI_GH_GDI_Util.htm
"GH_GDI_Util Methods")

!Click or drag to
resize

# GH_GDI_Util Class

---

Contains some global function for filleting corners of GDI objects.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_GDI_Util

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_GDI_Util

    Public NotInheritable Class GH_GDI_Util

The GH_GDI_Util type exposes the following members.

Methods

| Name| Description
---|---|---
|
BoxUnion|  Create the outline of
a set of boxes.
|
FilletBoxOutline|
Fillet all the corners of the combined outline of a set of rectangles.
|
FilletPolyline(Point,
Int32)|  Fillet all the
corners of a freeform outline.
|
FilletPolyline(PointF,
Single)|  Fillet all the
corners of a freeform outline.
|
FilletRectangle|  Create
a rectangle with filleted corners.
|
Freeform_Blob(IEnumerableRectangleF, Int32,
Double)|  Create a meta-ball
outline for a set of rectangles.
|
Freeform_Blob(IEnumerableRectangleF, Int32, Double, FieldSolver,
Double)|  Create a meta-
ball outline for a set of rectangles.
|
SimplifyBoxes|  Create a
simplified collection of Rectangles that describe the same union space as the
supplied rectangles.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com