---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Point.htm
scraped_at: 2025-09-08T16:21:16.564128
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Point Class](../html/T_Grasshopper_Kernel_Types_GH_Point.htm "GH_Point
Class")

[GH_Point Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Point__ctor.htm "GH_Point
Constructor ")

[GH_Point
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Point.htm
"GH_Point Properties")

[GH_Point Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Point.htm
"GH_Point Methods")

!Click or drag to
resize

# GH_Point Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_Point

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Point : IGH_GeometricGoo, IGH_BakeAwareData,
    	IGH_PreviewData

    Public Class GH_Point
    	Implements IGH_GeometricGoo, IGH_BakeAwareData, IGH_PreviewData

The GH_Point type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Point| Initializes a new
instance of the GH_Point class
|
GH_Point(GH_Point)|
Initializes a new instance of the GH_Point class
|
GH_Point(Guid)| Initializes
a new instance of the GH_Point class
|
GH_Point(Point3d)|
Initializes a new instance of the GH_Point class
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
|
ClippingBox|
|
IsGeometryLoaded|
|
IsReferencedGeometry|
|
IsValid|
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.
|
ReferenceData|  Gets
or sets the reference data of this point geometry.
|
ReferenceID|
|
TypeDescription|
|
TypeName|
|
Value|
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
|
CastFrom|
|
CastToT|
|
ClearCaches|
|
CreateFromCoordinate|
Create a new point geometry instance based on a fixed coordinate
|
CreateFromCurveDistance|
Create new point geometry instance based on a curve distance parameter
|
CreateFromCurveRatio|
Create new point geometry instance based on a curve parameter ratio
|
CreateFromEdgeDistance|
Create new point geometry instance based on a curve distance parameter
|
CreateFromEdgeRatio|
Create new point geometry instance based on an edge parameter ratio
|
CreateFromPointObject|
Create a new point geometry instance based on point object ID. Technically
this now also accepts Dot object IDs.
|
CreateFromSurfaceParam|
Create new point geometry instance based on a curve distance parameter
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|
|
DuplicateGeometry|
|
DuplicatePoint|
|
EmitProxy|
|
EnsureReferenceData|
Creates new Reference data if it doesn't already exists
|
GetBoundingBox|
|
LoadGeometry|
|
LoadGeometry(RhinoDoc)|
|
Morph|
|
Read|
|
ReferenceCurve|
|
ReferenceCurve(RhinoObject)|
|
ReferenceIndex|
Retrieve the index of the point reference data.
|
ReferenceIndex(Int32)|
Sets the index of the point reference data.
|
ReferenceParam(Int32)|
Retrieve the indexed param of the point reference data.
| ReferenceParam(Int32,
Double)|  Sets the
index of the point reference data.
|
ReferencesCurve|
Returns true if this point is based on a curve reference
|
ReferencesEdge|
Returns True if this point is based on an edge reference
|
ReferenceSurface|
|
ReferenceType|
Retrieve the reference type of this point object.
|
ReferenceType(GH_PointRefType)|
Sets the type of the point reference data.
|
ScriptVariable|
|
SetReferenceParams|
Sets both param values of the point reference
|
ShowReferenceDialog|
|
ShowReferenceDialog(IWin32Window)|
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Transform|
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com