---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLinetype_Value.htm
scraped_at: 2025-09-08T16:23:59.224402
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Drafting](../html/N_Grasshopper_Rhinoceros_Drafting.htm
"Grasshopper.Rhinoceros.Drafting")

[ObjectDraftingLinetype.Value
Structure](../html/T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLinetype_Value.htm
"ObjectDraftingLinetype.Value Structure")

[Value Constructor
](../html/Overload_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLinetype_Value__ctor.htm
"Value Constructor ")

[Value
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLinetype_Value.htm
"Value Properties")

[Value
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLinetype_Value.htm
"Value Methods")

[Value Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLinetype_Value.htm
"Value Type Conversions")

!Click or drag to
resize

# ObjectDraftingLinetypeValue Structure

---

**Namespace:**
Grasshopper.Rhinoceros.Drafting
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct Value : GH_ISerializable, IEquatable<ObjectDraftingLinetypeValue>,
    	IComparable<ObjectDraftingLinetypeValue>, IComparable

    Public Structure Value
    	Implements GH_ISerializable, IEquatable(Of ObjectDraftingLinetypeValue),
    	IComparable(Of ObjectDraftingLinetypeValue), IComparable

The ObjectDraftingLinetypeValue type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectDraftingLinetypeValue(ModelLinetype)|
Initializes a new instance of the ObjectDraftingLinetypeValue class
|
ObjectDraftingLinetypeValue(ObjectLinetypeSource)|
Initializes a new instance of the ObjectDraftingLinetypeValue class
|
ObjectDraftingLinetypeValue(ObjectLinetypeSource,
ModelLinetype)|
Initializes a new instance of the ObjectDraftingLinetypeValue class
Top

Properties

| Name| Description
---|---|---
!Static
member|
ByLayer|
!Static
member|
ByParent|
!Static
member|
Continuous|
|
Linetype|
|
Source|
Top

Methods

| Name| Description
---|---|---
|
CompareTo(Object)|
|
CompareTo(ObjectDraftingLinetypeValue)|
|
Deconstruct|
|
Equals(Object)|
(Overrides
[ValueTypeEquals(Object)](https://docs.microsoft.com/dotnet/api/system.valuetype.equals#system-
valuetype-equals\(system-object\)).)
|
Equals(ObjectDraftingLinetypeValue)|
|
GetHashCode|
(Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
|
ToString|
(Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelLinetype to
ObjectDraftingLinetypeValue)|
!Static
member| (ObjectLinetypeSource to
ObjectDraftingLinetypeValue)|
!Static
member| (ObjectDraftingLinetypeValue to
ModelLinetype)|
!Static
member| (ObjectDraftingLinetypeValue to
ObjectLinetypeSource)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Drafting
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com