---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Plugin_GH_PluginUtil.htm
scraped_at: 2025-09-08T16:22:26.839268
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Plugin

[GH_PluginUtil Class](../html/T_Grasshopper_Plugin_GH_PluginUtil.htm
"GH_PluginUtil Class")

[GH_PluginUtil Methods](../html/Methods_T_Grasshopper_Plugin_GH_PluginUtil.htm
"GH_PluginUtil Methods")

!Click or drag to
resize

# GH_PluginUtil Class

---

Grasshopper plugin utility class. This class exports some static (Shared in
VB) methods to do with plugin loading and unloading.

Inheritance Hierarchy

SystemObject
Grasshopper.PluginGH_PluginUtil

**Namespace:** Grasshopper.Plugin
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_PluginUtil

    Public NotInheritable Class GH_PluginUtil

The GH_PluginUtil type exposes the following members.

Methods

| Name| Description
---|---|---
|
BringRhinoToTop|
Bring the Rhino window to the top of the stack.
|
BringWindowToTop|
|
FocusOnRhino|  Set the
focus to the Rhino command line.
|
SendKeyCodeToRhino(Char)|
Send a key-code to the Rhino command line.
|
SendKeyCodeToRhino(Int32)|
Send a key-code to the Rhino command line.
|
SendKeyCodeToRhino(String)|
Send a string of characters to the Rhino command line.
|
SendMessage|
|
SetFocus|
Top

See Also

#### Reference

Grasshopper.Plugin Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com