---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Circle_GH_CircleProxy.htm
scraped_at: 2025-09-08T16:20:25.343972
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Circle.GH_CircleProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Circle_GH_CircleProxy.htm
"GH_Circle.GH_CircleProxy Class")

[GH_Circle.GH_CircleProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Circle_GH_CircleProxy__ctor.htm
"GH_Circle.GH_CircleProxy Constructor ")

[GH_CircleProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Circle_GH_CircleProxy.htm
"GH_CircleProxy Properties")

[GH_CircleProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Circle_GH_CircleProxy.htm
"GH_CircleProxy Methods")

!Click or drag to
resize

# GH_CircleGH_CircleProxy Class

---

Proxy description of GH_Circle class. This class is used by the Generic
Multivalue interfaces.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Circle
Grasshopper.Kernel.TypesGH_CircleGH_CircleProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_CircleProxy : GH_GooProxy<GH_Circle>

    Public Class GH_CircleProxy
    	Inherits GH_GooProxy(Of GH_Circle)

The GH_CircleGH_CircleProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_CircleGH_CircleProxy|
Initializes a new instance of the GH_CircleGH_CircleProxy class
Top

Properties

| Name| Description
---|---|---
|
Area|
|
Center|
|
Circumference|
|
Normal|
|
Radius|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com