---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_PatternMatching.htm
scraped_at: 2025-09-08T16:17:24.536447
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_PatternMatching Class](../html/T_Grasshopper_Kernel_GH_PatternMatching.htm
"GH_PatternMatching Class")

[GH_PatternMatching
Methods](../html/Methods_T_Grasshopper_Kernel_GH_PatternMatching.htm
"GH_PatternMatching Methods")

!Click or drag to
resize

# GH_PatternMatching Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_PatternMatching

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_PatternMatching

    Public NotInheritable Class GH_PatternMatching

The GH_PatternMatching type exposes the following members.

Methods

| Name| Description
---|---|---
|
Contains|
|
EndsWith|
|
Equals|
|
IsMatch|
|
MatchRegex|
|
MatchWildcards|
|
StartsWith|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com