---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_PreviewWireArgs.htm
scraped_at: 2025-09-08T16:17:40.613746
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_PreviewWireArgs Class](../html/T_Grasshopper_Kernel_GH_PreviewWireArgs.htm
"GH_PreviewWireArgs Class")

[GH_PreviewWireArgs Constructor
](../html/M_Grasshopper_Kernel_GH_PreviewWireArgs__ctor.htm
"GH_PreviewWireArgs Constructor ")

[GH_PreviewWireArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_PreviewWireArgs.htm
"GH_PreviewWireArgs Properties")

!Click or drag to
resize

# GH_PreviewWireArgs Class

---

This class is passed to objects that implement IGH_PreviewData during wire
drawing operations.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_PreviewWireArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PreviewWireArgs

    Public Class GH_PreviewWireArgs

The GH_PreviewWireArgs type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PreviewWireArgs|
Initializes a new instance of the GH_PreviewWireArgs class
Top

Properties

| Name| Description
---|---|---
|
Color|  Gets the color in
which wires ought to be drawn.
|
Pipeline|  Gets the
Display Pipeline we're currently drawing with.
|
Thickness|  Gets the
thickness in which wires ought to be drawn.
|
Viewport|  Gets the
Viewport in which we're currently drawing.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com