---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_ModelStandardViewport_Attributes.htm
scraped_at: 2025-09-08T16:23:25.090768
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[ModelStandardViewport.Attributes
Class](../html/T_Grasshopper_Rhinoceros_Display_ModelStandardViewport_Attributes.htm
"ModelStandardViewport.Attributes Class")

[ModelStandardViewport.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_Display_ModelStandardViewport_Attributes__ctor.htm
"ModelStandardViewport.Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_ModelStandardViewport_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_ModelStandardViewport_Attributes.htm
"Attributes Methods")

!Click or drag to
resize

# ModelStandardViewportAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
Grasshopper.Rhinoceros.DisplayModelViewportAttributes
Grasshopper.Rhinoceros.DisplayModelStandardViewportAttributes

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Attributes : ModelViewportAttributes,
    	IEquatable<ModelStandardViewportAttributes>

    Public NotInheritable Class Attributes
    	Inherits ModelViewportAttributes
    	Implements IEquatable(Of ModelStandardViewportAttributes)

The ModelStandardViewportAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelStandardViewportAttributes|
Initializes a new instance of the ModelStandardViewportAttributes class
Top

Properties

| Name| Description
---|---|---
|
DisplayMode|
(Inherited from
ModelViewportAttributes.)
|
Name|  The last
component of the element Path.  (Inherited from
ModelContentAttributes.)
|
Notes|
(Inherited from
ModelContentAttributes.)
|
Parent|  Path
of the parent element in 'Root::Parent' format if nested.  (Inherited from
ModelContentAttributes.)
|
Path|  Full
content path in 'Root::Parent::Name' format if is nested.  (Inherited from
ModelContentAttributes.)
|
Tags|  (Inherited
from
ModelContentAttributes.)
|
UserText|
(Inherited from
ModelViewportAttributes.)
|
View|
(Inherited from
ModelViewportAttributes.)
Top

Methods

| Name| Description
---|---|---
|
Clone|  (Inherited
from
ModelDataAttributes.)
|
Equals(Object)|
(Inherited from
ModelContentAttributes.)
|
GetHashCode|
(Inherited from
ModelContentAttributes.)
|
ToDetails|
(Overrides
ModelViewportAttributesToDetails.)
|
ToModelData|
(Overrides
ModelViewportAttributesToModelData.)
|
ToString|
(Inherited from
ModelContentAttributes.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com