---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_ZuiAction.htm
scraped_at: 2025-09-08T16:18:11.732703
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_ZuiAction Class](../html/T_Grasshopper_Kernel_GH_ZuiAction.htm
"GH_ZuiAction Class")

[GH_ZuiAction Constructor
](../html/M_Grasshopper_Kernel_GH_ZuiAction__ctor.htm "GH_ZuiAction
Constructor ")

[GH_ZuiAction
Properties](../html/Properties_T_Grasshopper_Kernel_GH_ZuiAction.htm
"GH_ZuiAction Properties")

[GH_ZuiAction Methods](../html/Methods_T_Grasshopper_Kernel_GH_ZuiAction.htm
"GH_ZuiAction Methods")

!Click or drag to
resize

# GH_ZuiAction Class

---

Basic implementation of IGH_ZuiAction.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_ZuiAction

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_ZuiAction : IGH_ZuiAction

    Public MustInherit Class GH_ZuiAction
    	Implements IGH_ZuiAction

The GH_ZuiAction type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ZuiAction| Initializes a new
instance of the GH_ZuiAction class
Top

Properties

| Name| Description
---|---|---
|
Name|
|
TooltipEnabled|
Top

Methods

| Name| Description
---|---|---
|
IsTooltipRegion|
|
Perform|
|
SetupTooltip|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com