---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Rectangle_GH_RectangleProxy.htm
scraped_at: 2025-09-08T16:21:27.612636
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Rectangle.GH_RectangleProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Rectangle_GH_RectangleProxy.htm
"GH_Rectangle.GH_RectangleProxy Class")

[GH_Rectangle.GH_RectangleProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Rectangle_GH_RectangleProxy__ctor.htm
"GH_Rectangle.GH_RectangleProxy Constructor ")

[GH_RectangleProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Rectangle_GH_RectangleProxy.htm
"GH_RectangleProxy Properties")

[GH_RectangleProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Rectangle_GH_RectangleProxy.htm
"GH_RectangleProxy Methods")

!Click or drag to
resize

# GH_RectangleGH_RectangleProxy Class

---

Proxy description of GH_Rectangle class. This class is used by the Generic
Multivalue interfaces.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Rectangle
Grasshopper.Kernel.TypesGH_RectangleGH_RectangleProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RectangleProxy : GH_GooProxy<GH_Rectangle>

    Public Class GH_RectangleProxy
    	Inherits GH_GooProxy(Of GH_Rectangle)

The GH_RectangleGH_RectangleProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_RectangleGH_RectangleProxy|
Initializes a new instance of the GH_RectangleGH_RectangleProxy class
Top

Properties

| Name| Description
---|---|---
|
Area|
|
Circumference|
|
Height|
|
Origin|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
|
Width|
|
XAxis|
|
YAxis|
|
ZAxis|
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com