---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLinetype.htm
scraped_at: 2025-09-08T16:23:58.238870
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Drafting](../html/N_Grasshopper_Rhinoceros_Drafting.htm
"Grasshopper.Rhinoceros.Drafting")

[ObjectDraftingLinetype
Class](../html/T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLinetype.htm
"ObjectDraftingLinetype Class")

[ObjectDraftingLinetype Constructor
](../html/Overload_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLinetype__ctor.htm
"ObjectDraftingLinetype Constructor ")

[ObjectDraftingLinetype
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLinetype.htm
"ObjectDraftingLinetype Properties")

[ObjectDraftingLinetype
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLinetype.htm
"ObjectDraftingLinetype Methods")

[ObjectDraftingLinetype Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLinetype.htm
"ObjectDraftingLinetype Type Conversions")

!Click or drag to
resize

# ObjectDraftingLinetype Class

---

Represents a Rhino object drafintg linetype.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.Rhinoceros.DraftingObjectDraftingLinetype

**Namespace:**
Grasshopper.Rhinoceros.Drafting
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ObjectDraftingLinetype : ModelValue

    Public NotInheritable Class ObjectDraftingLinetype
    	Inherits ModelValue

The ObjectDraftingLinetype type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectDraftingLinetype|
Initializes a new instance of the ObjectDraftingLinetype class
|
ObjectDraftingLinetype(ObjectDraftingLinetypeValue)|
Initializes a new instance of the ObjectDraftingLinetype class
Top

Properties

| Name| Description
---|---|---
|
Linetype|
|
Source|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelValueCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelValue.)
|
Equals(ModelValue)|
(Inherited from ModelValue.)
|
Equals(Object)|
(Overrides
ModelValueEquals(Object).)
|
GetHashCode|
(Overrides
ModelValueGetHashCode.)
|
TooltipString|
(Inherited from ModelValue.)
|
ToString|  (Inherited from
ModelValue.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ObjectDraftingLinetype to
ObjectDraftingLinetypeValue)|
!Static
member| (ObjectDraftingLinetypeValue to
ObjectDraftingLinetype)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Drafting
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com