---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_IGH_Structure.htm
scraped_at: 2025-09-08T16:19:28.101165
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[IGH_Structure Interface](../html/T_Grasshopper_Kernel_Data_IGH_Structure.htm
"IGH_Structure Interface")

[IGH_Structure
Properties](../html/Properties_T_Grasshopper_Kernel_Data_IGH_Structure.htm
"IGH_Structure Properties")

[IGH_Structure
Methods](../html/Methods_T_Grasshopper_Kernel_Data_IGH_Structure.htm
"IGH_Structure Methods")

!Click or drag to
resize

# IGH_Structure Interface

---

Base interface for all GH_Structure types.

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_Structure

    Public Interface IGH_Structure

The IGH_Structure type exposes the following members.

Properties

| Name| Description
---|---|---
|
BranchGH_Path|  Gets a
limited access pointer to the data list associated with a certain path.
|
BranchInt32|  Gets a
limited access pointer to the data list at the specified index.
|
DataCount|  Gets the
total number of data items stored in all paths.
|
IsEmpty|  Gets the
Empty state of the structure. If the structure is Empty when it contains no
paths and no branches.
|
Path|  Gets the data path
at the specified index.
|
PathCount|  Gets the
number of paths defined in this structure.
|
Paths|  Gets a list of
all the paths in this structure.
|
StructureProxy|
Gets a proxy list of all the data-arrays in this structure
|
TopologyDescription|
Gets a description of the topology of the structure. Useful for debugging
purposes.
Top

Methods

| Name| Description
---|---|---
|
AllData|  Gets an
enumerator for all the data items in this structure.
|
Clear|  Clears the entire
structure.
|
ClearData|  Removes
all data from all paths without affecting the structure topology.
|
DataDescription|
Gets a description of the data contained in this structure.
|
EnsureCapacity|
Ensures that all branches have a certain capacity
|
ExpandPath|  Expand
a path in this structure by appending an element.
|
Flatten|  Flattens the
entire structure into a single path.
|
Graft(GH_GraftMode)|
Grafts all paths by reallocating all data into child paths.
| Graft(GH_GraftMode,
GH_Path)|  Grafts a
specific path by reallocating all data into child paths. If a grafted path
coincides with an existing path, the data item in question will be appended to
the existing path.
|
LongestPathIndex|
Finds the path in this structure with the most dimensions. In case of multiple
equally long longest paths, the last one will be returned.
|
PathExists|  Returns
True if the specified path is already defined inside the structure.
|
PathIndex|  Find the
indices that delineate the given path domain.
|
RemovePath|  Removes
a path and all associated data from the structure. If the path doesn't exist,
nothing will happen.
|
ReplacePath|
Replace an existing path with a different one. If the operation is
successfull, then the 'find' path will be deleted. If the 'replace' path is
already defined, the items in 'find' will be appended to the existing path.
|
ShortestPathIndex|
Finds the path in this structure with the least dimensions. In case of
multiple equally long longest paths, the first one will be returned.
|
Simplify|  Simplify
the data structure by removing path indices shared by all branches.
|
TrimExcess|  Trims
the excess allocated memory in all branches
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com