---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_InstanceReference_GH_InstanceReferenceProxy.htm
scraped_at: 2025-09-08T16:20:49.430610
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_InstanceReference.GH_InstanceReferenceProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_InstanceReference_GH_InstanceReferenceProxy.htm
"GH_InstanceReference.GH_InstanceReferenceProxy Class")

[GH_InstanceReference.GH_InstanceReferenceProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_InstanceReference_GH_InstanceReferenceProxy__ctor.htm
"GH_InstanceReference.GH_InstanceReferenceProxy Constructor ")

[GH_InstanceReferenceProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_InstanceReference_GH_InstanceReferenceProxy.htm
"GH_InstanceReferenceProxy Properties")

[GH_InstanceReferenceProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_InstanceReference_GH_InstanceReferenceProxy.htm
"GH_InstanceReferenceProxy Methods")

!Click or drag to
resize

# GH_InstanceReferenceGH_InstanceReferenceProxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_InstanceReference
Grasshopper.Kernel.TypesGH_InstanceReferenceGH_InstanceReferenceProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_InstanceReferenceProxy : GH_GooProxy<GH_InstanceReference>

    Public Class GH_InstanceReferenceProxy
    	Inherits GH_GooProxy(Of GH_InstanceReference)

The GH_InstanceReferenceGH_InstanceReferenceProxy type exposes the following
members.

Constructors

| Name| Description
---|---|---
|
GH_InstanceReferenceGH_InstanceReferenceProxy|
Initializes a new instance of the
GH_InstanceReferenceGH_InstanceReferenceProxy class
Top

Properties

| Name| Description
---|---|---
|
Definition|
|
ObjectID|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com