---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Undo_GH_UndoState.htm
scraped_at: 2025-09-08T16:22:05.732899
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Undo](../html/N_Grasshopper_Kernel_Undo.htm
"Grasshopper.Kernel.Undo")

[GH_ArchivedUndoAction
Class](../html/T_Grasshopper_Kernel_Undo_GH_ArchivedUndoAction.htm
"GH_ArchivedUndoAction Class")

[GH_ObjectUndoAction
Class](../html/T_Grasshopper_Kernel_Undo_GH_ObjectUndoAction.htm
"GH_ObjectUndoAction Class")

[GH_UndoAction Class](../html/T_Grasshopper_Kernel_Undo_GH_UndoAction.htm
"GH_UndoAction Class")

[GH_UndoException
Class](../html/T_Grasshopper_Kernel_Undo_GH_UndoException.htm
"GH_UndoException Class")

[GH_UndoRecord Class](../html/T_Grasshopper_Kernel_Undo_GH_UndoRecord.htm
"GH_UndoRecord Class")

[GH_UndoServer Class](../html/T_Grasshopper_Kernel_Undo_GH_UndoServer.htm
"GH_UndoServer Class")

[GH_UndoState Enumeration](../html/T_Grasshopper_Kernel_Undo_GH_UndoState.htm
"GH_UndoState Enumeration")

[IGH_UndoAction
Interface](../html/T_Grasshopper_Kernel_Undo_IGH_UndoAction.htm
"IGH_UndoAction Interface")

!Click or drag to
resize

# GH_UndoState Enumeration

---

State enumeration for undo records.

**Namespace:** Grasshopper.Kernel.Undo
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public enum GH_UndoState

    Public Enumeration GH_UndoState

Members

| Member name| Value| Description
---|---|---|---
| undo| 0|  Record can be undone.
| redo| 1|  Record can be redone

See Also

#### Reference

Grasshopper.Kernel.Undo Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com