---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Drafting_ModelLinetype.htm
scraped_at: 2025-09-08T16:23:51.218959
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Drafting](../html/N_Grasshopper_Rhinoceros_Drafting.htm
"Grasshopper.Rhinoceros.Drafting")

[ModelLinetype
Class](../html/T_Grasshopper_Rhinoceros_Drafting_ModelLinetype.htm
"ModelLinetype Class")

[ModelLinetype Constructor
](../html/Overload_Grasshopper_Rhinoceros_Drafting_ModelLinetype__ctor.htm
"ModelLinetype Constructor ")

[ModelLinetype
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Drafting_ModelLinetype.htm
"ModelLinetype Properties")

[ModelLinetype
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Drafting_ModelLinetype.htm
"ModelLinetype Methods")

[ModelLinetype Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Drafting_ModelLinetype.htm
"ModelLinetype Type Conversions")

!Click or drag to
resize

# ModelLinetype Class

---

Represents a Rhino model linetype. Wraps the functionality of the Linetype
type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.RhinocerosModelComponentContent
Grasshopper.Rhinoceros.DraftingModelLinetype

**Namespace:**
Grasshopper.Rhinoceros.Drafting
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelLinetype : ModelComponentContent,
    	IGH_BakeAwareData

    Public NotInheritable Class ModelLinetype
    	Inherits ModelComponentContent
    	Implements IGH_BakeAwareData

The ModelLinetype type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelLinetype|
Initializes a new instance of the ModelLinetype class
|
ModelLinetype(ModelLinetypeAttributes)|
Initializes a new instance of the ModelLinetype class
|
ModelLinetype(Guid)|
Initializes a new instance of the ModelLinetype class
|
ModelLinetype(Linetype)|
Initializes a new instance of the ModelLinetype class
Top

Properties

| Name| Description
---|---|---
|
CapStyle|
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
JoinStyle|
|
Name|  (Overrides
ModelContentName.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Segments|
|
Tags|  (Inherited from
ModelContent.)
|
TaperPoints|
!Static
member|
Unset|
|
UserText|
(Inherited from
ModelComponentContent.)
|
Width|
|
WidthUnits|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelLinetypeAttributes to
ModelLinetype)|
!Static
member| (Linetype to
ModelLinetype)|
!Static
member| (String to
ModelLinetype)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Drafting
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com