---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_StringMismatchException.htm
scraped_at: 2025-09-08T16:19:20.047544
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_StringMismatchException
Class](../html/T_Grasshopper_Kernel_Data_GH_StringMismatchException.htm
"GH_StringMismatchException Class")

[GH_StringMismatchException Constructor
](../html/Overload_Grasshopper_Kernel_Data_GH_StringMismatchException__ctor.htm
"GH_StringMismatchException Constructor ")

!Click or drag to
resize

# GH_StringMismatchException Class

---

Exception used during Rule Set parsing.

Inheritance Hierarchy

SystemObject
SystemException
Grasshopper.Kernel.DataGH_StringMismatchException

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_StringMismatchException : Exception

    Public Class GH_StringMismatchException
    	Inherits Exception

Constructors

| Name| Description
---|---|---
|
GH_StringMismatchException|
Initializes a new instance of the GH_StringMismatchException class
|
GH_StringMismatchException(String)|
Initializes a new instance of the GH_StringMismatchException class
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com