---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_AnnotationDimensionSettings.htm
scraped_at: 2025-09-08T16:22:53.008566
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations](../html/N_Grasshopper_Rhinoceros_Annotations.htm
"Grasshopper.Rhinoceros.Annotations")

[AnnotationDimensionSettings
Class](../html/T_Grasshopper_Rhinoceros_Annotations_AnnotationDimensionSettings.htm
"AnnotationDimensionSettings Class")

[AnnotationDimensionSettings Constructor
](../html/Overload_Grasshopper_Rhinoceros_Annotations_AnnotationDimensionSettings__ctor.htm
"AnnotationDimensionSettings Constructor ")

[AnnotationDimensionSettings
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_AnnotationDimensionSettings.htm
"AnnotationDimensionSettings Properties")

[AnnotationDimensionSettings
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_AnnotationDimensionSettings.htm
"AnnotationDimensionSettings Methods")

[AnnotationDimensionSettings Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Annotations_AnnotationDimensionSettings.htm
"AnnotationDimensionSettings Type Conversions")

!Click or drag to
resize

# AnnotationDimensionSettings Class

---

Represents annotation dimension settings.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.Rhinoceros.AnnotationsAnnotationDimensionSettings

**Namespace:**
Grasshopper.Rhinoceros.Annotations
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class AnnotationDimensionSettings : ModelData

    Public NotInheritable Class AnnotationDimensionSettings
    	Inherits ModelData

The AnnotationDimensionSettings type exposes the following members.

Constructors

| Name| Description
---|---|---
|
AnnotationDimensionSettings|
Initializes a new instance of the AnnotationDimensionSettings class
|
AnnotationDimensionSettings(AnnotationDimensionSettingsAttributes)|
Initializes a new instance of the AnnotationDimensionSettings class
|
AnnotationDimensionSettings(DimensionStyle)|
Initializes a new instance of the AnnotationDimensionSettings class
Top

Properties

| Name| Description
---|---|---
|
BaselineSpacing|
|
CentermarkSize|
|
CentermarkStyle|
|
DecimalSeparator|
|
DimensionLineExtension|
|
ExtensionLineExtension|
|
ExtensionLineOffset|
|
FixedExtension|
|
FixedExtensionLength|
|
RadialTextAngleType|
|
RadialTextLocation|
|
RadialTextOrientation|
|
SuppressExtension1|
|
SuppressExtension2|
|
TextAngleType|
|
TextLocation|
|
TextOrientation|
Top

Methods

| Name| Description
---|---|---
|
CastToT|  (Inherited from
ModelData.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|  (Inherited
from ModelData.)
|
GetDimensionStyle|
|
GetHashCode|  (Inherited
from ModelData.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelData.)
|
ToString|  (Inherited from
ModelData.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (AnnotationDimensionSettings to
DimensionStyle)|
!Static
member| (AnnotationDimensionSettingsAttributes to
AnnotationDimensionSettings)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com