---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_EtoExtensions.htm
scraped_at: 2025-09-08T16:11:43.066482
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper

[EtoExtensions Class](../html/T_Grasshopper_EtoExtensions.htm "EtoExtensions
Class")

[EtoExtensions Methods](../html/Methods_T_Grasshopper_EtoExtensions.htm
"EtoExtensions Methods")

!Click or drag to
resize

# EtoExtensions Class

---

Inheritance Hierarchy

SystemObject
GrasshopperEtoExtensions

**Namespace:** Grasshopper
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class EtoExtensions

    <ExtensionAttribute>
    Public NotInheritable Class EtoExtensions

The EtoExtensions type exposes the following members.

Methods

| Name| Description
---|---|---
|
ToEto(Bitmap)|  **Obsolete.**
|
ToEto(Color)|
|
ToEto(Control)|
|
ToEto(Font)|
|
ToEto(Form)|
|
ToEto(Point)|
|
ToEto(PointF)|
|
ToEto(Size)|
|
ToEto(SizeF)|
|
ToEtoWindow|
|
ToSD(Color)|
|
ToSD(Font)|
|
ToSD(Point)|
|
ToSD(PointF)|
|
ToSD(Rectangle)|
|
ToSD(Size)|
|
ToSD(SizeF)|
|
ToSwf|
|
ToWin32Window|
Top

See Also

#### Reference

Grasshopper Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com