---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_MeshingParameters_RhMesherSettings_Proxy.htm
scraped_at: 2025-09-08T16:21:10.505499
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_MeshingParameters.RhMesherSettings_Proxy
Class](../html/T_Grasshopper_Kernel_Types_GH_MeshingParameters_RhMesherSettings_Proxy.htm
"GH_MeshingParameters.RhMesherSettings_Proxy Class")

[GH_MeshingParameters.RhMesherSettings_Proxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_MeshingParameters_RhMesherSettings_Proxy__ctor.htm
"GH_MeshingParameters.RhMesherSettings_Proxy Constructor ")

[RhMesherSettings_Proxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_MeshingParameters_RhMesherSettings_Proxy.htm
"RhMesherSettings_Proxy Properties")

[RhMesherSettings_Proxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_MeshingParameters_RhMesherSettings_Proxy.htm
"RhMesherSettings_Proxy Methods")

!Click or drag to
resize

# GH_MeshingParametersRhMesherSettings_Proxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_MeshingParameters
Grasshopper.Kernel.TypesGH_MeshingParametersRhMesherSettings_Proxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class RhMesherSettings_Proxy : GH_GooProxy<GH_MeshingParameters>

    Public Class RhMesherSettings_Proxy
    	Inherits GH_GooProxy(Of GH_MeshingParameters)

The GH_MeshingParametersRhMesherSettings_Proxy type exposes the following
members.

Constructors

| Name| Description
---|---|---
|
GH_MeshingParametersRhMesherSettings_Proxy|
Initializes a new instance of the GH_MeshingParametersRhMesherSettings_Proxy
class
Top

Properties

| Name| Description
---|---|---
|
AngleTolerance|
|
AspectRatio|
|
GridMaxCount|
|
GridMinCount|
|
IsParsable|
(Overrides GH_GooProxy.IsParsable.)
|
JaggedSeams|
|
MaxEdgeLength|
|
MinEdgeLength|
|
Refine|
|
SimplePlanes|
|
Tolerance|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
Top

Methods

| Name| Description
---|---|---
|
Construct|  Override
this method to supply a custom UI during proxy construction.  (Inherited from
GH_GooProxyT.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com