---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_ObjectWrapper.htm
scraped_at: 2025-09-08T16:21:12.535647
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_ObjectWrapper
Class](../html/T_Grasshopper_Kernel_Types_GH_ObjectWrapper.htm
"GH_ObjectWrapper Class")

[GH_ObjectWrapper Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_ObjectWrapper__ctor.htm
"GH_ObjectWrapper Constructor ")

[GH_ObjectWrapper
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_ObjectWrapper.htm
"GH_ObjectWrapper Properties")

[GH_ObjectWrapper
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_ObjectWrapper.htm
"GH_ObjectWrapper Methods")

[GH_ObjectWrapper
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_ObjectWrapper.htm
"GH_ObjectWrapper Fields")

!Click or drag to
resize

# GH_ObjectWrapper Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooObject
Grasshopper.Kernel.TypesGH_ObjectWrapper

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ObjectWrapper : GH_Goo<Object>,
    	IGH_BakeAwareData, IGH_PreviewData

    Public Class GH_ObjectWrapper
    	Inherits GH_Goo(Of Object)
    	Implements IGH_BakeAwareData, IGH_PreviewData

The GH_ObjectWrapper type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ObjectWrapper|
Initializes a new instance of the GH_ObjectWrapper class
|
GH_ObjectWrapper(Object)|
Initializes a new instance of the GH_ObjectWrapper class
Top

Properties

| Name| Description
---|---|---
|
ClippingBox|
|
IsValid|
(Overrides GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Inherited from
GH_GooT.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|
(Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
|
CastFrom|
(Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|
(Overrides
GH_GooTCastToQ(Q).)
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|
(Overrides
GH_GooTDuplicate.)
|
DuplicateObject|
|
EmitProxy|
(Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|
(Overrides
GH_GooTToString.)
|
Write|  Default behaviour is
to return True.  (Inherited from
GH_GooT.)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com