---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_AnnotationUnitsSettings.htm
scraped_at: 2025-09-08T16:23:00.993554
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations](../html/N_Grasshopper_Rhinoceros_Annotations.htm
"Grasshopper.Rhinoceros.Annotations")

[AnnotationUnitsSettings
Class](../html/T_Grasshopper_Rhinoceros_Annotations_AnnotationUnitsSettings.htm
"AnnotationUnitsSettings Class")

[AnnotationUnitsSettings Constructor
](../html/Overload_Grasshopper_Rhinoceros_Annotations_AnnotationUnitsSettings__ctor.htm
"AnnotationUnitsSettings Constructor ")

[AnnotationUnitsSettings
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_AnnotationUnitsSettings.htm
"AnnotationUnitsSettings Properties")

[AnnotationUnitsSettings
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_AnnotationUnitsSettings.htm
"AnnotationUnitsSettings Methods")

[AnnotationUnitsSettings Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Annotations_AnnotationUnitsSettings.htm
"AnnotationUnitsSettings Type Conversions")

!Click or drag to
resize

# AnnotationUnitsSettings Class

---

Represents annotation units settings.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.Rhinoceros.AnnotationsAnnotationUnitsSettings

**Namespace:**
Grasshopper.Rhinoceros.Annotations
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class AnnotationUnitsSettings : ModelData

    Public NotInheritable Class AnnotationUnitsSettings
    	Inherits ModelData

The AnnotationUnitsSettings type exposes the following members.

Constructors

| Name| Description
---|---|---
|
AnnotationUnitsSettings|
Initializes a new instance of the AnnotationUnitsSettings class
|
AnnotationUnitsSettings(AnnotationUnitsSettingsAttributes)|
Initializes a new instance of the AnnotationUnitsSettings class
|
AnnotationUnitsSettings(DimensionStyle)|
Initializes a new instance of the AnnotationUnitsSettings class
Top

Properties

| Name| Description
---|---|---
|
AngleFormat|
|
AngleResolution|
|
AngleRoundoff|
|
AngleZeroSuppression|
|
LengthDisplay|
|
LengthFactor|
|
LengthPrefix|
|
LengthResolution|
|
LengthRoundoff|
|
LengthSuffix|
|
LengthZeroSuppression|
|
StackFractionFormat|
|
StackHeightScale|
Top

Methods

| Name| Description
---|---|---
|
CastToT|  (Inherited from
ModelData.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|  (Inherited
from ModelData.)
|
GetDimensionStyle|
|
GetHashCode|  (Inherited
from ModelData.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelData.)
|
ToString|  (Inherited from
ModelData.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (AnnotationUnitsSettings to
DimensionStyle)|
!Static
member| (AnnotationUnitsSettingsAttributes to
AnnotationUnitsSettings)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com