---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_Complex.htm
scraped_at: 2025-09-08T16:20:13.298198
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[Complex Structure](../html/T_Grasshopper_Kernel_Types_Complex.htm "Complex
Structure")

[Complex Constructor
](../html/Overload_Grasshopper_Kernel_Types_Complex__ctor.htm "Complex
Constructor ")

[Complex Properties](../html/Properties_T_Grasshopper_Kernel_Types_Complex.htm
"Complex Properties")

[Complex Methods](../html/Methods_T_Grasshopper_Kernel_Types_Complex.htm
"Complex Methods")

[Complex Operators](../html/Operators_T_Grasshopper_Kernel_Types_Complex.htm
"Complex Operators")

!Click or drag to
resize

# Complex Structure

---

Complex number type in Grasshopper. Do not confuse with GH_Complex which is
the IGH_Goo implementation of ComplexNumber.

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct Complex

    Public Structure Complex

The Complex type exposes the following members.

Constructors

| Name| Description
---|---|---
|
Complex(Double)| Initializes a
new instance of the Complex class
| Complex(Double,
Double)| Initializes a new
instance of the Complex class
Top

Properties

| Name| Description
---|---|---
|
Argument|  Gets or sets the
complex argument.
!Static
member|
ComplexUnit|
|
Imaginary|  Gets or sets
the imaginary component of the Complex number.
!Static
member|
Infinity|
|
IsReal|  Gets whether this
complex number only has a real component.
|
IsRealNonNegative|
Gets whether this complex number only has a positive real component.
|
IsValid|  Gets the validity
of this number.
|
IsZero|  Gets whether or not
this complex number equals {0.0; 0.0}
!Static
member|
NaN|
!Static
member|
NegativeInfinity|
|
Real|  Gets or sets the real
component of the Complex number.
!Static
member|
Zero|
Top

Methods

| Name| Description
---|---|---
|
ACos|
|
ASin|
|
ATan|
|
Cos|
|
Cosecant|
|
CoTan|
|
Exponential|
|
GetHashCode|  (Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
|
Log|
|
Log10|
|
Modulus|
|
ModulusSquared|
|
Power|
|
Root|
|
Secant|
|
Sin|
|
Square|
|
SquareRoot|
|
Tan|
Top

Operators

| Name| Description
---|---|---
!Static
member| Addition(Complex,
Complex)|
!Static
member| Addition(Complex,
Double)|
!Static
member| Addition(Double,
Complex)|
!Static
member| Division(Complex,
Complex)|
!Static
member| Division(Complex,
Double)|
!Static
member| Division(Double,
Complex)|
!Static
member| Multiply(Complex,
Complex)|
!Static
member| Multiply(Complex,
Double)|
!Static
member| Multiply(Double,
Complex)|
!Static
member| Subtraction(Complex,
Complex)|
!Static
member| Subtraction(Complex,
Double)|
!Static
member| Subtraction(Double,
Complex)|
!Static
member|
UnaryNegation|
!Static
member|
UnaryPlus|
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com