---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Predicate.htm
scraped_at: 2025-09-08T16:21:24.591898
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Predicate Class](../html/T_Grasshopper_Kernel_Types_GH_Predicate.htm
"GH_Predicate Class")

[GH_Predicate Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Predicate__ctor.htm "GH_Predicate
Constructor ")

[GH_Predicate
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Predicate.htm
"GH_Predicate Properties")

[GH_Predicate
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Predicate.htm
"GH_Predicate Methods")

!Click or drag to
resize

# GH_Predicate Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_Predicate

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_Predicate : IGH_Goo

    Public NotInheritable Class GH_Predicate
    	Implements IGH_Goo

The GH_Predicate type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Predicate| Initializes
a new instance of the GH_Predicate class
Top

Properties

| Name| Description
---|---|---
|
Description|
!Static
member|
Empty|
!Static
member|
False|
|
IsValid|
|
IsValidWhyNot|
!Static
member|
Missing|
!Static
member|
Present|
!Static
member|
True|
|
TypeDescription|
|
TypeName|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT|
|
Duplicate|
|
EmitProxy|
|
Format|
|
Invoke|
|
Negate|
|
Read|
|
ScriptVariable|
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
TryCastToT|
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com