---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Base_SliderSnapRange.htm
scraped_at: 2025-09-08T16:13:55.648726
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Base](../html/N_Grasshopper_GUI_Base.htm
"Grasshopper.GUI.Base")

[SliderSnapRange Structure](../html/T_Grasshopper_GUI_Base_SliderSnapRange.htm
"SliderSnapRange Structure")

[SliderSnapRange Constructor
](../html/Overload_Grasshopper_GUI_Base_SliderSnapRange__ctor.htm
"SliderSnapRange Constructor ")

[SliderSnapRange
Properties](../html/Properties_T_Grasshopper_GUI_Base_SliderSnapRange.htm
"SliderSnapRange Properties")

[SliderSnapRange
Methods](../html/Methods_T_Grasshopper_GUI_Base_SliderSnapRange.htm
"SliderSnapRange Methods")

!Click or drag to
resize

# SliderSnapRange Structure

---

Represents a snap range on a slider.

**Namespace:** Grasshopper.GUI.Base
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct SliderSnapRange : IComparable<SliderSnapRange>

    Public Structure SliderSnapRange
    	Implements IComparable(Of SliderSnapRange)

The SliderSnapRange type exposes the following members.

Constructors

| Name| Description
---|---|---
|
SliderSnapRange(Decimal)|
Initializes a new instance of the SliderSnapRange class
| SliderSnapRange(Decimal,
Decimal)| Initializes a
new instance of the SliderSnapRange class
Top

Properties

| Name| Description
---|---|---
|
IsSingleton|
|
Max|
|
Min|
Top

Methods

| Name| Description
---|---|---
|
CanMerge|
|
CompareTo|
|
DistanceTo|  Compute
the distance from a value to this snap range.
|
Merge|
|
SnapValue|  Gets the
snapped value of another value.
Top

See Also

#### Reference

Grasshopper.GUI.Base Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com