---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_WindowsControlUtil.htm
scraped_at: 2025-09-08T16:13:21.510202
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_WindowsControlUtil
Class](../html/T_Grasshopper_GUI_GH_WindowsControlUtil.htm
"GH_WindowsControlUtil Class")

[GH_WindowsControlUtil
Methods](../html/Methods_T_Grasshopper_GUI_GH_WindowsControlUtil.htm
"GH_WindowsControlUtil Methods")

!Click or drag to
resize

# GH_WindowsControlUtil Class

---

Exposes some static (Shared) utility functions for setting text-rendering
properties en masse.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_WindowsControlUtil

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_WindowsControlUtil

    Public NotInheritable Class GH_WindowsControlUtil

Methods

| Name| Description
---|---|---
|
FixTextRenderingDefault(Control)|
Sets the UseCompatibleTextRendering value to False on the control.
!Static
member|
FixTextRenderingDefault(ControlControlCollection)|
Recursively sets the UseCompatibleTextRendering value to False on each
control.
|
FixTextRenderingDefault(IEnumerableControl)|
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com