---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_StateAwareObject.htm
scraped_at: 2025-09-08T16:18:42.881326
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_StateAwareObject
Interface](../html/T_Grasshopper_Kernel_IGH_StateAwareObject.htm
"IGH_StateAwareObject Interface")

[IGH_StateAwareObject
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_StateAwareObject.htm
"IGH_StateAwareObject Methods")

!Click or drag to
resize

# IGH_StateAwareObject Interface

---

Implement this interface if you want to be included in state saving/loading.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_StateAwareObject

    Public Interface IGH_StateAwareObject

The IGH_StateAwareObject type exposes the following members.

Methods

| Name| Description
---|---|---
|
LoadState|
Override this function to load your state data. DO NOT START A NEW SOLUTION.
This will be handled by the state manager.
|
SaveState|
Override this function to store your state data. You have to return a
deserializable string.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com