---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_AutoSaveSettings.htm
scraped_at: 2025-09-08T16:15:27.031332
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_AutoSaveSettings
Class](../html/T_Grasshopper_Kernel_GH_AutoSaveSettings.htm
"GH_AutoSaveSettings Class")

[GH_AutoSaveSettings Constructor
](../html/M_Grasshopper_Kernel_GH_AutoSaveSettings__ctor.htm
"GH_AutoSaveSettings Constructor ")

[GH_AutoSaveSettings
Properties](../html/Properties_T_Grasshopper_Kernel_GH_AutoSaveSettings.htm
"GH_AutoSaveSettings Properties")

[GH_AutoSaveSettings
Methods](../html/Methods_T_Grasshopper_Kernel_GH_AutoSaveSettings.htm
"GH_AutoSaveSettings Methods")

[GH_AutoSaveSettings
Events](../html/Events_T_Grasshopper_Kernel_GH_AutoSaveSettings.htm
"GH_AutoSaveSettings Events")

!Click or drag to
resize

# GH_AutoSaveSettings Class

---

Provides access to all AutoSave event flags.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_AutoSaveSettings

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_AutoSaveSettings

    Public NotInheritable Class GH_AutoSaveSettings

The GH_AutoSaveSettings type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_AutoSaveSettings|
Initializes a new instance of the GH_AutoSaveSettings class
Top

Properties

| Name| Description
---|---|---
!Static
member|
EnableAutoSave|
!Static
member|
SaveOnDataFlattening|
!Static
member|
SaveOnDocumentUnload|
!Static
member|
SaveOnObjectAdded|
!Static
member|
SaveOnObjectChange|
!Static
member|
SaveOnObjectRemoved|
!Static
member|
SaveOnWireEvent|
Top

Methods

| Name| Description
---|---|---
|
AutosaveFilter|
Tests a given trigger to see if it allows an autosave operation.
Top

Events

| Name| Description
---|---|---
|
AutoSaveFileFormatChanged|
|
EnableAutoSaveChanged|
|
SaveOnDataFlatteningChanged|
|
SaveOnDocumentUnloadChanged|
|
SaveOnObjectAddedChanged|
|
SaveOnObjectChangeChanged|
|
SaveOnObjectRemovedChanged|
|
SaveOnWireEventChanged|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com