---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_Transforms_Orientation.htm
scraped_at: 2025-09-08T16:21:53.690468
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types.Transforms](../html/N_Grasshopper_Kernel_Types_Transforms.htm
"Grasshopper.Kernel.Types.Transforms")

[Orientation
Class](../html/T_Grasshopper_Kernel_Types_Transforms_Orientation.htm
"Orientation Class")

[Orientation Constructor
](../html/Overload_Grasshopper_Kernel_Types_Transforms_Orientation__ctor.htm
"Orientation Constructor ")

[Orientation
Properties](../html/Properties_T_Grasshopper_Kernel_Types_Transforms_Orientation.htm
"Orientation Properties")

[Orientation
Methods](../html/Methods_T_Grasshopper_Kernel_Types_Transforms_Orientation.htm
"Orientation Methods")

!Click or drag to
resize

# Orientation Class

---

Implements an orientation (ChangeBasis) transformation.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.Types.TransformsOrientation

**Namespace:**
Grasshopper.Kernel.Types.Transforms
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class Orientation : ITransform

    Public Class Orientation
    	Implements ITransform

The Orientation type exposes the following members.

Constructors

| Name| Description
---|---|---
|
Orientation|
Initializes a new instance of the Orientation class
| Orientation(Plane,
Plane)|
Initializes a new instance of the Orientation class
Top

Properties

| Name| Description
---|---|---
|
Name|
|
SourceFrame|
|
TargetFrame|
Top

Methods

| Name| Description
---|---|---
|
Duplicate|
|
Read|
|
Reverse|
|
ToMatrix|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types.Transforms
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com