---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Model_ModelLayer_Attributes.htm
scraped_at: 2025-09-08T16:24:17.322065
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Model](../html/N_Grasshopper_Rhinoceros_Model.htm
"Grasshopper.Rhinoceros.Model")

[ModelLayer.Attributes
Class](../html/T_Grasshopper_Rhinoceros_Model_ModelLayer_Attributes.htm
"ModelLayer.Attributes Class")

[ModelLayer.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_Model_ModelLayer_Attributes__ctor.htm
"ModelLayer.Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Model_ModelLayer_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Model_ModelLayer_Attributes.htm
"Attributes Methods")

[Attributes Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Model_ModelLayer_Attributes.htm
"Attributes Type Conversions")

!Click or drag to
resize

# ModelLayerAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
Grasshopper.RhinocerosModelComponentContentAttributes
Grasshopper.Rhinoceros.ModelModelLayerAttributes

**Namespace:**
Grasshopper.Rhinoceros.Model
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Attributes : ModelComponentContentAttributes,
    	IEquatable<ModelLayerAttributes>

    Public NotInheritable Class Attributes
    	Inherits ModelComponentContentAttributes
    	Implements IEquatable(Of ModelLayerAttributes)

The ModelLayerAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelLayerAttributes|
Initializes a new instance of the ModelLayerAttributes class
Top

Properties

| Name| Description
---|---|---
|
DisplayColor|
|
DraftingColor|
|
Hidden|
|
HiddenOnModel|
|
HiddenOnNewDetail|
|
Linetype|
|
LineWeight|
|
Locked|
|
Material|
|
Name|  The last
component of the element Path.  (Inherited from
ModelContentAttributes.)
|
Notes|
(Inherited from
ModelContentAttributes.)
|
Parent|  Path
of the parent element in 'Root::Parent' format if nested.  (Inherited from
ModelContentAttributes.)
|
Path|  Full
content path in 'Root::Parent::Name' format if is nested.  (Inherited from
ModelContentAttributes.)
|
Tags|  (Inherited
from
ModelContentAttributes.)
|
UserText|
(Inherited from
ModelComponentContentAttributes.)
Top

Methods

| Name| Description
---|---|---
|
Clone|  (Inherited
from
ModelDataAttributes.)
|
Equals(Object)|
(Inherited from
ModelContentAttributes.)
|
GetHashCode|
(Inherited from
ModelContentAttributes.)
|
ToDetails|
(Overrides
ModelComponentContentAttributesToDetails.)
|
ToModelData|
(Overrides
ModelDataAttributesToModelData.)
|
ToString|
(Inherited from
ModelContentAttributes.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (String to
ModelLayerAttributes)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Model Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com