---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLineWidth.htm
scraped_at: 2025-09-08T16:24:00.227067
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Drafting](../html/N_Grasshopper_Rhinoceros_Drafting.htm
"Grasshopper.Rhinoceros.Drafting")

[ObjectDraftingLineWidth
Class](../html/T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLineWidth.htm
"ObjectDraftingLineWidth Class")

[ObjectDraftingLineWidth Constructor
](../html/Overload_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLineWidth__ctor.htm
"ObjectDraftingLineWidth Constructor ")

[ObjectDraftingLineWidth
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLineWidth.htm
"ObjectDraftingLineWidth Properties")

[ObjectDraftingLineWidth
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLineWidth.htm
"ObjectDraftingLineWidth Methods")

[ObjectDraftingLineWidth Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingLineWidth.htm
"ObjectDraftingLineWidth Type Conversions")

!Click or drag to
resize

# ObjectDraftingLineWidth Class

---

Represents a Rhino object drafintg linetype.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.Rhinoceros.DraftingObjectDraftingLineWidth

**Namespace:**
Grasshopper.Rhinoceros.Drafting
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ObjectDraftingLineWidth : ModelValue

    Public NotInheritable Class ObjectDraftingLineWidth
    	Inherits ModelValue

The ObjectDraftingLineWidth type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectDraftingLineWidth|
Initializes a new instance of the ObjectDraftingLineWidth class
|
ObjectDraftingLineWidth(ObjectDraftingLineWidthValue)|
Initializes a new instance of the ObjectDraftingLineWidth class
Top

Properties

| Name| Description
---|---|---
|
Source|
|
Width|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelValueCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelValue.)
|
Equals(ModelValue)|
(Inherited from ModelValue.)
|
Equals(Object)|
(Overrides
ModelValueEquals(Object).)
|
GetHashCode|
(Overrides
ModelValueGetHashCode.)
|
ToAttributes|
|
TooltipString|
(Inherited from ModelValue.)
|
ToString|  (Inherited from
ModelValue.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ObjectDraftingLineWidth to
ObjectDraftingLineWidthValue)|
!Static
member| (ObjectDraftingLineWidthValue to
ObjectDraftingLineWidth)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Drafting
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com