---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_ParameterContext.htm
scraped_at: 2025-09-08T16:17:18.507470
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_ParameterContext
Class](../html/T_Grasshopper_Kernel_GH_ParameterContext.htm
"GH_ParameterContext Class")

[GH_ParameterContext Constructor
](../html/M_Grasshopper_Kernel_GH_ParameterContext__ctor.htm
"GH_ParameterContext Constructor ")

[GH_ParameterContext
Properties](../html/Properties_T_Grasshopper_Kernel_GH_ParameterContext.htm
"GH_ParameterContext Properties")

!Click or drag to
resize

# GH_ParameterContext Class

---

Data passed to IGH_ContextualParameter.AutoAssignContextualData to help define
a context state of Rhino/Grasshopper

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_ParameterContext

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ParameterContext

    Public Class GH_ParameterContext

The GH_ParameterContext type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ParameterContext|
Initializes a new instance of the GH_ParameterContext class
Top

Properties

| Name| Description
---|---|---
|
IsScripted|
|
Name|
|
RhinoDoc|
|
SolveIndex|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com