---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_IGH_Rule.htm
scraped_at: 2025-09-08T16:19:27.090118
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[IGH_Rule Interface](../html/T_Grasshopper_Kernel_Data_IGH_Rule.htm "IGH_Rule
Interface")

[IGH_Rule
Properties](../html/Properties_T_Grasshopper_Kernel_Data_IGH_Rule.htm
"IGH_Rule Properties")

[IGH_Rule Methods](../html/Methods_T_Grasshopper_Kernel_Data_IGH_Rule.htm
"IGH_Rule Methods")

!Click or drag to
resize

# IGH_Rule Interface

---

Interface for individual pattern elements.

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_Rule

    Public Interface IGH_Rule

The IGH_Rule type exposes the following members.

Properties

| Name| Description
---|---|---
|
Kind|  Gets the type of rule.
|
Notation|  Gets the string
notation (representation) for this rule.
Top

Methods

| Name| Description
---|---|---
|
Apply|  Applies this rule to
an integer.
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com