---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_PanelEditorControl.htm
scraped_at: 2025-09-08T16:12:58.379766
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_PanelEditorControl
Class](../html/T_Grasshopper_GUI_GH_PanelEditorControl.htm
"GH_PanelEditorControl Class")

[GH_PanelEditorControl Constructor
](../html/M_Grasshopper_GUI_GH_PanelEditorControl__ctor.htm
"GH_PanelEditorControl Constructor ")

[GH_PanelEditorControl
Properties](../html/Properties_T_Grasshopper_GUI_GH_PanelEditorControl.htm
"GH_PanelEditorControl Properties")

[GH_PanelEditorControl
Methods](../html/Methods_T_Grasshopper_GUI_GH_PanelEditorControl.htm
"GH_PanelEditorControl Methods")

!Click or drag to
resize

# GH_PanelEditorControl Class

---

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsUserControl
Grasshopper.GUIGH_PanelEditorControl

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PanelEditorControl : UserControl

    Public Class GH_PanelEditorControl
    	Inherits UserControl

The GH_PanelEditorControl type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PanelEditorControl|
Initializes a new instance of the GH_PanelEditorControl class
Top

Properties

| Name| Description
---|---|---
|
PanelContent|
Gets or sets the panel text on display.
|
PanelProperties|
Gets or sets the panel properties on display.
Top

Methods

| Name| Description
---|---|---
|
Dispose| Releases the
unmanaged resources used by the GH_PanelEditorControl and optionally releases
the managed resources (Overrides
[ContainerControlDispose(Boolean)](https://docs.microsoft.com/dotnet/api/system.windows.forms.containercontrol.dispose#system-
windows-forms-containercontrol-dispose\(system-boolean\)).)
|
OnPaint|  (Overrides
[ControlOnPaint(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.control.onpaint#system-
windows-forms-control-onpaint\(system-windows-forms-painteventargs\)).)
|
OnPaintBackground|
(Overrides
[ScrollableControlOnPaintBackground(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.scrollablecontrol.onpaintbackground#system-
windows-forms-scrollablecontrol-onpaintbackground\(system-windows-forms-
painteventargs\)).)
|
PickNewFont|
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com