---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_Transforms_Translation.htm
scraped_at: 2025-09-08T16:21:57.715767
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types.Transforms](../html/N_Grasshopper_Kernel_Types_Transforms.htm
"Grasshopper.Kernel.Types.Transforms")

[Translation
Class](../html/T_Grasshopper_Kernel_Types_Transforms_Translation.htm
"Translation Class")

[Translation Constructor
](../html/Overload_Grasshopper_Kernel_Types_Transforms_Translation__ctor.htm
"Translation Constructor ")

[Translation
Properties](../html/Properties_T_Grasshopper_Kernel_Types_Transforms_Translation.htm
"Translation Properties")

[Translation
Methods](../html/Methods_T_Grasshopper_Kernel_Types_Transforms_Translation.htm
"Translation Methods")

!Click or drag to
resize

# Translation Class

---

Implements a translation (Move) transformation.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.Types.TransformsTranslation

**Namespace:**
Grasshopper.Kernel.Types.Transforms
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class Translation : ITransform

    Public Class Translation
    	Implements ITransform

The Translation type exposes the following members.

Constructors

| Name| Description
---|---|---
|
Translation|
Initializes a new instance of the Translation class
|
Translation(Vector3d)|
Initializes a new instance of the Translation class
Top

Properties

| Name| Description
---|---|---
|
Name|
|
TranslationVector|
Top

Methods

| Name| Description
---|---|---
|
Duplicate|
|
Read|
|
Reverse|
|
ToMatrix|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types.Transforms
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com