---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_CanvasValidator.htm
scraped_at: 2025-09-08T16:14:30.840120
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_CanvasValidator
Class](../html/T_Grasshopper_GUI_Canvas_GH_CanvasValidator.htm
"GH_CanvasValidator Class")

[GH_CanvasValidator Constructor
](../html/M_Grasshopper_GUI_Canvas_GH_CanvasValidator__ctor.htm
"GH_CanvasValidator Constructor ")

[GH_CanvasValidator
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_GH_CanvasValidator.htm
"GH_CanvasValidator Properties")

[GH_CanvasValidator
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_CanvasValidator.htm
"GH_CanvasValidator Methods")

!Click or drag to
resize

# GH_CanvasValidator Class

---

Abstract implementation of IGH_CanvasValidator. Inherit from this class rather
than implementing IGH_CanvasValidator from scratch.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_CanvasValidator
Grasshopper.GUI.CanvasGH_CanvasDropTargetValidator
Grasshopper.GUI.CanvasGH_CanvasWireValidator

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_CanvasValidator : IGH_CanvasValidator

    Public MustInherit Class GH_CanvasValidator
    	Implements IGH_CanvasValidator

The GH_CanvasValidator type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_CanvasValidator|
Initializes a new instance of the GH_CanvasValidator class
Top

Properties

| Name| Description
---|---|---
|
Canvas|  Gets the
canvas this validator is associated with.
|
Document|  Gets
the document (if it exists) that is currently loaded in the canvas.
Top

Methods

| Name| Description
---|---|---
|
AddedToCanvas|
Override this method if you want to be informed when this validator gets
assigned to a canvas. But *always* call the base class method.
|
AppliesToDocument|
|
CanAcceptObject|
|
CanCreateObject|
|
CanCreateWire|
|
CanDeleteObject|
|
CanDeleteWire|
|
CanDragObject|
|
CanNavigateCanvas|
|
CanShowCanvasMenu|
|
CanShowComponentSearchBox|
|
CanShowObjectMenu|
|
RemovedFromCanvas|
Override this method if you want to be informed when this validator gets
removed from a canvas. But *always* call the base class method.
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com