---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Theme_GH_BackgroundStyle.htm
scraped_at: 2025-09-08T16:15:09.951395
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Theme](../html/N_Grasshopper_GUI_Theme.htm
"Grasshopper.GUI.Theme")

[GH_BackgroundSettings
Class](../html/T_Grasshopper_GUI_Theme_GH_BackgroundSettings.htm
"GH_BackgroundSettings Class")

[GH_BackgroundStyle
Enumeration](../html/T_Grasshopper_GUI_Theme_GH_BackgroundStyle.htm
"GH_BackgroundStyle Enumeration")

[GH_ObjectSettings
Class](../html/T_Grasshopper_GUI_Theme_GH_ObjectSettings.htm
"GH_ObjectSettings Class")

[GH_PageSettings Class](../html/T_Grasshopper_GUI_Theme_GH_PageSettings.htm
"GH_PageSettings Class")

[GH_PaletteSettings
Class](../html/T_Grasshopper_GUI_Theme_GH_PaletteSettings.htm
"GH_PaletteSettings Class")

[GH_Theme Class](../html/T_Grasshopper_GUI_Theme_GH_Theme.htm "GH_Theme
Class")

[GH_WireSettings Class](../html/T_Grasshopper_GUI_Theme_GH_WireSettings.htm
"GH_WireSettings Class")

!Click or drag to
resize

# GH_BackgroundStyle Enumeration

---

Enumerates the pre-defined canvas background themes.

**Namespace:** Grasshopper.GUI.Theme
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public enum GH_BackgroundStyle

    Public Enumeration GH_BackgroundStyle

Members

| Member name| Value| Description
---|---|---|---
| Solid| 0|  Canvas background will be a single, solid colour.
| Hatch| 1|  Canvas background will be a GDI hatch brush.
| GradientLeftRight| 10|  Canvas background will be a linear horizontal
gradient.
| GradientTopBottom| 11|  Canvas background will be a linear vertical
gradient.

See Also

#### Reference

Grasshopper.GUI.Theme Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com