---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_IndexRuleSet.htm
scraped_at: 2025-09-08T16:19:02.986517
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_IndexRuleSet Class](../html/T_Grasshopper_Kernel_Data_GH_IndexRuleSet.htm
"GH_IndexRuleSet Class")

[GH_IndexRuleSet Constructor
](../html/M_Grasshopper_Kernel_Data_GH_IndexRuleSet__ctor.htm "GH_IndexRuleSet
Constructor ")

[GH_IndexRuleSet
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_IndexRuleSet.htm
"GH_IndexRuleSet Properties")

[GH_IndexRuleSet
Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_IndexRuleSet.htm
"GH_IndexRuleSet Methods")

!Click or drag to
resize

# GH_IndexRuleSet Class

---

A collection of index rules.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_IndexRuleSet

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_IndexRuleSet

    Public Class GH_IndexRuleSet

The GH_IndexRuleSet type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_IndexRuleSet|  Blank
constructor. Creates an empty collection of rules.
Top

Properties

| Name| Description
---|---|---
|
Count|  Gets the number
of rules defined in this collection.
|
Rule|  Gets the rule at
the specified index.
Top

Methods

| Name| Description
---|---|---
|
AddAnyDigitRule|
Append a rule for any single digit.
|
AddAnyDigitsRule|
Append a rule for any amount of digits.
|
AddDigitPatternRule(Int32)|
Append a rule for filtering digit patterns.
| AddDigitPatternRule(Int32,
Int32)|
Append a rule for filtering digit patterns. This pattern does not have an
upper bound.
| AddDigitPatternRule(Int32, Int32,
Int32)|
Append a rule for filtering digit patterns.
|
AddDigitRule|
Append a single digit rule.
|
AddRangePatternRule|
Append a rule for filtering range patterns.
|
AddRangeRule|
Append a single range rule.
|
Evaluate|  Evaluate
the index given the local rules.
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com