---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_TagArtists_IGH_TagArtist.htm
scraped_at: 2025-09-08T16:14:58.941111
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas.TagArtists](../html/N_Grasshopper_GUI_Canvas_TagArtists.htm
"Grasshopper.GUI.Canvas.TagArtists")

[IGH_TagArtist
Interface](../html/T_Grasshopper_GUI_Canvas_TagArtists_IGH_TagArtist.htm
"IGH_TagArtist Interface")

[IGH_TagArtist
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_TagArtists_IGH_TagArtist.htm
"IGH_TagArtist Properties")

[IGH_TagArtist
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_TagArtists_IGH_TagArtist.htm
"IGH_TagArtist Methods")

!Click or drag to
resize

# IGH_TagArtist Interface

---

Defines the interface for TagArtist objects. TagArtists can be used to paint
additional stuff onto a GH_Canvas.

**Namespace:**
Grasshopper.GUI.Canvas.TagArtists
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_TagArtist

    Public Interface IGH_TagArtist

The IGH_TagArtist type exposes the following members.

Properties

| Name| Description
---|---|---
|
ID|  Gets the ID
of this Tag Artist object.
Top

Methods

| Name| Description
---|---|---
|
Paint|  This
method is called whenever a Canvas channel is painted
Top

See Also

#### Reference

Grasshopper.GUI.Canvas.TagArtists
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com