---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Brep_GH_BrepProxy.htm
scraped_at: 2025-09-08T16:20:22.346308
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Brep.GH_BrepProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Brep_GH_BrepProxy.htm
"GH_Brep.GH_BrepProxy Class")

[GH_Brep.GH_BrepProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Brep_GH_BrepProxy__ctor.htm
"GH_Brep.GH_BrepProxy Constructor ")

[GH_BrepProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Brep_GH_BrepProxy.htm
"GH_BrepProxy Properties")

[GH_BrepProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Brep_GH_BrepProxy.htm
"GH_BrepProxy Methods")

!Click or drag to
resize

# GH_BrepGH_BrepProxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Brep
Grasshopper.Kernel.TypesGH_BrepGH_BrepProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_BrepProxy : GH_GooProxy<GH_Brep>

    Public Class GH_BrepProxy
    	Inherits GH_GooProxy(Of GH_Brep)

The GH_BrepGH_BrepProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_BrepGH_BrepProxy|
Initializes a new instance of the GH_BrepGH_BrepProxy class
Top

Properties

| Name| Description
---|---|---
|
Area|
|
EdgeCount|
|
FaceCount|
|
LoopCount|
|
Manifold|
|
ObjectID|
|
Solid|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
|
VertexCount|
|
Volume|
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|
(Overrides
GH_GooProxyTFromString(String).)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com