---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_IGH_IndexRule.htm
scraped_at: 2025-09-08T16:19:26.090544
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[IGH_IndexRule Interface](../html/T_Grasshopper_Kernel_Data_IGH_IndexRule.htm
"IGH_IndexRule Interface")

[IGH_IndexRule
Methods](../html/Methods_T_Grasshopper_Kernel_Data_IGH_IndexRule.htm
"IGH_IndexRule Methods")

!Click or drag to
resize

# IGH_IndexRule Interface

---

Interface for index rules. An index rule is a way to determine whether a
specific integer is considered valid, invalid or neutral. Index rules are used
for selecting elements in DataTrees.

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_IndexRule

    Public Interface IGH_IndexRule

The IGH_IndexRule type exposes the following members.

Methods

| Name| Description
---|---|---
|
Evaluate|
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com