---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelContent.htm
scraped_at: 2025-09-08T16:22:33.877351
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelContent Class](../html/T_Grasshopper_Rhinoceros_ModelContent.htm
"ModelContent Class")

[ModelContent
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelContent.htm
"ModelContent Properties")

[ModelContent
Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelContent.htm
"ModelContent Methods")

[ModelContent Fields](../html/Fields_T_Grasshopper_Rhinoceros_ModelContent.htm
"ModelContent Fields")

!Click or drag to
resize

# ModelContent Class

---

Represents a Rhino model element.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
More...

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class ModelContent : ModelData,
    	IGH_ModelContentData, IEquatable<ModelContent>

    Public MustInherit Class ModelContent
    	Inherits ModelData
    	Implements IGH_ModelContentData, IEquatable(Of ModelContent)

The ModelContent type exposes the following members.

Properties

| Name| Description
---|---|---
|
Attribs|
|
DefaultAttributes|
(Inherited from ModelData.)
|
Id|
|
IsReferencedData|
|
IsReferencedDataLoaded|
|
IsValid|  (Overrides
ModelData.IsValid.)
|
IsValidWhyNot|
(Overrides
ModelDataIsValidWhyNot.)
|
Name|
|
Notes|
|
Parent|
|
Path|
|
Tags|
|
TypeDescription|
(Inherited from ModelData.)
Top

Methods

| Name| Description
---|---|---
|
AsFrozen|  Try to obtain
a dereferenced snapshot of itself.
|
Cast(Object)|
!Static
member| CastA,
T(Object)|
|
CastToT(T)|  (Overrides
ModelDataCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Overrides
ModelDataEquals(Object).)
|
FromId|
|
GetHashCode|
(Overrides
ModelDataGetHashCode.)
|
InternaliseData|
|
LoadReferencedData|
|
Read|  (Overrides
ModelDataRead(GH_IReader).)
|
RuntimeId|
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Overrides
ModelDataTooltipString.)
|
ToString|  (Overrides
ModelDataToString.)
|
UnloadReferencedData|
|
Write|  (Overrides
ModelDataWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
Serial|  (Inherited from
ModelData.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.Rhinoceros.DisplayModelDisplayMode
Grasshopper.Rhinoceros.DisplayModelNamedView
Grasshopper.Rhinoceros.DisplayModelViewport
Grasshopper.Rhinoceros.ModelModelEarthAnchorPoint
Grasshopper.RhinocerosModelComponentContent
Grasshopper.Rhinoceros.RenderModelRenderContent
Grasshopper.Rhinoceros.RenderModelRenderSkylight
Grasshopper.Rhinoceros.RenderModelRenderSun

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com