---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_QuickImageEditor.htm
scraped_at: 2025-09-08T16:12:59.396074
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_QuickImageEditor Class](../html/T_Grasshopper_GUI_GH_QuickImageEditor.htm
"GH_QuickImageEditor Class")

[GH_QuickImageEditor Constructor
](../html/M_Grasshopper_GUI_GH_QuickImageEditor__ctor.htm "GH_QuickImageEditor
Constructor ")

[GH_QuickImageEditor
Properties](../html/Properties_T_Grasshopper_GUI_GH_QuickImageEditor.htm
"GH_QuickImageEditor Properties")

[GH_QuickImageEditor
Methods](../html/Methods_T_Grasshopper_GUI_GH_QuickImageEditor.htm
"GH_QuickImageEditor Methods")

!Click or drag to
resize

# GH_QuickImageEditor Class

---

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsForm
Grasshopper.GUIGH_QuickImageEditor

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_QuickImageEditor : Form

    Public Class GH_QuickImageEditor
    	Inherits Form

The GH_QuickImageEditor type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_QuickImageEditor|
Initializes a new instance of the GH_QuickImageEditor class
Top

Properties

| Name| Description
---|---|---
|
CanvasImage|  Gets or
sets the canvas image.
|
FrameCrop|  Gets or
sets the cropping rectangle.
|
FrameFocus|  Gets or
sets the rectangle of the focus frame.
|
FrameViewport|
Gets or sets the rectangle of the viewport frame.
|
ViewportImage|
Gets or sets the viewport image.
|
ViewportName|  Gets
or sets the viewport name to include. If the name string is null or empty, the
active viewport is used.
Top

Methods

| Name| Description
---|---|---
|
Dispose| Releases the
unmanaged resources used by the GH_QuickImageEditor and optionally releases
the managed resources (Overrides
[FormDispose(Boolean)](https://docs.microsoft.com/dotnet/api/system.windows.forms.form.dispose#system-
windows-forms-form-dispose\(system-boolean\)).)
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto| Overloaded. (Defined by
EtoExtensions.)
|
ToEto| Overloaded. (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com