---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Expressions_GH_CodeStringSegment.htm
scraped_at: 2025-09-08T16:19:33.118110
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Expressions](../html/N_Grasshopper_Kernel_Expressions.htm
"Grasshopper.Kernel.Expressions")

[GH_CodeStringSegment
Class](../html/T_Grasshopper_Kernel_Expressions_GH_CodeStringSegment.htm
"GH_CodeStringSegment Class")

[GH_CodeStringSegment Constructor
](../html/M_Grasshopper_Kernel_Expressions_GH_CodeStringSegment__ctor.htm
"GH_CodeStringSegment Constructor ")

[GH_CodeStringSegment
Properties](../html/Properties_T_Grasshopper_Kernel_Expressions_GH_CodeStringSegment.htm
"GH_CodeStringSegment Properties")

[GH_CodeStringSegment
Methods](../html/Methods_T_Grasshopper_Kernel_Expressions_GH_CodeStringSegment.htm
"GH_CodeStringSegment Methods")

[GH_CodeStringSegment
Fields](../html/Fields_T_Grasshopper_Kernel_Expressions_GH_CodeStringSegment.htm
"GH_CodeStringSegment Fields")

!Click or drag to
resize

# GH_CodeStringSegment Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.ExpressionsGH_CodeStringSegment

**Namespace:**
Grasshopper.Kernel.Expressions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_CodeStringSegment

    Public Class GH_CodeStringSegment

The GH_CodeStringSegment type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_CodeStringSegment|
Initializes a new instance of the GH_CodeStringSegment class
Top

Properties

| Name| Description
---|---|---
|
IsCode|
|
String|
|
StringValue|
Top

Methods

| Name| Description
---|---|---
|
IsAlpha|
|
Replace|
|
ReplaceToken|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

Fields

| Name| Description
---|---|---
|
m_IsCode|
|
m_String|
Top

See Also

#### Reference

Grasshopper.Kernel.Expressions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com