---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Instances.htm
scraped_at: 2025-09-08T16:11:46.100128
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper

Instances Class

[Instances Properties](../html/Properties_T_Grasshopper_Instances.htm
"Instances Properties")

[Instances Methods](../html/Methods_T_Grasshopper_Instances.htm "Instances
Methods")

[Instances Events](../html/Events_T_Grasshopper_Instances.htm "Instances
Events")

[Instances Fields](../html/Fields_T_Grasshopper_Instances.htm "Instances
Fields")

!Click or drag to
resize

# Instances Class

---

Provides access to a bunch of global instances and variables.

Inheritance Hierarchy

SystemObject
GrasshopperInstances

**Namespace:** Grasshopper
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Instances

    Public NotInheritable Class Instances

The Instances type exposes the following members.

Properties

| Name| Description
---|---|---
!Static
member|
ActiveCanvas|  Gets the currently
active Grasshopper canvas (if any)
!Static
member|
ActiveDocument|
!Static
member|
ActiveRhinoDoc|
!Static
member|
AutoHideBanner|  Gets or sets a
value indicating whether the banner ought to be hidden automatically when
loading completes.
!Static
member|
AutoShowBanner|  Gets or sets a
value indicating whether or not the banner will be displayed during the
ComponentServer Loading process.
!Static
member|
ComponentServer|  Gets the
ComponentServer instance cached by the Instance Server. The ComponentServer
will be instantiated the first time this property accessed. This is a rather
involved process during which the Grasshopper Banner will be displayed.
!Static
member|
CursorServer|  Gets the
CursorServer instance cached by the Instance Server. The CursorServer will be
instantiated the first time this property is accessed.
!Static
member|
DocumentAssociationServer|
Gets the Document Association Server instance cached by the Instance Server.
The Document Association Server will be instantiated the first time this
property accessed.
!Static
member|
DocumentEditor|  Gets the
DocumentEditor of Grasshopper.
!Static
member|
DocumentServer|  Gets the
DocumentServer instance cached by the Instance Server. The DocumentServer will
be instantiated the first time this property accessed.
!Static
member|
EtoDocumentEditor|
!Static
member|
GrasshopperPluginId|  Gets
the ID of the Grasshopper Plugin.
!Static
member|
IsComponentServer|  Gets
whether the Component server has been set.
!Static
member|
IsCursorServer|  Gets whether
the Cursor server has been set.
!Static
member|
IsDocumentAssociationServer|
Gets whether the Document Association server has been set.
!Static
member|
IsDocumentEditor|  Gets
whether the Document Editor has been set.
!Static
member|
IsDocumentEditorOnTopOfViewports|
Gets whether the Grasshopper document editor (or any of its child forms) is
obscuring a significant part of the Rhino viewports.
!Static
member|
IsDocumentServer|  Gets
whether the Document server has been set.
!Static
member|
IsMarkovChain|  Gets a value
indicating whether or not the MarkovChain has already been initialized.
!Static
member|
IsMruServer|  Gets a value
indicating whether or not the MRU server has been initialized.
!Static
member|
IsRemotePanelVisible|
Gets whether the Remote Control Panel is currently visible.
!Static
member|
MarkovChain|  Gets the MarkovChain
instance cached by the Instance Server. The Markov chain will be instantiated
if it hasn't been already.
!Static
member|
MruServer|  Gets the MRU_Server
instance cached by the Instance Server. The MRU_Server will be instantiated
the first time this property accessed.
!Static
member|
RcpPanel|  Gets the app-domain wide
RCP panel instance. If it doesn't exist yet it will be created.
!Static
member|
RunningHeadless|
!Static
member|
Settings|  Represents the default
settings database. Feel free to add your own settings to this database.
Top

Methods

| Name| Description
---|---|---
|
DocumentEditorFadeIn|
Calls the FadeIn() method on the DocumentEditor if it exists.
|
DocumentEditorFadeOut|
Calls the FadeOut() method on the DocumentEditor if it exists.
|
EnforceInvariantCulture|
If the Setting "EnforceInvariantCulture" is set to False, this function does
nothing
|
HideRemotePanel|  Hides the
remote control panel.
|
Interop|  Gets the Grasshopper 1.0
interop object, i.e. an instance of GrasshopperPlugin.GrasshopperInterop as
exposed via the GetInteropObject() method on the Grasshopper 1.0 plugin
object.
|
InvalidateCanvas|  Invalidates
the currently active Grasshopper Canvas, causing a redraw sometime in the
foreseeable future.
|
RedrawAll|  Forces a redraw of both
the active canvas and the Rhino viewports on the active document.
|
RedrawCanvas|  Forces a redraw of
the currently active Grasshopper Canvas.
|
ReloadMemoryAssemblies|
Unload and attempt to reload all plugin assemblies that were loaded via the
COFF pipeline.
|
ShowRemotePanel|  Shows the
remote control panel.
|
UnloadAllObjects|  Clears and
unloads all cached objects. This function is called by the
_GrasshopperUnloadPlugin command. Please don't use it.
Top

Events

| Name| Description
---|---|---
|
CanvasCreated|  Raised when the
main canvas is created.
|
CanvasDestroyed|  Raised when
the main canvas is destroyed.
Top

Fields

| Name| Description
---|---|---
|
LoadOneByOne|
Top

See Also

#### Reference

Grasshopper Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com