---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Undo_GH_UndoException.htm
scraped_at: 2025-09-08T16:22:02.772007
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Undo](../html/N_Grasshopper_Kernel_Undo.htm
"Grasshopper.Kernel.Undo")

[GH_UndoException
Class](../html/T_Grasshopper_Kernel_Undo_GH_UndoException.htm
"GH_UndoException Class")

[GH_UndoException Constructor
](../html/Overload_Grasshopper_Kernel_Undo_GH_UndoException__ctor.htm
"GH_UndoException Constructor ")

!Click or drag to
resize

# GH_UndoException Class

---

Exception associated with undo events

Inheritance Hierarchy

SystemObject
SystemException
Grasshopper.Kernel.UndoGH_UndoException

**Namespace:** Grasshopper.Kernel.Undo
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_UndoException : Exception

    Public Class GH_UndoException
    	Inherits Exception

Constructors

| Name| Description
---|---|---
|
GH_UndoException(String)|
Initializes a new instance of the GH_UndoException class
| GH_UndoException(String,
Object)| Initializes
a new instance of the GH_UndoException class
Top

See Also

#### Reference

Grasshopper.Kernel.Undo Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com