---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_StandardIcons.htm
scraped_at: 2025-09-08T16:13:10.468043
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_StandardIcons Class](../html/T_Grasshopper_GUI_GH_StandardIcons.htm
"GH_StandardIcons Class")

[GH_StandardIcons
Properties](../html/Properties_T_Grasshopper_GUI_GH_StandardIcons.htm
"GH_StandardIcons Properties")

!Click or drag to
resize

# GH_StandardIcons Class

---

Provides access to a set of standard icons.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_StandardIcons

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_StandardIcons

    Public NotInheritable Class GH_StandardIcons

The GH_StandardIcons type exposes the following members.

Properties

| Name| Description
---|---|---
!Static
member|
BlankObjectIcon_24x24|
Gets the base icon for objects; an empty white square.
!Static
member|
BlankParameterIcon_24x24|
Gets the base icon for parameters; an empty black hexagon.
!Static
member|
ClusterIcon_24x24|
Gets the icon used for clusters.
!Static
member|
FileIconDll_32x32|
Gets the file icon used for Dll files.
!Static
member|
FileIconExe_32x32|
Gets the file icon used for Exe files.
!Static
member|
FileIconGH_32x36|
Gets the file icon used for Grasshopper Binary files.
!Static
member|
FileIconGha_32x32|
Gets the file icon used for Gha files.
!Static
member|
FileIconGHMissing_32x36|
Gets the file icon used for missing Grasshopper Binary files.
!Static
member|
FileIconGHX_32x36|
Gets the file icon used for Grasshopper Xml files.
!Static
member|
FileIconGHXMissing_32x36|
Gets the file icon used for missing Grasshopper Xml files.
!Static
member|
FileIconRhp_32x32|
Gets the file icon used for Rhp files.
!Static
member|
FlattenIcon_24x24|
Gets the trunk icon used to indicate flattening.
!Static
member|
GraftIcon_24x24|
Gets the twig icon used to indicate grafting.
!Static
member|
GroupIcon_24x24|
Gets the icon used for canvas groups.
!Static
member|
UnknownObjectIcon_24x24|
Gets the icon used for objects that do not have their own icon and unknown
objects.
!Static
member|
UserObjectIcon_24x24|
Gets the icon used for user objects.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com