---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Dimension_GH_DimensionProxy.htm
scraped_at: 2025-09-08T16:20:34.362859
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Dimension.GH_DimensionProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Dimension_GH_DimensionProxy.htm
"GH_Dimension.GH_DimensionProxy Class")

[GH_Dimension.GH_DimensionProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Dimension_GH_DimensionProxy__ctor.htm
"GH_Dimension.GH_DimensionProxy Constructor ")

[GH_DimensionProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Dimension_GH_DimensionProxy.htm
"GH_DimensionProxy Properties")

[GH_DimensionProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Dimension_GH_DimensionProxy.htm
"GH_DimensionProxy Methods")

!Click or drag to
resize

# GH_DimensionGH_DimensionProxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Dimension
Grasshopper.Kernel.TypesGH_AnnotationBaseGH_AnnotationBaseProxyGH_Dimension
Grasshopper.Kernel.TypesGH_DimensionGH_DimensionProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DimensionProxy : GH_AnnotationBaseGH_AnnotationBaseProxy<GH_Dimension>

    Public Class GH_DimensionProxy
    	Inherits GH_AnnotationBaseGH_AnnotationBaseProxy(Of GH_Dimension)

The GH_DimensionGH_DimensionProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DimensionGH_DimensionProxy|
Initializes a new instance of the GH_DimensionGH_DimensionProxy class
Top

Properties

| Name| Description
---|---|---
|
AnnotationType|
(Inherited from
GH_AnnotationBaseGH_AnnotationBaseProxyT.)
|
Measure|
|
ObjectID|
(Inherited from
GH_AnnotationBaseGH_AnnotationBaseProxyT.)
|
PlainText|
(Inherited from
GH_AnnotationBaseGH_AnnotationBaseProxyT.)
|
Style|
(Inherited from
GH_AnnotationBaseGH_AnnotationBaseProxyT.)
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com