---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_LexerCombo.htm
scraped_at: 2025-09-08T16:19:04.981957
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_LexerCombo Class](../html/T_Grasshopper_Kernel_Data_GH_LexerCombo.htm
"GH_LexerCombo Class")

[GH_LexerCombo Constructor
](../html/Overload_Grasshopper_Kernel_Data_GH_LexerCombo__ctor.htm
"GH_LexerCombo Constructor ")

[GH_LexerCombo
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_LexerCombo.htm
"GH_LexerCombo Properties")

!Click or drag to
resize

# GH_LexerCombo Class

---

Contains both a source and a target lexer object.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_LexerCombo

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_LexerCombo

    Public Class GH_LexerCombo

The GH_LexerCombo type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_LexerCombo|
Initializes a new instance of the GH_LexerCombo class
| GH_LexerCombo(GH_Lexer,
GH_Lexer)| Initializes a
new instance of the GH_LexerCombo class
| GH_LexerCombo(String,
String)| Initializes a
new instance of the GH_LexerCombo class
Top

Properties

| Name| Description
---|---|---
|
Source|  Gets or sets
the lexer object that represents the source of a lexical operation.
|
Target|  Gets or sets
the lexer object that represents the target of a lexical operation.
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com