---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Undo_GH_ObjectUndoAction.htm
scraped_at: 2025-09-08T16:22:00.743617
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Undo](../html/N_Grasshopper_Kernel_Undo.htm
"Grasshopper.Kernel.Undo")

[GH_ObjectUndoAction
Class](../html/T_Grasshopper_Kernel_Undo_GH_ObjectUndoAction.htm
"GH_ObjectUndoAction Class")

[GH_ObjectUndoAction Constructor
](../html/M_Grasshopper_Kernel_Undo_GH_ObjectUndoAction__ctor.htm
"GH_ObjectUndoAction Constructor ")

[GH_ObjectUndoAction
Properties](../html/Properties_T_Grasshopper_Kernel_Undo_GH_ObjectUndoAction.htm
"GH_ObjectUndoAction Properties")

[GH_ObjectUndoAction
Methods](../html/Methods_T_Grasshopper_Kernel_Undo_GH_ObjectUndoAction.htm
"GH_ObjectUndoAction Methods")

!Click or drag to
resize

# GH_ObjectUndoAction Class

---

Utility base class for undo actions that operate on a single
IGH_DocumentObject.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.UndoGH_UndoAction
Grasshopper.Kernel.UndoGH_ObjectUndoAction
More...

**Namespace:** Grasshopper.Kernel.Undo
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_ObjectUndoAction : GH_UndoAction

    Public MustInherit Class GH_ObjectUndoAction
    	Inherits GH_UndoAction

The GH_ObjectUndoAction type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ObjectUndoAction|
Initializes a new instance of the GH_ObjectUndoAction class
Top

Properties

| Name| Description
---|---|---
|
ExpiresDisplay|
Override this property if you want the Rhino viewport display to refresh upon
undo completion.  (Inherited from
GH_UndoAction.)
|
ExpiresSolution|
Override this property if you want the Grasshopper solution to refresh upon
undo completion.  (Inherited from
GH_UndoAction.)
|
State|  (Inherited from
GH_UndoAction.)
Top

Methods

| Name| Description
---|---|---
|
Internal_Redo|
(Overrides
GH_UndoActionInternal_Redo(GH_Document).)
|
Internal_Undo|
(Overrides
GH_UndoActionInternal_Undo(GH_Document).)
|
Object_Redo|
|
Object_Undo|
|
Read|  (Inherited from
GH_UndoAction.)
|
Redo|  (Inherited from
GH_UndoAction.)
|
Undo|  (Inherited from
GH_UndoAction.)
|
Write|  (Inherited from
GH_UndoAction.)
Top

See Also

#### Reference

Grasshopper.Kernel.Undo Namespace

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.UndoGH_UndoAction
Grasshopper.Kernel.UndoGH_ObjectUndoAction
Grasshopper.Kernel.Undo.ActionsGH_DataMatchingAction
Grasshopper.Kernel.Undo.ActionsGH_DataModificationAction
Grasshopper.Kernel.Undo.ActionsGH_HiddenAction
Grasshopper.Kernel.Undo.ActionsGH_IconDisplayAction
Grasshopper.Kernel.Undo.ActionsGH_IconOverrideAction
Grasshopper.Kernel.Undo.ActionsGH_LayoutAction
Grasshopper.Kernel.Undo.ActionsGH_LockedAction
Grasshopper.Kernel.Undo.ActionsGH_NickNameAction
Grasshopper.Kernel.Undo.ActionsGH_PersistentDataActionT
Grasshopper.Kernel.Undo.ActionsGH_PivotAction
Grasshopper.Kernel.Undo.ActionsGH_WireDisplayAction

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com