---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_PaletteStyle.htm
scraped_at: 2025-09-08T16:14:45.877044
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_PaletteStyle Class](../html/T_Grasshopper_GUI_Canvas_GH_PaletteStyle.htm
"GH_PaletteStyle Class")

[GH_PaletteStyle Constructor
](../html/Overload_Grasshopper_GUI_Canvas_GH_PaletteStyle__ctor.htm
"GH_PaletteStyle Constructor ")

[GH_PaletteStyle
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_GH_PaletteStyle.htm
"GH_PaletteStyle Properties")

[GH_PaletteStyle
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_PaletteStyle.htm
"GH_PaletteStyle Methods")

!Click or drag to
resize

# GH_PaletteStyle Class

---

Contains all the colours for a single capsule palette.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_PaletteStyle

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PaletteStyle

    Public Class GH_PaletteStyle

The GH_PaletteStyle type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PaletteStyle(Color)|
Construct a new GH_Box_Palette_Colours instance with a single base colour.
| GH_PaletteStyle(Color,
Color)|  Construct a
new GH_Box_Palette_Colours instance.
| GH_PaletteStyle(Color, Color,
Color)|  Construct a
new GH_Box_Palette_Colours instance.
Top

Properties

| Name| Description
---|---|---
|
Edge|  Gets or sets the
edge of this style.
|
Fill|  Gets or sets the
fill of this style.
|
Text|  Gets or sets the
text of this style.
Top

Methods

| Name| Description
---|---|---
|
CreateBrush|
Create a fill brush. At low zoom levels the brush will be solid colour, at
medium to high zoom levels the brush will have a gradient.
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com