---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Theme_GH_PaletteSettings.htm
scraped_at: 2025-09-08T16:15:12.975975
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Theme](../html/N_Grasshopper_GUI_Theme.htm
"Grasshopper.GUI.Theme")

[GH_PaletteSettings
Class](../html/T_Grasshopper_GUI_Theme_GH_PaletteSettings.htm
"GH_PaletteSettings Class")

[GH_PaletteSettings
Properties](../html/Properties_T_Grasshopper_GUI_Theme_GH_PaletteSettings.htm
"GH_PaletteSettings Properties")

!Click or drag to
resize

# GH_PaletteSettings Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.ThemeGH_PaletteSettings

**Namespace:** Grasshopper.GUI.Theme
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PaletteSettings

    Public Class GH_PaletteSettings

The GH_PaletteSettings type exposes the following members.

Properties

| Name| Description
---|---|---
|
ErrorSelected|
Gets or sets the palette style for selected Error palettes.
|
ErrorStandard|
Gets or sets the palette style for unselected Error palettes.
|
HiddenSelected|
Gets or sets the palette style for selected Hidden palettes.
|
HiddenStandard|
Gets or sets the palette style for unselected Hidden palettes.
|
LockedSelected|
Gets or sets the palette style for selected Locked palettes.
|
LockedStandard|
Gets or sets the palette style for unselected Locked palettes.
|
NormalSelected|
Gets or sets the palette style for selected Normal palettes.
|
NormalStandard|
Gets or sets the palette style for unselected Normal palettes.
|
WarningSelected|
Gets or sets the palette style for selected Warning palettes.
|
WarningStandard|
Gets or sets the palette style for unselected Warning palettes.
Top

See Also

#### Reference

Grasshopper.GUI.Theme Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com