---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_ObjectDisplayColor.htm
scraped_at: 2025-09-08T16:23:31.112341
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[ObjectDisplayColor
Class](../html/T_Grasshopper_Rhinoceros_Display_ObjectDisplayColor.htm
"ObjectDisplayColor Class")

[ObjectDisplayColor Constructor
](../html/Overload_Grasshopper_Rhinoceros_Display_ObjectDisplayColor__ctor.htm
"ObjectDisplayColor Constructor ")

[ObjectDisplayColor
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_ObjectDisplayColor.htm
"ObjectDisplayColor Properties")

[ObjectDisplayColor
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_ObjectDisplayColor.htm
"ObjectDisplayColor Methods")

[ObjectDisplayColor Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Display_ObjectDisplayColor.htm
"ObjectDisplayColor Type Conversions")

!Click or drag to
resize

# ObjectDisplayColor Class

---

Represents a Rhino object display color.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.Rhinoceros.DisplayObjectDisplayColor

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ObjectDisplayColor : ModelValue

    Public NotInheritable Class ObjectDisplayColor
    	Inherits ModelValue

The ObjectDisplayColor type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectDisplayColor|
Initializes a new instance of the ObjectDisplayColor class
|
ObjectDisplayColor(ObjectDisplayColorValue)|
Initializes a new instance of the ObjectDisplayColor class
Top

Properties

| Name| Description
---|---|---
|
Color|
|
Source|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelValueCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelValue.)
|
Equals(ModelValue)|
(Inherited from ModelValue.)
|
Equals(Object)|
(Overrides
ModelValueEquals(Object).)
|
GetHashCode|
(Overrides
ModelValueGetHashCode.)
|
TooltipString|
(Inherited from ModelValue.)
|
ToString|  (Inherited from
ModelValue.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ObjectDisplayColor to
ObjectDisplayColorValue)|
!Static
member| (ObjectDisplayColorValue to
ObjectDisplayColor)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com