---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_AnnotationLeaderSettings_Attributes.htm
scraped_at: 2025-09-08T16:22:55.957044
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations](../html/N_Grasshopper_Rhinoceros_Annotations.htm
"Grasshopper.Rhinoceros.Annotations")

[AnnotationLeaderSettings.Attributes
Class](../html/T_Grasshopper_Rhinoceros_Annotations_AnnotationLeaderSettings_Attributes.htm
"AnnotationLeaderSettings.Attributes Class")

[AnnotationLeaderSettings.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_Annotations_AnnotationLeaderSettings_Attributes__ctor.htm
"AnnotationLeaderSettings.Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_AnnotationLeaderSettings_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_AnnotationLeaderSettings_Attributes.htm
"Attributes Methods")

!Click or drag to
resize

# AnnotationLeaderSettingsAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.Rhinoceros.AnnotationsAnnotationLeaderSettingsAttributes

**Namespace:**
Grasshopper.Rhinoceros.Annotations
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Attributes : ModelDataAttributes,
    	IStructuralEquatable, IEquatable<AnnotationLeaderSettingsAttributes>

    Public NotInheritable Class Attributes
    	Inherits ModelDataAttributes
    	Implements IStructuralEquatable, IEquatable(Of AnnotationLeaderSettingsAttributes)

The AnnotationLeaderSettingsAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
AnnotationLeaderSettingsAttributes|
Initializes a new instance of the AnnotationLeaderSettingsAttributes class
Top

Properties

| Name| Description
---|---|---
|
ContentAngleType|
|
CurveType|
|
HasLanding|
|
LandingLength|
|
TextHorizontalAlignment|
|
TextOrientation|
|
TextVerticalAlignment|
Top

Methods

| Name| Description
---|---|---
|
Clone|  (Inherited
from
ModelDataAttributes.)
|
Equals(Object)|
(Overrides
[ObjectEquals(Object)](https://docs.microsoft.com/dotnet/api/system.object.equals#system-
object-equals\(system-object\)).)
| Equals(Object,
IEqualityComparer)|
|
From|
|
GetHashCode|
(Overrides
[ObjectGetHashCode](https://docs.microsoft.com/dotnet/api/system.object.gethashcode#system-
object-gethashcode).)
|
GetHashCode(IEqualityComparer)|
|
ToDetails|
(Overrides
ModelDataAttributesToDetails.)
|
ToModelData|
(Overrides
ModelDataAttributesToModelData.)
|
ToString|
(Inherited from
ModelDataAttributes.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com