---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Plugin_GH_ResourceGate.htm
scraped_at: 2025-09-08T16:22:27.833634
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Plugin

[GH_ResourceGate Class](../html/T_Grasshopper_Plugin_GH_ResourceGate.htm
"GH_ResourceGate Class")

[GH_ResourceGate
Properties](../html/Properties_T_Grasshopper_Plugin_GH_ResourceGate.htm
"GH_ResourceGate Properties")

!Click or drag to
resize

# GH_ResourceGate Class

---

This class provides access to specific resources of the Grasshopper assembly.

Inheritance Hierarchy

SystemObject
Grasshopper.PluginGH_ResourceGate

**Namespace:** Grasshopper.Plugin
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_ResourceGate

    Public NotInheritable Class GH_ResourceGate

The GH_ResourceGate type exposes the following members.

Properties

| Name| Description
---|---|---
!Static
member|
BlackIcon|  Returns a
24x24 hexagonal black icon.
!Static
member|
Error_12x12|  Returns
a 12x12 round red icon
!Static
member|
Error_16x16|  Returns
a 16x16 round red icon
!Static
member|
Error_24x24|  Returns
a 24x24 round red icon
!Static
member|
Error_40x40|  Returns
a 40x40 round red icon
!Static
member|
Info_12x12|  Returns a
12x12 round blue icon
!Static
member|
Info_16x16|  Returns a
16x16 round blue icon
!Static
member|
Info_24x24|  Returns a
24x24 round blue icon
!Static
member|
Info_40x40|  Returns a
40x40 round blue icon
!Static
member|
OK_12x12|  Returns a
12x12 round green icon
!Static
member|
OK_16x16|  Returns a
16x16 round green icon
!Static
member|
OK_24x24|  Returns a
24x24 round green icon
!Static
member|
OK_40x40|  Returns a
40x40 round green icon
!Static
member|
Warning_12x12|
Returns a 12x12 round yellow icon
!Static
member|
Warning_16x16|
Returns a 16x16 round yellow icon
!Static
member|
Warning_24x24|
Returns a 24x24 round yellow icon
!Static
member|
Warning_40x40|
Returns a 40x40 round yellow icon
!Static
member|
WhiteIcon|  Returns a
24x24 square white icon.
Top

See Also

#### Reference

Grasshopper.Plugin Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com