---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Curve_GH_CurveProxy.htm
scraped_at: 2025-09-08T16:20:30.355793
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Curve.GH_CurveProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Curve_GH_CurveProxy.htm
"GH_Curve.GH_CurveProxy Class")

[GH_Curve.GH_CurveProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Curve_GH_CurveProxy__ctor.htm
"GH_Curve.GH_CurveProxy Constructor ")

[GH_CurveProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Curve_GH_CurveProxy.htm
"GH_CurveProxy Properties")

[GH_CurveProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Curve_GH_CurveProxy.htm
"GH_CurveProxy Methods")

!Click or drag to
resize

# GH_CurveGH_CurveProxy Class

---

Proxy description of GH_Curve class. This class is used by the Generic
Multivalue interfaces.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Curve
Grasshopper.Kernel.TypesGH_CurveGH_CurveProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_CurveProxy : GH_GooProxy<GH_Curve>

    Public Class GH_CurveProxy
    	Inherits GH_GooProxy(Of GH_Curve)

The GH_CurveGH_CurveProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_CurveGH_CurveProxy|
Initializes a new instance of the GH_CurveGH_CurveProxy class
Top

Properties

| Name| Description
---|---|---
|
Closed|
|
Deformable|
|
Domain|
|
Length|
|
Linear|
|
ObjectID|
|
Periodic|
|
Planar|
|
Type|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|
(Overrides
GH_GooProxyTFromString(String).)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com