---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_ExternalFileConflictDialog.htm
scraped_at: 2025-09-08T16:12:32.317715
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_ExternalFileConflictDialog
Class](../html/T_Grasshopper_GUI_GH_ExternalFileConflictDialog.htm
"GH_ExternalFileConflictDialog Class")

[GH_ExternalFileConflictDialog Constructor
](../html/M_Grasshopper_GUI_GH_ExternalFileConflictDialog__ctor.htm
"GH_ExternalFileConflictDialog Constructor ")

[GH_ExternalFileConflictDialog
Properties](../html/Properties_T_Grasshopper_GUI_GH_ExternalFileConflictDialog.htm
"GH_ExternalFileConflictDialog Properties")

[GH_ExternalFileConflictDialog
Methods](../html/Methods_T_Grasshopper_GUI_GH_ExternalFileConflictDialog.htm
"GH_ExternalFileConflictDialog Methods")

!Click or drag to
resize

# GH_ExternalFileConflictDialog Class

---

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsForm
Grasshopper.GUIGH_ExternalFileConflictDialog

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ExternalFileConflictDialog : Form

    Public Class GH_ExternalFileConflictDialog
    	Inherits Form

The GH_ExternalFileConflictDialog type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ExternalFileConflictDialog|
Initializes a new instance of the GH_ExternalFileConflictDialog class
Top

Properties

| Name| Description
---|---|---
|
FilePathA|
|
FilePathB|
|
InfoLabel|
|
LoadFileCode|
Top

Methods

| Name| Description
---|---|---
|
Dispose|
Releases the unmanaged resources used by the GH_ExternalFileConflictDialog and
optionally releases the managed resources (Overrides
[FormDispose(Boolean)](https://docs.microsoft.com/dotnet/api/system.windows.forms.form.dispose#system-
windows-forms-form-dispose\(system-boolean\)).)
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto| Overloaded. (Defined by
EtoExtensions.)
|
ToEto| Overloaded. (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com