---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DocSettingsEventArgs.htm
scraped_at: 2025-09-08T16:16:08.202687
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocSettingsEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DocSettingsEventArgs.htm
"GH_DocSettingsEventArgs Class")

[GH_DocSettingsEventArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_DocSettingsEventArgs.htm
"GH_DocSettingsEventArgs Properties")

!Click or drag to
resize

# GH_DocSettingsEventArgs Class

---

These arguments are passed along with SettingsChanged events on GH_Document.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_DocSettingsEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DocSettingsEventArgs : EventArgs

    Public Class GH_DocSettingsEventArgs
    	Inherits EventArgs

The GH_DocSettingsEventArgs type exposes the following members.

Properties

| Name| Description
---|---|---
|
Document|  Gets
the document that raised the event.
|
Kind|  Gets the type
of setting that was changed.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com