---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_ExternalFile.htm
scraped_at: 2025-09-08T16:16:40.323810
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_ExternalFile Class](../html/T_Grasshopper_Kernel_GH_ExternalFile.htm
"GH_ExternalFile Class")

[GH_ExternalFile Constructor
](../html/M_Grasshopper_Kernel_GH_ExternalFile__ctor.htm "GH_ExternalFile
Constructor ")

[GH_ExternalFile
Properties](../html/Properties_T_Grasshopper_Kernel_GH_ExternalFile.htm
"GH_ExternalFile Properties")

[GH_ExternalFile
Methods](../html/Methods_T_Grasshopper_Kernel_GH_ExternalFile.htm
"GH_ExternalFile Methods")

!Click or drag to
resize

# GH_ExternalFile Class

---

Represents information about external files to be loaded.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_ExternalFile

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ExternalFile

    Public Class GH_ExternalFile

The GH_ExternalFile type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ExternalFile|  Create a
new instance of the file info class
Top

Properties

| Name| Description
---|---|---
|
FileHash|  Gets the file
hash.
|
FileName|  Gets the file
name (without the extension).
|
FilePath|  Gets the file
path.
|
FileSize|  Gets the file
size (in bytes).
|
FileType|  Gets the file
type as indicated by the extension.
Top

Methods

| Name| Description
---|---|---
|
IsIdenticalTo|
Compares two files for content. If the size and the hash or the other file are
equal to this one, the files are considered identical.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com