---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_Painter.htm
scraped_at: 2025-09-08T16:14:43.856633
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_Painter Class](../html/T_Grasshopper_GUI_Canvas_GH_Painter.htm "GH_Painter
Class")

[GH_Painter Constructor
](../html/M_Grasshopper_GUI_Canvas_GH_Painter__ctor.htm "GH_Painter
Constructor ")

[GH_Painter Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_Painter.htm
"GH_Painter Methods")

!Click or drag to
resize

# GH_Painter Class

---

This class performs most of the drawing operations required for Grasshopper
Canvas controls.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_Painter

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Painter

    Public Class GH_Painter

The GH_Painter type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Painter|  Constructor.
Top

Methods

| Name| Description
---|---|---
|
ConnectionPath|
|
ConnectionPathBezier|
|
ConnectionVisible|
Test whether a wire ought to be drawn at all.
|
DetermineWireType|
Utility method for determining wire display types.
|
DrawBackground|
|
DrawConnection|
|
DrawMiddleGround|
|
DrawNoDocumentMessage|
|
DrawNULLBuffer|
|
DrawPivots|
|
DrawRecipientLinks(GH_Document)|
|
DrawRecipientLinks(IGH_Param)|
|
DrawStateFlags|
|
GenerateWirePen_Fill|
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com