---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_Format.htm
scraped_at: 2025-09-08T16:16:53.445494
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_Format Class](../html/T_Grasshopper_Kernel_GH_Format.htm "GH_Format
Class")

[GH_Format Methods](../html/Methods_T_Grasshopper_Kernel_GH_Format.htm
"GH_Format Methods")

!Click or drag to
resize

# GH_Format Class

---

Provides standard Grasshopper formatting functions.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_Format

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_Format

    Public NotInheritable Class GH_Format

The GH_Format type exposes the following members.

Methods

| Name| Description
---|---|---
|
DefaultCulture|
|
FormatAngularDimension|
|
FormatAnnotationValidity|
If the annotation is invalid, return a string describing why.
|
FormatArc(Arc)|
|
FormatArc(GH_Arc)|
|
FormatArcValidity|  If
the arc is invalid, return a string describing why.
|
FormatBoolean(Boolean)|
|
FormatBoolean(GH_Boolean)|
|
FormatBoundingBoxValidity|
If the box is invalid, return a string describing why.
|
FormatBox(Box)|
|
FormatBox(GH_Box)|
|
FormatBoxValidity|  If
the box is invalid, return a string describing why.
|
FormatBrep(Brep)|
|
FormatBrep(GH_Brep)|
|
FormatBrepValidity|
If the brep is invalid, return a string describing why.
|
FormatCentermark|
|
FormatCircle(Circle)|
|
FormatCircle(GH_Circle)|
|
FormatCircleValidity|
If the circle is invalid, return a string describing why.
|
FormatColour(Color)|
|
FormatColour(GH_Colour)|
|
FormatComplexNumber(Complex)|
|
FormatComplexNumber(GH_ComplexNumber)|
|
FormatComplexValidity|
If the complex number is invalid, return a string describing why.
|
FormatCurve(GH_Curve)|
|
FormatCurve(Curve, String,
String)|
|
FormatCurveValidity|
If the curve is invalid, return a string describing why.
|
FormatDate(DateTime)|
|
FormatDate(GH_Time)|
|
FormatDetailView|
|
FormatDetailViewValidity|
If the detail view is invalid, return a string describing why.
|
FormatDimension|
|
FormatDouble(Double)|
|
FormatDouble(GH_Number)|
|
FormatDoubleValidity|
If the number is invalid, return a string describing why.
|
FormatExtrusion(Extrusion)|
|
FormatExtrusion(GH_Extrusion)|
|
FormatExtrusionValidity|
If the extrusion is invalid, return a string describing why.
|
FormatFilePath(String,
Int32)|  Format a filepath
so that it doesn't exceed a string length. If the filepath filename is already
longer than maxLength it will be returned intact.
|
FormatFilePath(String, Int32,
Font)|  Format a
filepath so that it doesn't exceed width. If the filepath filename is already
longer than maxLength it will be returned intact.
|
FormatGeometry|
|
FormatHatch|
|
FormatHatchValidity|
If the hatch is invalid, return a string describing why.
|
FormatInstanceReference|
|
FormatInstanceReferenceValidity|
If the instance reference is invalid, return a string describing why.
|
FormatInteger(GH_Integer)|
|
FormatInteger(Int32)|
|
FormatInterval(GH_Interval)|
|
FormatInterval(GH_Interval2D)|
|
FormatInterval(Interval)|
|
FormatInterval(Double,
Double)|
|
FormatIntervalValidity|
If the point is invalid, return a string describing why.
|
FormatKeys|  Format a keys
enumeration as though it's a menu shortcut
|
FormatLeader|
|
FormatLightValidity|
If the light is invalid, return a string describing why.
|
FormatLine(GH_Line)|
|
FormatLine(Line)|
|
FormatLinearDimension|
|
FormatLineValidity|
If the line is invalid, return a string describing why.
|
FormatMatrix(GH_Matrix)|
|
FormatMatrix(Matrix)|
|
FormatMesh(GH_Mesh)|
|
FormatMesh(Mesh, String)|
|
FormatMeshFace|
|
FormatMeshFaceValidity|
If the number is invalid, return a string describing why.
|
FormatMeshValidity|
If the mesh is invalid, return a string describing why.
|
FormatOrdinateDimension|
|
FormatPlane(GH_Plane)|
|
FormatPlane(Plane)|
|
FormatPlaneValidity|
If the plane is invalid, return a string describing why.
|
FormatPoint(GH_Point)|
|
FormatPoint(Point3d)|
|
FormatPointCloud(GH_PointCloud)|
|
FormatPointCloud(PointCloud)|
|
FormatPointCloud(PointCloud,
String)|
|
FormatPointCloudValidity|
If the pointcloud is invalid, return a string describing why.
|
FormatPointValidity|
If the point is invalid, return a string describing why.
|
FormatRadialDimension|
|
FormatRectangleValidity|
If the rectangle is invalid, return a string describing why.
|
FormatSingle|
|
FormatString|  Replaces the
format items in a string with the string representations of corresponding
objects in a specified array.
|
FormatSubD(GH_SubD)|
|
FormatSubD(SubD)|
|
FormatSubDValidity|
If the brep is invalid, return a string describing why.
|
FormatSurface(Brep)|
|
FormatSurface(GH_Surface)|
|
FormatSurfaceValidity|
If the surface is invalid, return a string describing why.
|
FormatTextDot|
|
FormatTextDotValidity|
If the text dot is invalid, return a string describing why.
|
FormatTextEntity(GH_TextEntity)|
|
FormatTextEntity(TextEntity)|
|
FormatTextEntity(TextEntity,
String)|
|
FormatTransformValidity|
If the transform is invalid, return a string describing why.
|
FormatVector(GH_Vector)|
|
FormatVector(Vector3d)|
|
FormatVectorValidity|
If the point is invalid, return a string describing why.
|
RhinoUnitName|
|
RhinoUnitName(UnitSystem)|
|
RhinoUnitSymbol|
|
RhinoUnitSymbol(UnitSystem)|
|
TreatAsCollection|
This method is used in Scripting components to determine whether a certain
class was 'intended' as a collection or as a single piece of data .
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com