---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Base_GH_DigitNumber.htm
scraped_at: 2025-09-08T16:13:38.559114
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Base](../html/N_Grasshopper_GUI_Base.htm
"Grasshopper.GUI.Base")

[GH_DigitNumber Class](../html/T_Grasshopper_GUI_Base_GH_DigitNumber.htm
"GH_DigitNumber Class")

[GH_DigitNumber Constructor
](../html/Overload_Grasshopper_GUI_Base_GH_DigitNumber__ctor.htm
"GH_DigitNumber Constructor ")

[GH_DigitNumber
Properties](../html/Properties_T_Grasshopper_GUI_Base_GH_DigitNumber.htm
"GH_DigitNumber Properties")

[GH_DigitNumber
Methods](../html/Methods_T_Grasshopper_GUI_Base_GH_DigitNumber.htm
"GH_DigitNumber Methods")

!Click or drag to
resize

# GH_DigitNumber Class

---

Maintains and provides functionality for evaluating and modifying numbers as
used in the GH_DigitScrollerBase control.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.BaseGH_DigitNumber

**Namespace:** Grasshopper.GUI.Base
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DigitNumber

    Public Class GH_DigitNumber

The GH_DigitNumber type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DigitNumber(GH_DigitNumber)|
Create an exact duplicate of another GH_DigitNumber instance.
|
GH_DigitNumber(Int32)|
Create a new GH_DigitNumber instance with the specified number of decimal
places.
| GH_DigitNumber(Int32,
Int32)|  Create a new
GH_DigitNumber instance with the specified number of decimal places and a
given radix position.
Top

Properties

| Name| Description
---|---|---
|
DigitCount|  Gets or
sets the amount of digits in this number.
|
Epsilon|  Gets the
smallest possible change.
|
IsPrimaryDigitSignificant|
Gets whether the primary digit at the given index is significant.
|
IsSecondaryDigitSignificant|
Gets whether the secondary digit at the given index is significant.
|
Maximum|  Gets the
maximum value allowed in this number.
|
Minimum|  Gets the
minimum value allowed in this number.
|
Offset|  Gets the offset
between the primary and secondary digits.
|
PrimaryDigits|
Gets the internal list of primary digits. Do not modify this list.
|
PrimaryPositive|
Gets or sets a value indicating whether the number is positive.
|
Radix|  Gets or sets the
radix point index. A negative radix index disables the radix point, zero is
not a valid index.
|
RadixIndex|  Gets the
mapped radix.
|
SecondaryDigits|
Gets the internal list of secondary digits. Do not modify this list.
|
SecondaryPositive|
Gets a value indicating whether the secondary number is positive.
|
Value|  Gets or sets the
value of this number.
Top

Methods

| Name| Description
---|---|---
|
AssignOffset|
Assign an offset to a given digit and recursively adjust all leftwards offsets
if needed.
|
LimitValue|  Limits
the value to the minimum and maximum domain.
|
Reset|  Reset all parts to
zero.
|
Round|  Round the number by
cancelling the offset in the proper direction.
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

See Also

#### Reference

Grasshopper.GUI.Base Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com