---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_RuleSequence.htm
scraped_at: 2025-09-08T16:19:18.057325
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_RuleSequence Class](../html/T_Grasshopper_Kernel_Data_GH_RuleSequence.htm
"GH_RuleSequence Class")

[GH_RuleSequence Constructor
](../html/M_Grasshopper_Kernel_Data_GH_RuleSequence__ctor.htm "GH_RuleSequence
Constructor ")

[GH_RuleSequence
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_RuleSequence.htm
"GH_RuleSequence Properties")

[GH_RuleSequence
Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_RuleSequence.htm
"GH_RuleSequence Methods")

!Click or drag to
resize

# GH_RuleSequence Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_RuleSequence

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RuleSequence : IGH_Rule

    Public Class GH_RuleSequence
    	Implements IGH_Rule

The GH_RuleSequence type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_RuleSequence|
Initializes a new instance of the GH_RuleSequence class
Top

Properties

| Name| Description
---|---|---
|
Kind|
|
Notation|
Top

Methods

| Name| Description
---|---|---
|
Apply|
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com