---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_AnnotationTextSettings.htm
scraped_at: 2025-09-08T16:22:56.986777
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations](../html/N_Grasshopper_Rhinoceros_Annotations.htm
"Grasshopper.Rhinoceros.Annotations")

[AnnotationTextSettings
Class](../html/T_Grasshopper_Rhinoceros_Annotations_AnnotationTextSettings.htm
"AnnotationTextSettings Class")

[AnnotationTextSettings Constructor
](../html/Overload_Grasshopper_Rhinoceros_Annotations_AnnotationTextSettings__ctor.htm
"AnnotationTextSettings Constructor ")

[AnnotationTextSettings
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_AnnotationTextSettings.htm
"AnnotationTextSettings Properties")

[AnnotationTextSettings
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_AnnotationTextSettings.htm
"AnnotationTextSettings Methods")

[AnnotationTextSettings Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Annotations_AnnotationTextSettings.htm
"AnnotationTextSettings Type Conversions")

!Click or drag to
resize

# AnnotationTextSettings Class

---

Represents model text settings.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.Rhinoceros.AnnotationsAnnotationTextSettings

**Namespace:**
Grasshopper.Rhinoceros.Annotations
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class AnnotationTextSettings : ModelData

    Public NotInheritable Class AnnotationTextSettings
    	Inherits ModelData

The AnnotationTextSettings type exposes the following members.

Constructors

| Name| Description
---|---|---
|
AnnotationTextSettings|
Initializes a new instance of the AnnotationTextSettings class
|
AnnotationTextSettings(AnnotationTextSettingsAttributes)|
Initializes a new instance of the AnnotationTextSettings class
|
AnnotationTextSettings(DimensionStyle)|
Initializes a new instance of the AnnotationTextSettings class
Top

Properties

| Name| Description
---|---|---
|
DrawForward|
|
DrawTextMask|
|
FitText|
|
Font|
|
MaskColor|
|
MaskColorSource|
|
MaskFrame|
|
MaskOffset|
|
TextGap|
|
TextHeight|
|
TextHorizontalAlignment|
|
TextOrientation|
|
TextVerticalAlignment|
Top

Methods

| Name| Description
---|---|---
|
CastToT|  (Inherited from
ModelData.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|  (Inherited
from ModelData.)
|
GetDimensionStyle|
|
GetHashCode|  (Inherited
from ModelData.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelData.)
|
ToString|  (Inherited from
ModelData.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (AnnotationTextSettings to
DimensionStyle)|
!Static
member| (AnnotationTextSettingsAttributes to
AnnotationTextSettings)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com