---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Interval.htm
scraped_at: 2025-09-08T16:20:51.466356
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Interval Class](../html/T_Grasshopper_Kernel_Types_GH_Interval.htm
"GH_Interval Class")

[GH_Interval Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Interval__ctor.htm "GH_Interval
Constructor ")

[GH_Interval
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Interval.htm
"GH_Interval Properties")

[GH_Interval
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Interval.htm
"GH_Interval Methods")

[GH_Interval Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Interval.htm
"GH_Interval Fields")

!Click or drag to
resize

# GH_Interval Class

---

Represents a one-dimensional numeric domain.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooInterval
Grasshopper.Kernel.TypesGH_Interval

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Interval : GH_Goo<Interval>

    Public Class GH_Interval
    	Inherits GH_Goo(Of Interval)

The GH_Interval type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Interval|  Default
constructor
|
GH_Interval(GH_Interval)|
Create a duplicate from another interval.
|
GH_Interval(Interval)|
Create a duplicate of another interval
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets the
validity of this instance. Intervals are invalid if either of the extremes is
a #NaN.  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  Remote to
Local caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  Local to
Remote caster function. this stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GooTCastToQ(Q).)
|
Duplicate|  Create a
duplicate of this interval.  (Overrides
GH_GooTDuplicate.)
|
DuplicateInterval|
Create a duplicate of this interval.
|
EmitProxy|  Returns a
proxy that represents this interval. Do not call this function unless you're
(Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  Format the
interval using default grasshopper formatting logic.  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com