---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelComponentContent_Attributes.htm
scraped_at: 2025-09-08T16:22:32.871514
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelComponentContent.Attributes
Class](../html/T_Grasshopper_Rhinoceros_ModelComponentContent_Attributes.htm
"ModelComponentContent.Attributes Class")

[ModelComponentContent.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_ModelComponentContent_Attributes__ctor.htm
"ModelComponentContent.Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelComponentContent_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelComponentContent_Attributes.htm
"Attributes Methods")

!Click or drag to
resize

# ModelComponentContentAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
Grasshopper.RhinocerosModelComponentContentAttributes
More...

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class Attributes : ModelContentAttributes,
    	IEquatable<ModelComponentContentAttributes>

    Public MustInherit Class Attributes
    	Inherits ModelContentAttributes
    	Implements IEquatable(Of ModelComponentContentAttributes)

The ModelComponentContentAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelComponentContentAttributes|
Initializes a new instance of the ModelComponentContentAttributes class
Top

Properties

| Name| Description
---|---|---
|
Name|  The last
component of the element Path.  (Inherited from
ModelContentAttributes.)
|
Notes|
(Inherited from
ModelContentAttributes.)
|
Parent|  Path
of the parent element in 'Root::Parent' format if nested.  (Inherited from
ModelContentAttributes.)
|
Path|  Full
content path in 'Root::Parent::Name' format if is nested.  (Inherited from
ModelContentAttributes.)
|
Tags|  (Inherited
from
ModelContentAttributes.)
|
UserText|
Top

Methods

| Name| Description
---|---|---
|
AsFrozen|
(Inherited from
ModelContentAttributes.)
|
Clone|  (Inherited
from
ModelDataAttributes.)
|
Equals(Object)|
(Inherited from
ModelContentAttributes.)
| Equals(Object,
IEqualityComparer)|
(Overrides ModelContentAttributesEquals(Object,
IEqualityComparer).)
|
GetHashCode|
(Inherited from
ModelContentAttributes.)
|
GetHashCode(IEqualityComparer)|
(Overrides
ModelContentAttributesGetHashCode(IEqualityComparer).)
|
IsValidContentName|
(Inherited from
ModelContentAttributes.)
|
Read|  (Inherited
from
ModelContentAttributes.)
|
ReadData|
(Overrides
ModelContentAttributesReadData(GH_IReader).)
|
SubClone|
(Inherited from
ModelDataAttributes.)
|
ToDetails|
(Overrides
ModelDataAttributesToDetails.)
|
ToModelData|
(Inherited from
ModelDataAttributes.)
|
ToString|
(Inherited from
ModelContentAttributes.)
|
Write|
(Inherited from
ModelContentAttributes.)
|
WriteData|
(Overrides
ModelContentAttributesWriteData(GH_IWriter).)
Top

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
Grasshopper.RhinocerosModelComponentContentAttributes
Grasshopper.Rhinoceros.AnnotationsModelAnnotationStyleAttributes
Grasshopper.Rhinoceros.DraftingModelHatchPatternAttributes
Grasshopper.Rhinoceros.DraftingModelLinetypeAttributes
Grasshopper.Rhinoceros.ModelModelInstanceDefinitionAttributes
Grasshopper.Rhinoceros.ModelModelLayerAttributes
Grasshopper.Rhinoceros.ModelModelObjectAttributes

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com