---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Expressions_GH_ExpressionParser.htm
scraped_at: 2025-09-08T16:19:34.136208
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Expressions](../html/N_Grasshopper_Kernel_Expressions.htm
"Grasshopper.Kernel.Expressions")

[GH_ExpressionParser
Class](../html/T_Grasshopper_Kernel_Expressions_GH_ExpressionParser.htm
"GH_ExpressionParser Class")

[GH_ExpressionParser Constructor
](../html/Overload_Grasshopper_Kernel_Expressions_GH_ExpressionParser__ctor.htm
"GH_ExpressionParser Constructor ")

[GH_ExpressionParser
Properties](../html/Properties_T_Grasshopper_Kernel_Expressions_GH_ExpressionParser.htm
"GH_ExpressionParser Properties")

[GH_ExpressionParser
Methods](../html/Methods_T_Grasshopper_Kernel_Expressions_GH_ExpressionParser.htm
"GH_ExpressionParser Methods")

!Click or drag to
resize

# GH_ExpressionParser Class

---

Provides a run-time evaluator for Grasshopper expressions.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.ExpressionsGH_ExpressionParser

**Namespace:**
Grasshopper.Kernel.Expressions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ExpressionParser

    Public Class GH_ExpressionParser

The GH_ExpressionParser type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ExpressionParser|
Initializes a new instance of the GH_ExpressionParser class
|
GH_ExpressionParser(Boolean)|
Initializes a new instance of the GH_ExpressionParser class
Top

Properties

| Name| Description
---|---|---
|
ThrowExceptions|
|
Variables|
Top

Methods

| Name| Description
---|---|---
| AddVariable(String,
Complex)|
| AddVariable(String,
Plane)|
| AddVariable(String,
Point3d)|
| AddVariable(String,
Vector3d)|
| AddVariable(String,
Boolean)|
| AddVariable(String,
Double)|
| AddVariable(String,
Int32)|
| AddVariable(String,
String)|
| AddVariableEx(String,
GH_Variant)|
| AddVariableEx(String,
IGH_Goo)|
|
BalancedCharTest|
Test a string for balanced open and close chars. You can use this function to
see if brackets or parenthesis have been properly used.
|
CachedSymbols|
Retrieve a copy of the Queue of cached symbols. You can use the cached symbols
as an uber-optimization to speed up successive calls to Evaluate() with an
identical expression string
|
CacheSymbols|
Create a Symbols array from the expression. Use this method if you intend to
evaluate the same expression multiple times. At this point, the expression has
to be in correct syntax format. Use the GH_ExpressionSyntaxWriter.RewriteAll()
method to make sure.
|
ClearSymbols|
Destroy the Symbols cache.
|
ClearVariables|
Destroy the variable cache.
|
DisplayFunctionList|
|
Evaluate|
Evaluate the expression currently loaded in the Symbols cache using the
currently loaded variables.
|
Evaluate(QueueGH_ParserSymbol)|
Evaluate the expression queue without overriding any local caches. You can
obtain an expression queue by calling CachedSymbols()
|
Evaluate(String)|
Store a new expression in the Symbols cache and evaluate it using the current
variables
|
IsValidVariableName|
Tests whether a string is a valid variable name for expressions. Valid names
must contain at least one character, must start with an alphabetic character,
and only contain alphanumeric chars and underscores.
|
Op_BinaryAddition|
|
Op_BinaryAmpersand|
|
Op_BinaryAND|
|
Op_BinaryAngle|
|
Op_BinaryCircumflex|
|
Op_BinaryCrossProduct|
|
Op_BinaryDistance|
|
Op_BinaryDivision|
|
Op_BinaryEquality|
|
Op_BinaryIntegerDivision|
|
Op_BinaryLargerThan|
|
Op_BinaryLargerThanOrEqual|
|
Op_BinaryModulus|
|
Op_BinaryMultiplication|
|
Op_BinaryNearEquality|
|
Op_BinaryOR|
|
Op_BinaryPull|
|
Op_BinaryPush|
|
Op_BinarySmallerThan|
|
Op_BinarySmallerThanOrEqual|
|
Op_BinarySubtraction|
|
Op_BinaryXOR|
|
Op_UnaryBang|
|
Op_UnaryCube|
|
Op_UnaryDeg2Rad|
|
Op_UnaryImaginary|
|
Op_UnaryMinus|
|
Op_UnaryNOT|
|
Op_UnaryOComponent|
|
Op_UnaryPlus|
|
Op_UnarySquare|
|
Op_UnaryXComponent|
|
Op_UnaryYComponent|
|
Op_UnaryZComponent|
Top

See Also

#### Reference

Grasshopper.Kernel.Expressions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com