---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_MeshFace.htm
scraped_at: 2025-09-08T16:21:07.523028
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_MeshFace Class](../html/T_Grasshopper_Kernel_Types_GH_MeshFace.htm
"GH_MeshFace Class")

[GH_MeshFace Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_MeshFace__ctor.htm "GH_MeshFace
Constructor ")

[GH_MeshFace
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_MeshFace.htm
"GH_MeshFace Properties")

[GH_MeshFace
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_MeshFace.htm
"GH_MeshFace Methods")

[GH_MeshFace Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_MeshFace.htm
"GH_MeshFace Fields")

!Click or drag to
resize

# GH_MeshFace Class

---

Represents a tri or quad mesh face. GH_MeshFace works similar to the OpenNURBS
OnMeshFace class.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooMeshFace
Grasshopper.Kernel.TypesGH_MeshFace

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_MeshFace : GH_Goo<MeshFace>

    Public Class GH_MeshFace
    	Inherits GH_Goo(Of MeshFace)

The GH_MeshFace type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_MeshFace|  Default
constructor. Sets all corners to 0.
|
GH_MeshFace(GH_MeshFace)|
Create a duplicate of another mesh face
|
GH_MeshFace(MeshFace)|
Create a duplicate of another mesh face.
| GH_MeshFace(Int32, Int32,
Int32)|  Create a
triangular mesh face from 3 corners indices.
| GH_MeshFace(Int32, Int32, Int32,
Int32)|  Create a
quadrangular mesh face from 4 corners indices.
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Test for
validity. No negative indices are allowed and only C and D are allowed to be
identical.  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  Remote to
Local caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  Local to
Remote caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GooTCastToQ(Q).)
|
Duplicate|  Create a
duplicate of this Mesh face.  (Overrides
GH_GooTDuplicate.)
|
DuplicateMeshFace|
Create a duplicate of this Mesh face.
|
EmitProxy|  Returns a
proxy that represents this mesh face. Do not call this function unless you're
(Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  Format the
mesh face using default grasshopper formatting logic.  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com