---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_ModelStandardViewport.htm
scraped_at: 2025-09-08T16:23:24.099591
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[ModelStandardViewport
Class](../html/T_Grasshopper_Rhinoceros_Display_ModelStandardViewport.htm
"ModelStandardViewport Class")

[ModelStandardViewport Constructor
](../html/Overload_Grasshopper_Rhinoceros_Display_ModelStandardViewport__ctor.htm
"ModelStandardViewport Constructor ")

[ModelStandardViewport
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_ModelStandardViewport.htm
"ModelStandardViewport Properties")

[ModelStandardViewport
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_ModelStandardViewport.htm
"ModelStandardViewport Methods")

[ModelStandardViewport Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Display_ModelStandardViewport.htm
"ModelStandardViewport Type Conversions")

!Click or drag to
resize

# ModelStandardViewport Class

---

Represents a Rhino standard modeling viewport. Wraps the main viewport of a
modeling RhinoView instance.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.Rhinoceros.DisplayModelViewport
Grasshopper.Rhinoceros.DisplayModelStandardViewport

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelStandardViewport : ModelViewport

    Public NotInheritable Class ModelStandardViewport
    	Inherits ModelViewport

The ModelStandardViewport type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelStandardViewport|
Initializes a new instance of the ModelStandardViewport class
|
ModelStandardViewport(ModelStandardViewportAttributes)|
Initializes a new instance of the ModelStandardViewport class
|
ModelStandardViewport(Guid)|
Initializes a new instance of the ModelStandardViewport class
|
ModelStandardViewport(RhinoViewport)|
Initializes a new instance of the ModelStandardViewport class
Top

Properties

| Name| Description
---|---|---
|
DisplayMode|
(Inherited from
ModelViewport.)
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Space|
(Overrides
ModelViewportSpace.)
|
Tags|  (Inherited from
ModelContent.)
|
ViewportType|
(Overrides
ModelViewportViewportType.)
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelViewportCastToT(T).)
|
CastToT(T)|
(Inherited from
ModelViewport.)
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelStandardViewportAttributes to
ModelStandardViewport)|
!Static
member| (RhinoViewport to
ModelStandardViewport)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com