---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_InitCodeAware.htm
scraped_at: 2025-09-08T16:18:32.837677
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_InitCodeAware
Interface](../html/T_Grasshopper_Kernel_IGH_InitCodeAware.htm
"IGH_InitCodeAware Interface")

[IGH_InitCodeAware
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_InitCodeAware.htm
"IGH_InitCodeAware Methods")

!Click or drag to
resize

# IGH_InitCodeAware Interface

---

Implement this interface in your IGH_DocumentObject class if you want to
handle initialization codes from Canvas Search boxes.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_InitCodeAware

    Public Interface IGH_InitCodeAware

The IGH_InitCodeAware type exposes the following members.

Methods

| Name| Description
---|---|---
|
SetInitCode|  This
method will be called when the user inserts an object via the Canvas Search
popup and supplies an "=XXXX" string init code. Do not throw exceptions in
this method! Either handle the code correctly or ignore it.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com