---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_Slider_Obsolete.htm
scraped_at: 2025-09-08T16:13:07.431333
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_Slider_Obsolete Class](../html/T_Grasshopper_GUI_GH_Slider_Obsolete.htm
"GH_Slider_Obsolete Class")

[GH_Slider_Obsolete Constructor
](../html/M_Grasshopper_GUI_GH_Slider_Obsolete__ctor.htm "GH_Slider_Obsolete
Constructor ")

[GH_Slider_Obsolete
Properties](../html/Properties_T_Grasshopper_GUI_GH_Slider_Obsolete.htm
"GH_Slider_Obsolete Properties")

[GH_Slider_Obsolete
Methods](../html/Methods_T_Grasshopper_GUI_GH_Slider_Obsolete.htm
"GH_Slider_Obsolete Methods")

[GH_Slider_Obsolete
Events](../html/Events_T_Grasshopper_GUI_GH_Slider_Obsolete.htm
"GH_Slider_Obsolete Events")

!Click or drag to
resize

# GH_Slider_Obsolete Class

---

General purpose numeric slider.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsUserControl
Grasshopper.GUIGH_Slider_Obsolete

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Slider_Obsolete : UserControl

    Public Class GH_Slider_Obsolete
    	Inherits UserControl

The GH_Slider_Obsolete type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Slider_Obsolete|
Initializes a new instance of the GH_Slider_Obsolete class
Top

Properties

| Name| Description
---|---|---
|
DisplayFormat|  Gets
or sets the display format fo the slider. This is the formatting that is
applied prior to drawing. The default is {0} which results in a 1:1 display.
Use this to append units or symbols.
|
DrawRail|  Gets or sets a
flag that control whether or not grip rails are drawn.
|
GripBackColor|
Background colour of slider grip.
|
GripForeColor|
Foreground colour of slider grip.
|
IsIntermediate|
Gets the intermediate flag. If True, the user is currently dragging the
slider.
|
Max|  Gets or sets the maximum
allowed value.
|
Min|  Gets or sets the minimum
allowed value.
|
NumericFormat|  Gets
or sets the numeric format for the slider. This is the formatting that is
applied to the number. The default is #0.00 which results in a two digit
rounding scheme.
|
TextInputMode|  Gets
or sets the Text input mode for this slider.
|
TickFrequency|  Gets
or sets the tick frequency of the slider.
|
Value|  Gets or sets the
current value.
|
ValueF|  Gets or sets the
current value in single-floating-point precision.
Top

Methods

| Name| Description
---|---|---
|
Dispose| Releases the
unmanaged resources used by the GH_Slider_Obsolete and optionally releases the
managed resources (Overrides
[ContainerControlDispose(Boolean)](https://docs.microsoft.com/dotnet/api/system.windows.forms.containercontrol.dispose#system-
windows-forms-containercontrol-dispose\(system-boolean\)).)
|
OnPaint|  (Overrides
[ControlOnPaint(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.control.onpaint#system-
windows-forms-control-onpaint\(system-windows-forms-painteventargs\)).)
|
OnPaintBackground|
(Overrides
[ScrollableControlOnPaintBackground(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.scrollablecontrol.onpaintbackground#system-
windows-forms-scrollablecontrol-onpaintbackground\(system-windows-forms-
painteventargs\)).)
|
OnValueChanged|
Raise the ValueChanged event
|
SendMessage|
Top

Events

| Name| Description
---|---|---
|
ValueChanged|  Raised
whenever the value of the slider is changed via GUI interaction.
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com