---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_SamplingSphere.htm
scraped_at: 2025-09-08T16:13:02.399592
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_SamplingSphere Class](../html/T_Grasshopper_GUI_GH_SamplingSphere.htm
"GH_SamplingSphere Class")

[GH_SamplingSphere Constructor
](../html/M_Grasshopper_GUI_GH_SamplingSphere__ctor.htm "GH_SamplingSphere
Constructor ")

[GH_SamplingSphere
Properties](../html/Properties_T_Grasshopper_GUI_GH_SamplingSphere.htm
"GH_SamplingSphere Properties")

[GH_SamplingSphere
Methods](../html/Methods_T_Grasshopper_GUI_GH_SamplingSphere.htm
"GH_SamplingSphere Methods")

!Click or drag to
resize

# GH_SamplingSphere Class

---

Represents a coloured sphere that can be sampled at various rotations.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_SamplingSphere

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_SamplingSphere

    Public Class GH_SamplingSphere

The GH_SamplingSphere type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_SamplingSphere|
Initializes a new instance of the GH_SamplingSphere class
Top

Properties

| Name| Description
---|---|---
|
SampleCount|  Gets the
total number of samples contained in this sampling grid.
|
Size|  Gets the size of this
sample grid.
Top

Methods

| Name| Description
---|---|---
|
SampleSphere(Sphere)|
Sample the UV locations of a sphere. The sphere should be centered on the
world origin.
| SampleSphere(Sphere,
GH_MemoryBitmap)|
Sample a sphere with a UV texture and return a bitmap of sampled values.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com