---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Plane.htm
scraped_at: 2025-09-08T16:21:14.565592
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Plane Class](../html/T_Grasshopper_Kernel_Types_GH_Plane.htm "GH_Plane
Class")

[GH_Plane Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Plane__ctor.htm "GH_Plane
Constructor ")

[GH_Plane
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Plane.htm
"GH_Plane Properties")

[GH_Plane Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Plane.htm
"GH_Plane Methods")

[GH_Plane Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Plane.htm
"GH_Plane Fields")

!Click or drag to
resize

# GH_Plane Class

---

Represents a 3D plane. GH_Plane re-implements the OpenNURBS OnPlane class.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooPlane
Grasshopper.Kernel.TypesGH_GeometricGooPlane
Grasshopper.Kernel.TypesGH_Plane

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Plane : GH_GeometricGoo<Plane>,
    	IGH_BakeAwareData, IGH_PreviewData

    Public Class GH_Plane
    	Inherits GH_GeometricGoo(Of Plane)
    	Implements IGH_BakeAwareData, IGH_PreviewData

The GH_Plane type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Plane|  Default
constructor. Creates a world XY plane.
|
GH_Plane(GH_Plane)|  Create
a duplicate of another plane.
|
GH_Plane(Guid)| Initializes
a new instance of the GH_Plane class
|
GH_Plane(Plane)|  Create a
duplicate of another plane.
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
(Overrides
GH_GeometricGooTBoundingbox.)
|
ClippingBox|
|
IsGeometryLoaded|
Gets the load state of this plane. The plane is considered to be loaded when
it is valid.  (Overrides
GH_GeometricGooTIsGeometryLoaded.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  Gets the validity
of the plane. If the plane is invalid, attempts are made to fix the data. If
the plane remains invalid, False is returned.  (Overrides
GH_GeometricGooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
ReferenceID|
(Overrides
GH_GeometricGooTReferenceID.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets
the value of this type. Note that if the type has a ReferenceID this value
might get destroyed in the future.  (Inherited from
GH_GeometricGooT.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
|
CastFrom|  Remote to Local
caster function. This stuff is complex, don't concern yourself with casting
logic.  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  Local to
Remote caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GeometricGooTCastToQ(Q).)
|
ClearCaches|
Clears all caches. Typically if the geometry is referenced, this will erase
the local copy. If your T is a value-type, you must override this function and
specifically unset the local value.  (Inherited from
GH_GeometricGooT.)
|
DrawPlane(DisplayPipeline,
Plane)|  Draw a plane with
default colours and default size.
|
DrawPlane(DisplayPipeline, Plane, Double,
Int32)|
|
DrawPlane(DisplayPipeline, Plane, Double, Int32, Color, Color,
Color)|
|
DrawPlane(DisplayPipeline, Plane, Double, Int32, Color, Color, Color,
Color)|
|
DrawPlaneIcon|
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|  (Overrides
GH_GeometricGooTDuplicate.)
|
DuplicateGeometry|
Create a duplicate of this plane.  (Overrides
GH_GeometricGooTDuplicateGeometry.)
|
DuplicatePlane|
Create a duplicate of this plane.
|
EmitProxy|  Returns a
proxy that represents this plane. Do not call this function unless you're
(Overrides
GH_GeometricGooTEmitProxy.)
|
GetBoundingBox|
(Overrides
GH_GeometricGooTGetBoundingBox(Transform).)
|
LoadGeometry|  If the
geometry is referenced and not yet loaded, attempts to load the geometry.
(Overrides
GH_GeometricGooTLoadGeometry.)
|
LoadGeometry(RhinoDoc)|
(Overrides
GH_GeometricGooTLoadGeometry(RhinoDoc).)
|
Morph|  (Overrides
GH_GeometricGooTMorph(SpaceMorph).)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  Format the
plane using default grasshopper formatting logic.  (Overrides
GH_GooTToString.)
|
Transform|  (Overrides
GH_GeometricGooTTransform(Transform).)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com