---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_LineCharge.htm
scraped_at: 2025-09-08T16:20:59.474050
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_LineCharge Class](../html/T_Grasshopper_Kernel_Types_GH_LineCharge.htm
"GH_LineCharge Class")

[GH_LineCharge Constructor
](../html/M_Grasshopper_Kernel_Types_GH_LineCharge__ctor.htm "GH_LineCharge
Constructor ")

[GH_LineCharge
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_LineCharge.htm
"GH_LineCharge Properties")

[GH_LineCharge
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_LineCharge.htm
"GH_LineCharge Methods")

!Click or drag to
resize

# GH_LineCharge Class

---

Line charge implementation for IGH_Fields.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_FieldElement
Grasshopper.Kernel.TypesGH_LineCharge

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_LineCharge : GH_FieldElement

    Public Class GH_LineCharge
    	Inherits GH_FieldElement

The GH_LineCharge type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_LineCharge|
Initializes a new instance of the GH_LineCharge class
Top

Properties

| Name| Description
---|---|---
|
BoundingBox|
(Overrides
GH_FieldElementBoundingBox.)
|
Charge|
|
ClippingBox|
(Inherited from
GH_FieldElement.)
|
ElementGuid|
(Overrides
GH_FieldElementElementGuid.)
|
IsLimited|
(Inherited from
GH_FieldElement.)
|
Limits|  (Inherited
from GH_FieldElement.)
|
Segment|
Top

Methods

| Name| Description
---|---|---
|
DrawViewportMeshes|
(Inherited from
GH_FieldElement.)
|
DrawViewportWires|
(Overrides
GH_FieldElementDrawViewportWires(GH_PreviewWireArgs).)
|
Duplicate|
(Overrides
GH_FieldElementDuplicate.)
|
Force|  (Overrides
GH_FieldElementForce(Point3d).)
|
IsCoincident|
(Overrides GH_FieldElementIsCoincident(Point3d,
Double).)
|
Read|  (Overrides
GH_FieldElementRead(GH_IReader).)
|
Write|  (Overrides
GH_FieldElementWrite(GH_IWriter).)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com