---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Undo_Actions_GH_LayoutAction.htm
scraped_at: 2025-09-08T16:22:16.804828
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Undo.Actions](../html/N_Grasshopper_Kernel_Undo_Actions.htm
"Grasshopper.Kernel.Undo.Actions")

[GH_LayoutAction
Class](../html/T_Grasshopper_Kernel_Undo_Actions_GH_LayoutAction.htm
"GH_LayoutAction Class")

[GH_LayoutAction Constructor
](../html/M_Grasshopper_Kernel_Undo_Actions_GH_LayoutAction__ctor.htm
"GH_LayoutAction Constructor ")

[GH_LayoutAction
Properties](../html/Properties_T_Grasshopper_Kernel_Undo_Actions_GH_LayoutAction.htm
"GH_LayoutAction Properties")

[GH_LayoutAction
Methods](../html/Methods_T_Grasshopper_Kernel_Undo_Actions_GH_LayoutAction.htm
"GH_LayoutAction Methods")

!Click or drag to
resize

# GH_LayoutAction Class

---

Records a single object layout event. Useful for tracking object resizes.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.UndoGH_UndoAction
Grasshopper.Kernel.UndoGH_ObjectUndoAction
Grasshopper.Kernel.Undo.ActionsGH_LayoutAction

**Namespace:**
Grasshopper.Kernel.Undo.Actions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_LayoutAction : GH_ObjectUndoAction

    Public Class GH_LayoutAction
    	Inherits GH_ObjectUndoAction

The GH_LayoutAction type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_LayoutAction|
Initializes a new instance of the GH_LayoutAction class
Top

Properties

| Name| Description
---|---|---
|
ExpiresDisplay|
Override this property if you want the Rhino viewport display to refresh upon
undo completion.  (Inherited from
GH_UndoAction.)
|
ExpiresSolution|
Override this property if you want the Grasshopper solution to refresh upon
undo completion.  (Inherited from
GH_UndoAction.)
|
State|  (Inherited from
GH_UndoAction.)
Top

Methods

| Name| Description
---|---|---
|
Internal_Redo|
(Inherited from
GH_ObjectUndoAction.)
|
Internal_Undo|
(Inherited from
GH_ObjectUndoAction.)
|
Object_Redo|
(Overrides GH_ObjectUndoActionObject_Redo(GH_Document,
IGH_DocumentObject).)
|
Object_Undo|
(Overrides GH_ObjectUndoActionObject_Undo(GH_Document,
IGH_DocumentObject).)
|
Read|  (Inherited from
GH_UndoAction.)
|
Redo|  (Inherited from
GH_UndoAction.)
|
Undo|  (Inherited from
GH_UndoAction.)
|
Write|  (Inherited from
GH_UndoAction.)
Top

See Also

#### Reference

Grasshopper.Kernel.Undo.Actions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com