---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_MaterialPreviewControl.htm
scraped_at: 2025-09-08T16:12:49.356960
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_MaterialPreviewControl
Class](../html/T_Grasshopper_GUI_GH_MaterialPreviewControl.htm
"GH_MaterialPreviewControl Class")

[GH_MaterialPreviewControl Constructor
](../html/M_Grasshopper_GUI_GH_MaterialPreviewControl__ctor.htm
"GH_MaterialPreviewControl Constructor ")

[GH_MaterialPreviewControl
Properties](../html/Properties_T_Grasshopper_GUI_GH_MaterialPreviewControl.htm
"GH_MaterialPreviewControl Properties")

[GH_MaterialPreviewControl
Methods](../html/Methods_T_Grasshopper_GUI_GH_MaterialPreviewControl.htm
"GH_MaterialPreviewControl Methods")

[GH_MaterialPreviewControl
Events](../html/Events_T_Grasshopper_GUI_GH_MaterialPreviewControl.htm
"GH_MaterialPreviewControl Events")

!Click or drag to
resize

# GH_MaterialPreviewControl Class

---

Offers a frontend for Grasshopper Material previews.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsUserControl
Grasshopper.GUIGH_MaterialPreviewControl

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_MaterialPreviewControl : UserControl

    Public Class GH_MaterialPreviewControl
    	Inherits UserControl

The GH_MaterialPreviewControl type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_MaterialPreviewControl|
Initializes a new instance of the GH_MaterialPreviewControl class
Top

Properties

| Name| Description
---|---|---
|
Colour|  Gets or
sets the colour of this preview.
|
Selected|  Gets or
sets the Selected state of this preview. Selected previews have thick borders
drawn around them.
|
SelectOnClick|
Gets or sets whether this control can be selected.
Top

Methods

| Name| Description
---|---|---
|
Dispose| Releases
the unmanaged resources used by the GH_MaterialPreviewControl and optionally
releases the managed resources (Overrides
[ContainerControlDispose(Boolean)](https://docs.microsoft.com/dotnet/api/system.windows.forms.containercontrol.dispose#system-
windows-forms-containercontrol-dispose\(system-boolean\)).)
Top

Events

| Name| Description
---|---|---
|
ColourChanged|
|
MaterialImagePostPaint|
|
SelectedChanged|
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com