---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Theme_GH_ObjectSettings.htm
scraped_at: 2025-09-08T16:15:10.953193
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Theme](../html/N_Grasshopper_GUI_Theme.htm
"Grasshopper.GUI.Theme")

[GH_ObjectSettings
Class](../html/T_Grasshopper_GUI_Theme_GH_ObjectSettings.htm
"GH_ObjectSettings Class")

[GH_ObjectSettings
Properties](../html/Properties_T_Grasshopper_GUI_Theme_GH_ObjectSettings.htm
"GH_ObjectSettings Properties")

!Click or drag to
resize

# GH_ObjectSettings Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.ThemeGH_ObjectSettings

**Namespace:** Grasshopper.GUI.Theme
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ObjectSettings

    Public Class GH_ObjectSettings

The GH_ObjectSettings type exposes the following members.

Properties

| Name| Description
---|---|---
|
GroupColour|
Gets or sets the default fill colour for group objects.
|
PanelColour|
Gets or sets the default fill colour for panel objects.
|
ZuiEdgeColour|
Gets or sets the edge colour for ZUI elements.
|
ZuiFillColour|
Gets or sets the fill colour for ZUI elements.
Top

See Also

#### Reference

Grasshopper.GUI.Theme Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com