---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_MouseTracker.htm
scraped_at: 2025-09-08T16:12:56.375028
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_MouseTracker Class](../html/T_Grasshopper_GUI_GH_MouseTracker.htm
"GH_MouseTracker Class")

[GH_MouseTracker Constructor
](../html/Overload_Grasshopper_GUI_GH_MouseTracker__ctor.htm "GH_MouseTracker
Constructor ")

[GH_MouseTracker
Properties](../html/Properties_T_Grasshopper_GUI_GH_MouseTracker.htm
"GH_MouseTracker Properties")

[GH_MouseTracker
Methods](../html/Methods_T_Grasshopper_GUI_GH_MouseTracker.htm
"GH_MouseTracker Methods")

!Click or drag to
resize

# GH_MouseTracker Class

---

Record mouse-movements over time.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_MouseTracker

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_MouseTracker

    Public Class GH_MouseTracker

The GH_MouseTracker type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_MouseTracker|  Create a new
mouse tracker.
|
GH_MouseTracker(Point)|
Create a new mouse tracker.
| GH_MouseTracker(Point,
Object)|  Create a new mouse
tracker.
Top

Properties

| Name| Description
---|---|---
|
Duration|  Gets the timespan
that has passed between the oldest and youngest recorded frames. This is
**not** the same as the time that has passed since recording began.
|
Frame|  Gets the position (in
control coordinates) of the frame at the given index.
|
FrameCount|  Gets the
number of recorded frames.
|
MaximumDuration|
Gets or sets the maximum allowed duration of the entire record. When new
frames are recorded, old frames that are more distant than MaximumDuration
will be dropped. The default duration is 10 seconds.
|
MaximumFrameCount|
Gets or sets the maximum number of frames to keep in history. If more frames
are added, the oldest ones will be dropped. The default is 16,384 frames.
|
NewestFrame|  Gets the
most recent frame in recorded history.
|
OldestFrame|  Gets the
oldest frame in recorded history.
|
TemporalAccuracy|
Gets or sets the maximum temporal accuracy. Frames that are closer together
than the accuracy will not be recorded. The default accuracy equals 5ms.
Top

Methods

| Name| Description
---|---|---
|
Deviation|  Gets the
maximum deviation of the recorded mouse path. The maximum deviation is the
furthest distance the mouse has been from the first point in the history
record.
| Deviation(DateTime,
DateTime)|  Gets the
maximum deviation of the recorded mouse path. The maximum deviation is the
furthest distance the mouse has been from the first point in the history span.
It does **not** measure the largest deviation between any two points in the
time span, only the first and any subsequent point.
|
DropFrames(DateTime)|
Drop all frames older than a given limit.
|
DropFrames(Double)|
Find the youngest frame that deviates too much from the current locus and drop
it and everything preceding it.
| DropFrames(Double,
Point)|  Find the
youngest frame that deviates too much from the given locus and drop it and
everything preceding it.
|
LastFrameWithinDeviation|
Starting from the youngest frame, finds the oldest frame that is still within
a maximum deviation of the youngest frame.
|
Record(Point)|  Record a new
mouse event frame. If this frame is closer than [Accuracy]ms to the previously
recorded frame, it is not included.
| Record(Point,
Object)|  Record a new mouse
event frame. If this frame is closer than [Accuracy]ms to the previously
recorded frame, it is not included.
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com