---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_MeshingParameters.htm
scraped_at: 2025-09-08T16:21:09.513744
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_MeshingParameters
Class](../html/T_Grasshopper_Kernel_Types_GH_MeshingParameters.htm
"GH_MeshingParameters Class")

[GH_MeshingParameters Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_MeshingParameters__ctor.htm
"GH_MeshingParameters Constructor ")

[GH_MeshingParameters
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_MeshingParameters.htm
"GH_MeshingParameters Properties")

[GH_MeshingParameters
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_MeshingParameters.htm
"GH_MeshingParameters Methods")

[GH_MeshingParameters Type
Conversions](../html/Operators_T_Grasshopper_Kernel_Types_GH_MeshingParameters.htm
"GH_MeshingParameters Type Conversions")

[GH_MeshingParameters
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_MeshingParameters.htm
"GH_MeshingParameters Fields")

!Click or drag to
resize

# GH_MeshingParameters Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooMeshingParameters
Grasshopper.Kernel.TypesGH_MeshingParameters

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_MeshingParameters : GH_Goo<MeshingParameters>

    Public Class GH_MeshingParameters
    	Inherits GH_Goo(Of MeshingParameters)

The GH_MeshingParameters type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_MeshingParameters|
Initializes a new instance of the GH_MeshingParameters class
|
GH_MeshingParameters(MeshingParameters)|
Initializes a new instance of the GH_MeshingParameters class
Top

Properties

| Name| Description
---|---|---
|
IsValid|
(Overrides GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Inherited from
GH_GooT.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|
(Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  Attempt a cast
from generic data.  (Inherited from
GH_GooT.)
|
CastToQ|  Attempt a cast
to type Q.  (Inherited from
GH_GooT.)
|
Duplicate|
(Overrides
GH_GooTDuplicate.)
|
DuplicateMesherSettings|
|
EmitProxy|
(Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|
(Overrides
GH_GooTToString.)
|
Write|
(Overrides
GH_GooTWrite(GH_IWriter).)
Top

Operators

| Name| Description
---|---|---
!Static
member| (MeshingParameters to
GH_MeshingParameters)|
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com