---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Field.htm
scraped_at: 2025-09-08T16:20:37.374525
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Field Class](../html/T_Grasshopper_Kernel_Types_GH_Field.htm "GH_Field
Class")

[GH_Field Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Field__ctor.htm "GH_Field
Constructor ")

[GH_Field
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Field.htm
"GH_Field Properties")

[GH_Field Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Field.htm
"GH_Field Methods")

!Click or drag to
resize

# GH_Field Class

---

Represents a field of forces.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_Field

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Field : IGH_Goo, IGH_PreviewData

    Public Class GH_Field
    	Implements IGH_Goo, IGH_PreviewData

The GH_Field type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Field|  Blank constructor.
|
GH_Field(GH_Field)|  Copy
constructor.
Top

Properties

| Name| Description
---|---|---
|
ClippingBox|
|
Elements|  Gets the list
of elements of this field.
|
IsValid|
|
IsValidWhyNot|
|
TypeDescription|
|
TypeName|
Top

Methods

| Name| Description
---|---|---
|
CastFrom|
|
CastToT|
|
CurvatureAt|
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|
|
EmitProxy|
|
Read|
|
ScriptVariable|
|
SolveStep|  Move a point
through the field.
|
SolveSteps|  Move a
point through a succession of steps.
|
TensorAt|  Compute the
field tensor at the given location as contributed by all the field elements.
|
ToString|
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com