---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Theme_GH_BackgroundSettings.htm
scraped_at: 2025-09-08T16:15:08.948116
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Theme](../html/N_Grasshopper_GUI_Theme.htm
"Grasshopper.GUI.Theme")

[GH_BackgroundSettings
Class](../html/T_Grasshopper_GUI_Theme_GH_BackgroundSettings.htm
"GH_BackgroundSettings Class")

[GH_BackgroundSettings
Properties](../html/Properties_T_Grasshopper_GUI_Theme_GH_BackgroundSettings.htm
"GH_BackgroundSettings Properties")

!Click or drag to
resize

# GH_BackgroundSettings Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.ThemeGH_BackgroundSettings

**Namespace:** Grasshopper.GUI.Theme
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_BackgroundSettings

    Public Class GH_BackgroundSettings

The GH_BackgroundSettings type exposes the following members.

Properties

| Name| Description
---|---|---
|
Colour1|  First
background colour. Depending on the background style, this colour is used in
different ways.
|
Colour2|  Second
background colour. Depending on the background style, this colour is used in
different ways.
|
Hatch|  Background
hatch brush style. This property is only used if BackgroundStyle is set to
GH_ThemeBackgroundStyle.Hatch.
|
Style|  Canvas
monochromatic flag. If True, the canvas background is a solid colour.
Top

See Also

#### Reference

Grasshopper.GUI.Theme Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com