---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Hatch.htm
scraped_at: 2025-09-08T16:20:46.453209
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Hatch Class](../html/T_Grasshopper_Kernel_Types_GH_Hatch.htm "GH_Hatch
Class")

[GH_Hatch Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Hatch__ctor.htm "GH_Hatch
Constructor ")

[GH_Hatch
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Hatch.htm
"GH_Hatch Properties")

[GH_Hatch Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Hatch.htm
"GH_Hatch Methods")

[GH_Hatch Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Hatch.htm
"GH_Hatch Fields")

!Click or drag to
resize

# GH_Hatch Class

---

Represents an implementation of a Rhino hatch.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooHatch
Grasshopper.Kernel.TypesGH_GeometricGooHatch
Grasshopper.Kernel.TypesGH_Hatch

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Hatch : GH_GeometricGoo<Hatch>,
    	IGH_BakeAwareData, IGH_PreviewData

    Public Class GH_Hatch
    	Inherits GH_GeometricGoo(Of Hatch)
    	Implements IGH_BakeAwareData, IGH_PreviewData

The GH_Hatch type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Hatch|  Default
constructor, creates an invalid hatch.
|
GH_Hatch(GH_Hatch)|  Create
a duplicate of another GH_Hatch. This constructor also copies reference data.
|
GH_Hatch(Guid)|  Create a
new referenced hatch that references a Rhino hatch with the specified ID.
|
GH_Hatch(Hatch)|  Create a
duplicate of an existing hatch.
| GH_Hatch(Hatch,
ModelHatchPattern)|  Create
a duplicate of an existing hatch.
Top

Properties

| Name| Description
---|---|---
|
BackgroundColor|
|
BoundaryVisible|
|
Boundingbox|
(Overrides
GH_GeometricGooTBoundingbox.)
|
ClippingBox|
|
IsGeometryLoaded|
Gets the load state of this hatch object. The hatch is considered to be loaded
when the local hatch instance is not null.  (Overrides
GH_GeometricGooTIsGeometryLoaded.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  Gets the validity
of this hatch. If the hatch is referenced but cannot be loaded, the hatch is
not valid.  (Overrides
GH_GeometricGooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
Pattern|
|
ReferenceID|
(Overrides
GH_GeometricGooTReferenceID.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  (Overrides
GH_GeometricGooTValue.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
|
CastFrom|  Remote to Local
caster function. This stuff is complex, don't concern yourself with casting
logic.  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  Local to
Remote caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GeometricGooTCastToQ(Q).)
|
ClearCaches|  Clears
all volatile caches for this instance. The boundingbox is cleared, and if the
hatch is referenced, the local instance of the hatch is erased.  (Overrides
GH_GeometricGooTClearCaches.)
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|  (Overrides
GH_GeometricGooTDuplicate.)
|
DuplicateGeometry|
Create a duplicate of this hatch.  (Overrides
GH_GeometricGooTDuplicateGeometry.)
|
DuplicateHatch|
Create a duplicate of this hatch.
|
EmitProxy|  (Overrides
GH_GeometricGooTEmitProxy.)
|
GetBoundingBox|
(Overrides
GH_GeometricGooTGetBoundingBox(Transform).)
|
LoadGeometry|  If the
geometry is referenced and not yet loaded, attempts to load the geometry.
(Overrides
GH_GeometricGooTLoadGeometry.)
|
LoadGeometry(RhinoDoc)|
If the hatch is referenced and not yet loaded, attempts to load the hatch.
(Overrides
GH_GeometricGooTLoadGeometry(RhinoDoc).)
|
Morph|  (Overrides
GH_GeometricGooTMorph(SpaceMorph).)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|  Format the
hatch using default grasshopper formatting logic.  (Overrides
GH_GooTToString.)
|
Transform|  (Overrides
GH_GeometricGooTTransform(Transform).)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com