---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Base_GH_ColourPickerBase.htm
scraped_at: 2025-09-08T16:13:32.550364
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Base](../html/N_Grasshopper_GUI_Base.htm
"Grasshopper.GUI.Base")

[GH_ColourPickerBase
Class](../html/T_Grasshopper_GUI_Base_GH_ColourPickerBase.htm
"GH_ColourPickerBase Class")

[GH_ColourPickerBase Constructor
](../html/M_Grasshopper_GUI_Base_GH_ColourPickerBase__ctor.htm
"GH_ColourPickerBase Constructor ")

[GH_ColourPickerBase
Properties](../html/Properties_T_Grasshopper_GUI_Base_GH_ColourPickerBase.htm
"GH_ColourPickerBase Properties")

[GH_ColourPickerBase
Methods](../html/Methods_T_Grasshopper_GUI_Base_GH_ColourPickerBase.htm
"GH_ColourPickerBase Methods")

[GH_ColourPickerBase
Events](../html/Events_T_Grasshopper_GUI_Base_GH_ColourPickerBase.htm
"GH_ColourPickerBase Events")

!Click or drag to
resize

# GH_ColourPickerBase Class

---

Provides Colour picker GUI not tied to a control-handle.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.BaseGH_ColourPickerBase

**Namespace:** Grasshopper.GUI.Base
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ColourPickerBase

    Public Class GH_ColourPickerBase

The GH_ColourPickerBase type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ColourPickerBase|
Create a new instance of the Colour Picker base control. This constructor
assigns the default Colour space model and involves a call to the Grasshopper
core settings server. You must call SetupColourPicker() prior to rendering
this control on screen.
Top

Properties

| Name| Description
---|---|---
|
AutoSize|  Gets or
sets a value indicating whether the width and height of the Bounds are
adjusted to fit the UI.
|
BackColour|  Gets
or sets the background colour of the picker.
|
BaseColour|  Gets
the original base colour for this picker. Use SetupColourPicker to assign this
colour.
|
Bounds|  Gets or sets
the Bounds for this control.
|
ColourSpace|
Gets the Colour space mode used in this picker.
|
DesiredHeight|
Gets the ideal height for this colour picker given it's width and UI settings.
|
DrawAlphaSlider|
Gets or sets whether or not the alpha slider is included in the UI.
|
DrawBackground|
Gets or sets whether the background of the picker is drawn.
|
DrawChannelSliders|
Gets or sets whether or not the three basic channel sliders are included in
the UI.
|
DropperPreviewBox|
Gets the rectangle in which the eye-dropped preview will be drawn.
|
Font|  Gets or sets the
Font used in this Colour Picker. Do not Dispose the Font returned by this
property.
|
IsTextInput|
Gets whether any of the slider is currently displaying a text input box.
|
Padding|  Gets or
sets the Padding for this control.
|
PickColour|  Gets
the picked colour.
|
SRCSpaceBox|
Gets the rectangle containing the eye-dropper function.
Top

Methods

| Name| Description
---|---|---
|
Invalidate|
Raise the Invalidated event.
|
MouseClick|
Respond to mouse-click events.
|
MouseDoubleClick|
Respond to mouse-doubleclick events.
|
MouseDown|
Respond to mouse-down events.
|
MouseMove|
Respond to mouse-move events.
|
MouseUp|  Respond to
mouse-up events.
|
OnColorChanged|
Raise the ColorChanged event.
|
Render|  Render this
slider into a Graphics context.
|
RespondToEnter|
|
RespondToEscape|
|
SetUiScaling|
| SetupColourPicker(Color, Point4d,
GH_ColourSpace)|
Setup all UI elements.
| SetupColourPicker(Color, Color,
GH_ColourSpace)|
Setup all UI elements.
Top

Events

| Name| Description
---|---|---
|
ColorChanged|
Raised whenever the color of this picker is changed due to User-Interface
methods.
|
Invalidated|
Raised whenever a redraw is required.
Top

See Also

#### Reference

Grasshopper.GUI.Base Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com