---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_Author.htm
scraped_at: 2025-09-08T16:18:14.750335
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_Author Interface](../html/T_Grasshopper_Kernel_IGH_Author.htm "IGH_Author
Interface")

[IGH_Author Properties](../html/Properties_T_Grasshopper_Kernel_IGH_Author.htm
"IGH_Author Properties")

!Click or drag to
resize

# IGH_Author Interface

---

Provides of collection of basic author details.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_Author

    Public Interface IGH_Author

The IGH_Author type exposes the following members.

Properties

| Name| Description
---|---|---
|
Address|  Gets the address of
the author.
|
Company|  Gets the Company name
of the author.
|
Copyright|  Gets the
copyright message for these details.
|
Email|  Gets the email of the
author.
|
IsEmpty|  Gets whether any data
has been assigned to this object.
|
Name|  Gets the name of the
author.
|
Phone|  Gets the phone number of
the author.
|
Website|  Gets the website of
the author.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com