---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_AnnotationArrowSettings.htm
scraped_at: 2025-09-08T16:22:49.974577
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations](../html/N_Grasshopper_Rhinoceros_Annotations.htm
"Grasshopper.Rhinoceros.Annotations")

[AnnotationArrowSettings
Class](../html/T_Grasshopper_Rhinoceros_Annotations_AnnotationArrowSettings.htm
"AnnotationArrowSettings Class")

[AnnotationArrowSettings Constructor
](../html/Overload_Grasshopper_Rhinoceros_Annotations_AnnotationArrowSettings__ctor.htm
"AnnotationArrowSettings Constructor ")

[AnnotationArrowSettings
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_AnnotationArrowSettings.htm
"AnnotationArrowSettings Properties")

[AnnotationArrowSettings
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_AnnotationArrowSettings.htm
"AnnotationArrowSettings Methods")

[AnnotationArrowSettings Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Annotations_AnnotationArrowSettings.htm
"AnnotationArrowSettings Type Conversions")

!Click or drag to
resize

# AnnotationArrowSettings Class

---

Represents an annotation base arrowhead settings.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.Rhinoceros.AnnotationsAnnotationArrowSettings

**Namespace:**
Grasshopper.Rhinoceros.Annotations
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class AnnotationArrowSettings : ModelData

    Public NotInheritable Class AnnotationArrowSettings
    	Inherits ModelData

The AnnotationArrowSettings type exposes the following members.

Constructors

| Name| Description
---|---|---
|
AnnotationArrowSettings|
Initializes a new instance of the AnnotationArrowSettings class
|
AnnotationArrowSettings(AnnotationArrowSettingsAttributes)|
Initializes a new instance of the AnnotationArrowSettings class
|
AnnotationArrowSettings(DimensionStyle)|
Initializes a new instance of the AnnotationArrowSettings class
Top

Properties

| Name| Description
---|---|---
|
Arrow1|
|
Arrow2|
|
ArrowSize|
|
DimensionInline|
|
FitArrow|
|
LeaderArrow|
|
LeaderArrowSize|
Top

Methods

| Name| Description
---|---|---
|
CastToT|  (Inherited from
ModelData.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|  (Inherited
from ModelData.)
|
GetDimensionStyle|
|
GetHashCode|  (Inherited
from ModelData.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelData.)
|
ToString|  (Inherited from
ModelData.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (AnnotationArrowSettings to
DimensionStyle)|
!Static
member| (AnnotationArrowSettingsAttributes to
AnnotationArrowSettings)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com