---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_StateTag.htm
scraped_at: 2025-09-08T16:18:00.741631
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_StateTag Class](../html/T_Grasshopper_Kernel_GH_StateTag.htm "GH_StateTag
Class")

[GH_StateTag Constructor ](../html/M_Grasshopper_Kernel_GH_StateTag__ctor.htm
"GH_StateTag Constructor ")

[GH_StateTag
Properties](../html/Properties_T_Grasshopper_Kernel_GH_StateTag.htm
"GH_StateTag Properties")

[GH_StateTag Methods](../html/Methods_T_Grasshopper_Kernel_GH_StateTag.htm
"GH_StateTag Methods")

!Click or drag to
resize

# GH_StateTag Class

---

Abstract implementation of the IGH_StateTag interface. Derive from this class
rather than implementing IGH_StateTag.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_StateTag

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_StateTag : IGH_StateTag

    Public MustInherit Class GH_StateTag
    	Implements IGH_StateTag

The GH_StateTag type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_StateTag| Initializes a new
instance of the GH_StateTag class
Top

Properties

| Name| Description
---|---|---
|
Description|
|
Icon|
|
Name|
|
Stage|  Gets or sets the stage
rectangle for this tag.
|
StateDescription|
Gets or sets the state description for this tag.
Top

Methods

| Name| Description
---|---|---
|
Render|
|
RenderFreeformIcon|
Render a filled path with default shading.
|
RenderTagBlankIcon(Graphics)|
Render a blank rectangle icon.
| RenderTagBlankIcon(Graphics,
GH_StateTagDrawCallback)|
Render a blank rectangle icon.
|
RenderTagPolygonIcon|
Render a filled polygon with default shading.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com