---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_BakeUtility.htm
scraped_at: 2025-09-08T16:15:37.091271
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_BakeUtility Class](../html/T_Grasshopper_Kernel_GH_BakeUtility.htm
"GH_BakeUtility Class")

[GH_BakeUtility Constructor
](../html/M_Grasshopper_Kernel_GH_BakeUtility__ctor.htm "GH_BakeUtility
Constructor ")

[GH_BakeUtility
Properties](../html/Properties_T_Grasshopper_Kernel_GH_BakeUtility.htm
"GH_BakeUtility Properties")

[GH_BakeUtility
Methods](../html/Methods_T_Grasshopper_Kernel_GH_BakeUtility.htm
"GH_BakeUtility Methods")

!Click or drag to
resize

# GH_BakeUtility Class

---

A utility class for baking. We heavily recommend you use this for any baking,
as it handles invalid objects correctly.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_BakeUtility

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_BakeUtility

    Public Class GH_BakeUtility

The GH_BakeUtility type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_BakeUtility|  Create a new
baker.
Top

Properties

| Name| Description
---|---|---
|
BakedCount|  Gets the
number of successful baking operations.
|
BakedIds|  Gets all
collected object ids.
|
InvalidCount|  Gets
the number of invalid objects encountered.
Top

Methods

| Name| Description
---|---|---
|
BakeObject|  Try and
bake a single object.
|
BakeObjects|  Bake a
bunch of objects.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com