---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_AnnotationArrow.htm
scraped_at: 2025-09-08T16:22:47.940585
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations](../html/N_Grasshopper_Rhinoceros_Annotations.htm
"Grasshopper.Rhinoceros.Annotations")

[AnnotationArrow
Class](../html/T_Grasshopper_Rhinoceros_Annotations_AnnotationArrow.htm
"AnnotationArrow Class")

[AnnotationArrow Constructor
](../html/Overload_Grasshopper_Rhinoceros_Annotations_AnnotationArrow__ctor.htm
"AnnotationArrow Constructor ")

[AnnotationArrow
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_AnnotationArrow.htm
"AnnotationArrow Properties")

[AnnotationArrow
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_AnnotationArrow.htm
"AnnotationArrow Methods")

[AnnotationArrow Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Annotations_AnnotationArrow.htm
"AnnotationArrow Type Conversions")

!Click or drag to
resize

# AnnotationArrow Class

---

Represents an arrowhead type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.Rhinoceros.AnnotationsAnnotationArrow

**Namespace:**
Grasshopper.Rhinoceros.Annotations
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class AnnotationArrow : ModelData

    Public NotInheritable Class AnnotationArrow
    	Inherits ModelData

The AnnotationArrow type exposes the following members.

Constructors

| Name| Description
---|---|---
|
AnnotationArrow|
Initializes a new instance of the AnnotationArrow class
|
AnnotationArrow(ArrowType)|
Initializes a new instance of the AnnotationArrow class
|
AnnotationArrow(AnnotationArrowAttributes)|
Initializes a new instance of the AnnotationArrow class
Top

Properties

| Name| Description
---|---|---
|
ArrowType|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT|  (Inherited from
ModelData.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|  (Inherited
from ModelData.)
|
GetHashCode|  (Inherited
from ModelData.)
|
ToAttributes|
(Inherited from ModelData.)
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelData.)
|
ToString|  (Inherited from
ModelData.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ArrowType to
AnnotationArrow)|
!Static
member| (AnnotationArrowAttributes to
AnnotationArrow)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com