---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_VectorForce.htm
scraped_at: 2025-09-08T16:21:42.699703
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_VectorForce Class](../html/T_Grasshopper_Kernel_Types_GH_VectorForce.htm
"GH_VectorForce Class")

[GH_VectorForce Constructor
](../html/M_Grasshopper_Kernel_Types_GH_VectorForce__ctor.htm "GH_VectorForce
Constructor ")

[GH_VectorForce
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_VectorForce.htm
"GH_VectorForce Properties")

[GH_VectorForce
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_VectorForce.htm
"GH_VectorForce Methods")

!Click or drag to
resize

# GH_VectorForce Class

---

Linear vector force implementation for IGH_Fields.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_FieldElement
Grasshopper.Kernel.TypesGH_VectorForce

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_VectorForce : GH_FieldElement

    Public Class GH_VectorForce
    	Inherits GH_FieldElement

The GH_VectorForce type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_VectorForce|
Initializes a new instance of the GH_VectorForce class
Top

Properties

| Name| Description
---|---|---
|
BoundingBox|
(Overrides
GH_FieldElementBoundingBox.)
|
Chord|
|
ClippingBox|
(Inherited from
GH_FieldElement.)
|
ElementGuid|
(Overrides
GH_FieldElementElementGuid.)
|
IsLimited|
(Inherited from
GH_FieldElement.)
|
Limits|  (Inherited
from GH_FieldElement.)
Top

Methods

| Name| Description
---|---|---
|
DrawViewportMeshes|
(Inherited from
GH_FieldElement.)
|
DrawViewportWires|
(Overrides
GH_FieldElementDrawViewportWires(GH_PreviewWireArgs).)
|
Duplicate|
(Overrides
GH_FieldElementDuplicate.)
|
Force|  (Overrides
GH_FieldElementForce(Point3d).)
|
IsCoincident|
(Inherited from
GH_FieldElement.)
|
Read|  (Overrides
GH_FieldElementRead(GH_IReader).)
|
Write|  (Overrides
GH_FieldElementWrite(GH_IWriter).)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com