---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_IconLabel.htm
scraped_at: 2025-09-08T16:12:45.351743
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_IconLabel Class](../html/T_Grasshopper_GUI_GH_IconLabel.htm "GH_IconLabel
Class")

[GH_IconLabel Constructor ](../html/M_Grasshopper_GUI_GH_IconLabel__ctor.htm
"GH_IconLabel Constructor ")

[GH_IconLabel
Properties](../html/Properties_T_Grasshopper_GUI_GH_IconLabel.htm
"GH_IconLabel Properties")

[GH_IconLabel Methods](../html/Methods_T_Grasshopper_GUI_GH_IconLabel.htm
"GH_IconLabel Methods")

!Click or drag to
resize

# GH_IconLabel Class

---

A simple Icon with an icon overlay plus highlight rectangle.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsLabel
Grasshopper.GUIGH_IconLabel

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_IconLabel : Label

    Public Class GH_IconLabel
    	Inherits Label

The GH_IconLabel type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_IconLabel| Initializes a new
instance of the GH_IconLabel class
Top

Properties

| Name| Description
---|---|---
|
LabelIcon|
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com