---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_UserObject.htm
scraped_at: 2025-09-08T16:18:09.740501
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_UserObject Class](../html/T_Grasshopper_Kernel_GH_UserObject.htm
"GH_UserObject Class")

[GH_UserObject Constructor
](../html/Overload_Grasshopper_Kernel_GH_UserObject__ctor.htm "GH_UserObject
Constructor ")

[GH_UserObject
Properties](../html/Properties_T_Grasshopper_Kernel_GH_UserObject.htm
"GH_UserObject Properties")

[GH_UserObject Methods](../html/Methods_T_Grasshopper_Kernel_GH_UserObject.htm
"GH_UserObject Methods")

!Click or drag to
resize

# GH_UserObject Class

---

Represents a custom user object. A User Object is an existing
IGH_DocumentObject with overridden icon, instance description and exposure.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_UserObject

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_UserObject

    Public Class GH_UserObject

The GH_UserObject type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_UserObject|  Empty
constructor
|
GH_UserObject(String)|
Create a new user object from an existing *.ghuser file.
Top

Properties

| Name| Description
---|---|---
|
BaseGuid|  Gets or sets the
ComponentID of the IGH_DocumentObject that functions as the base class for
this User Object.
|
Data|  Gets or sets the
serialized data. This data is used to deserialize a new instance of the base
class.
|
Description|  Gets or
sets the Instance Description override for this User Object.
|
Exposure|  Gets or sets the
Exposure of this User Object.
|
Guid|  Gets or sets the Guid of
this User Object. The Guid is created anew during construction and is not
stored in the User Object File. You should never have to set this field.
|
Icon|  Gets or sets the icon
associated with this User Object. If the icon hasn't been overridden, then a
Default icon is returned.
|
Path|  Gets or sets the file
path this User Object is loaded from or saved to.
Top

Methods

| Name| Description
---|---|---
|
Clear|  Destroy all data
except the file path and the ID.
|
CreateDefaultPath|
Set the Path field for this user object to the default. The default file name
is derived from the Description.Name field. This method also ensures the
UserObject directory exists.
|
InstantiateObject|
Instantiate a new IGH_DocumentObject from this User Object.
|
ReadFromFile|  Force an
update of the local data from the file. The Path field must be set for this to
work.
|
SaveToFile|  Save the
current User Object state to a file. Any existing file will be overwritten.
|
SetDataFromObject|
Set the Data field content of ths UserObject from a Document object instance.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com