---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Documentation_GH_Paragraph.htm
scraped_at: 2025-09-08T16:12:00.155466
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Documentation](../html/N_Grasshopper_Documentation.htm
"Grasshopper.Documentation")

[GH_Paragraph Class](../html/T_Grasshopper_Documentation_GH_Paragraph.htm
"GH_Paragraph Class")

[GH_Paragraph
Properties](../html/Properties_T_Grasshopper_Documentation_GH_Paragraph.htm
"GH_Paragraph Properties")

[GH_Paragraph
Methods](../html/Methods_T_Grasshopper_Documentation_GH_Paragraph.htm
"GH_Paragraph Methods")

!Click or drag to
resize

# GH_Paragraph Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.DocumentationGH_Paragraph

**Namespace:** Grasshopper.Documentation
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Paragraph : IGH_Content

    Public Class GH_Paragraph
    	Implements IGH_Content

The GH_Paragraph type exposes the following members.

Properties

| Name| Description
---|---|---
|
Content|
Top

Methods

| Name| Description
---|---|---
|
Create(String)|
|
Create(String)|
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

See Also

#### Reference

Grasshopper.Documentation Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com