---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DocumentTree.htm
scraped_at: 2025-09-08T16:16:36.319462
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocumentTree Class](../html/T_Grasshopper_Kernel_GH_DocumentTree.htm
"GH_DocumentTree Class")

[GH_DocumentTree Constructor
](../html/M_Grasshopper_Kernel_GH_DocumentTree__ctor.htm "GH_DocumentTree
Constructor ")

[GH_DocumentTree
Properties](../html/Properties_T_Grasshopper_Kernel_GH_DocumentTree.htm
"GH_DocumentTree Properties")

[GH_DocumentTree
Methods](../html/Methods_T_Grasshopper_Kernel_GH_DocumentTree.htm
"GH_DocumentTree Methods")

!Click or drag to
resize

# GH_DocumentTree Class

---

Represents a hierarchical tree of documents that are subsidiary to one
another.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_DocumentTree

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DocumentTree : IGH_DebugDescription

    Public Class GH_DocumentTree
    	Implements IGH_DebugDescription

The GH_DocumentTree type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DocumentTree|  Create a
new document tree.
Top

Properties

| Name| Description
---|---|---
|
FlatCollection|
Gets a flat collection of all documents. The most subsidiary documents are at
the start of the collection.
|
Root|  Gets the root node for
this document.
|
RootDocument|  Gets
the document inside the root node of this tree.
Top

Methods

| Name| Description
---|---|---
|
AppendToDebugLog|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com