---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelContentName.htm
scraped_at: 2025-09-08T16:22:36.877651
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelContentName
Structure](../html/T_Grasshopper_Rhinoceros_ModelContentName.htm
"ModelContentName Structure")

[ModelContentName
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelContentName.htm
"ModelContentName Properties")

[ModelContentName
Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelContentName.htm
"ModelContentName Methods")

[ModelContentName Operators and Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_ModelContentName.htm
"ModelContentName Operators and Type Conversions")

[ModelContentName
Fields](../html/Fields_T_Grasshopper_Rhinoceros_ModelContentName.htm
"ModelContentName Fields")

!Click or drag to
resize

# ModelContentName Structure

---

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct ModelContentName : IEquatable<ModelContentName>,
    	IComparable<ModelContentName>, IComparable

    Public Structure ModelContentName
    	Implements IEquatable(Of ModelContentName), IComparable(Of ModelContentName),
    	IComparable

The ModelContentName type exposes the following members.

Properties

| Name| Description
---|---|---
|
IsDefault|
|
IsDefaultOrEmpty|
|
IsEmpty|
|
Parent|
!Static
member|
Separator|
|
Stem|
Top

Methods

| Name| Description
---|---|---
|
Combine|
|
CompareTo(ModelContentName)|
|
CompareTo(Object)|
|
Equals(ModelContentName)|
|
Equals(Object)|
(Overrides
[ValueTypeEquals(Object)](https://docs.microsoft.com/dotnet/api/system.valuetype.equals#system-
valuetype-equals\(system-object\)).)
|
GetHashCode|
(Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
|
Split|
|
ToString|
(Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Operators

| Name| Description
---|---|---
!Static
member|
Division|
!Static
member| Equality(ModelContentName,
ModelContentName)|
!Static
member| Equality(ModelContentName,
String)|
!Static
member| Equality(String,
ModelContentName)|
!Static
member| (ModelContentName to
String)|
!Static
member| (String to
ModelContentName)|
!Static
member| Inequality(ModelContentName,
ModelContentName)|
!Static
member| Inequality(ModelContentName,
String)|
!Static
member| Inequality(String,
ModelContentName)|
!Static
member|
OnesComplement|
Top

Fields

| Name| Description
---|---|---
|
Comparer|
|
Empty|
Top

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com