---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DocumentIO.htm
scraped_at: 2025-09-08T16:16:28.295772
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocumentIO Class](../html/T_Grasshopper_Kernel_GH_DocumentIO.htm
"GH_DocumentIO Class")

[GH_DocumentIO Constructor
](../html/Overload_Grasshopper_Kernel_GH_DocumentIO__ctor.htm "GH_DocumentIO
Constructor ")

[GH_DocumentIO
Properties](../html/Properties_T_Grasshopper_Kernel_GH_DocumentIO.htm
"GH_DocumentIO Properties")

[GH_DocumentIO Methods](../html/Methods_T_Grasshopper_Kernel_GH_DocumentIO.htm
"GH_DocumentIO Methods")

!Click or drag to
resize

# GH_DocumentIO Class

---

Provides basic IO operations for GH_Documents.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_DocumentIO

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_DocumentIO

    Public NotInheritable Class GH_DocumentIO

The GH_DocumentIO type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DocumentIO|  Create a new
instance of GH_DocumentIO without an internal document.
|
GH_DocumentIO(GH_Document)|
Create a new instance of GH_DocumentIO with an internal document.
Top

Properties

| Name| Description
---|---|---
!Static
member|
DisableOverwriteProtection|
Gets or sets whether the file overwrite protection dialog ought to be shown
during risky saves.
|
Document|  Gets or sets the
internal document.
|
IsDocument|  Gets a value
indicating whether or not this instance of GH_DocumentIO contains an internal
document.
|
LocalClipboardContent|
Gets the contents of the local clipboard.
Top

Methods

| Name| Description
---|---|---
|
ClearClipboard|
Clear the Clipboard Text content. This function wipes both the Text and
UnicodeText clipboard fields.
|
Copy(GH_ClipboardType)|  Copy
the internal document into the clipboard.
| Copy(GH_ClipboardType,
Boolean)|  Copy the internal
document into the clipboard.
| Copy(GH_ClipboardType,
IEnumerableGuid)|  Copy the
specified objects in the internal document into the clipboard.
|
GetDocumentIcon|
Try and extract the icon image of a document. Not all gh/ghx files contain an
icon so this function may return null. The document itself is not loaded and
rendered, so the icon really has to be part of the file already.
|
GetDocumentThumbnail|
Try and extract the preview image of a document. Not all gh/ghx files contain
a thumbnail so this function may return null. The document itself is not
loaded and rendered, so the thumbnail really has to be part of the file
already.
|
Open|  Perform a default Open
operation and store the result as the internal document.
|
Open(String)|  Open the file
at the given location.
|
OpenDocumentDialog|
Display the Open GH/GHX dialog.
|
Paste|  Deserialize a
Grasshopper document from the clipboard. On success, the internal document of
this GH_DocumentIO instance will be set.
|
Save|  Perform a default Save
operation on the internal document.
|
SaveAs|  Perform a default
Save As operation on the internal document.
|
SaveAsCopyDocumentDialog|
Display the Save As Copy GH/GHX dialog.
|
SaveAsDocumentDialog|
Display the Save As GH/GHX dialog.
|
SaveBackup|  Save a time-
stamped copy of the current file.
|
SaveDocumentDialog|
Display the Save GH/GHX dialog.
|
SaveQuiet|  Quietly save a
file to a given location.
|
ShowOverwriteDialog(String)|
|
ShowOverwriteDialog(String, DateTime,
DateTime)|
|
SubsidiaryDocumentSavePrompt(GH_Document)|
Display a 'stuff has changed do you want to save' message box with
Yes/No/Cancel options.
|
SubsidiaryDocumentSavePrompt(String, Boolean,
Int32)|
Display a 'stuff has changed do you want to save' message box with
Yes/No/Cancel options.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com