---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_LonLatCoordinate.htm
scraped_at: 2025-09-08T16:21:00.479496
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_LonLatCoordinate
Class](../html/T_Grasshopper_Kernel_Types_GH_LonLatCoordinate.htm
"GH_LonLatCoordinate Class")

[GH_LonLatCoordinate Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_LonLatCoordinate__ctor.htm
"GH_LonLatCoordinate Constructor ")

[GH_LonLatCoordinate
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_LonLatCoordinate.htm
"GH_LonLatCoordinate Properties")

[GH_LonLatCoordinate
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_LonLatCoordinate.htm
"GH_LonLatCoordinate Methods")

!Click or drag to
resize

# GH_LonLatCoordinate Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_LonLatCoordinate

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_LonLatCoordinate : IGH_Goo

    Public Class GH_LonLatCoordinate
    	Implements IGH_Goo

The GH_LonLatCoordinate type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_LonLatCoordinate|
Initializes a new instance of the GH_LonLatCoordinate class
| GH_LonLatCoordinate(Double,
Double)|
Initializes a new instance of the GH_LonLatCoordinate class
Top

Properties

| Name| Description
---|---|---
|
IsValid|
|
IsValidWhyNot|
|
Latitude|  Gets
or sets the longitude (in degrees) of the location.
|
Longitude|
Gets or sets the longitude (in degrees) of the location.
|
SphereUParameter|
Gets the spherical U parameter.
|
SphereVParameter|
Gets the spherical V parameter.
|
TypeDescription|
|
TypeName|
Top

Methods

| Name| Description
---|---|---
|
CastFrom|
|
CastToT|
|
Duplicate|
|
EmitProxy|
|
Read|
|
ScriptVariable|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com