---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Documentation_GH_GlossaryItem.htm
scraped_at: 2025-09-08T16:11:57.128252
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Documentation](../html/N_Grasshopper_Documentation.htm
"Grasshopper.Documentation")

[GH_GlossaryItem
Class](../html/T_Grasshopper_Documentation_GH_GlossaryItem.htm
"GH_GlossaryItem Class")

[GH_GlossaryItem
Properties](../html/Properties_T_Grasshopper_Documentation_GH_GlossaryItem.htm
"GH_GlossaryItem Properties")

[GH_GlossaryItem
Methods](../html/Methods_T_Grasshopper_Documentation_GH_GlossaryItem.htm
"GH_GlossaryItem Methods")

!Click or drag to
resize

# GH_GlossaryItem Class

---

Represents a single glossary entry in the Grasshopper help.

Inheritance Hierarchy

SystemObject
Grasshopper.DocumentationGH_GlossaryItem

**Namespace:** Grasshopper.Documentation
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_GlossaryItem

    Public Class GH_GlossaryItem

The GH_GlossaryItem type exposes the following members.

Properties

| Name| Description
---|---|---
|
Author|  Gets the
author of this glossary entry. This field is optional and may not be defined.
|
Contact|  Gets the
contact information for the glossary entry author. This field is optional and
may not be defined.
|
Descriptions|
Gets the description (definition) for this glossary entry.
|
Path|  Gets the source
file for this glossary entry.
|
Pronunciation|
Gets the pronunciation guide to the word. This field is optional and may not
be defined.
|
Synonyms|  Gets
the synonyms for this glossary entry.
|
Word|  Gets the word
this glossary entry is about.
Top

Methods

| Name| Description
---|---|---
|
ParseFile|  Parse
a *.glossary file and return a glossary entry.
Top

See Also

#### Reference

Grasshopper.Documentation Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com