---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_DoubleBufferedPanel.htm
scraped_at: 2025-09-08T16:12:29.277970
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_DoubleBufferedPanel
Class](../html/T_Grasshopper_GUI_GH_DoubleBufferedPanel.htm
"GH_DoubleBufferedPanel Class")

[GH_DoubleBufferedPanel Constructor
](../html/M_Grasshopper_GUI_GH_DoubleBufferedPanel__ctor.htm
"GH_DoubleBufferedPanel Constructor ")

[GH_DoubleBufferedPanel
Methods](../html/Methods_T_Grasshopper_GUI_GH_DoubleBufferedPanel.htm
"GH_DoubleBufferedPanel Methods")

!Click or drag to
resize

# GH_DoubleBufferedPanel Class

---

Derives from Windows.Forms.Panel but overrides certain flags that improve on-
screen rendering. Use panel if you want to have a custom drawn control that is
under the control of the owner form.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsPanel
Grasshopper.GUIGH_DoubleBufferedPanel
Grasshopper.GUIGH_FontList
Grasshopper.GUIGH_FontScroller
Grasshopper.GUIGH_HorizontalSeparator
Grasshopper.GUIGH_VerticalScrollBar
Grasshopper.GUIGH_VerticalSeparator

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DoubleBufferedPanel : Panel

    Public Class GH_DoubleBufferedPanel
    	Inherits Panel

The GH_DoubleBufferedPanel type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DoubleBufferedPanel|
Initializes a new instance of the GH_DoubleBufferedPanel class
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com