---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_AnnotationUnitsSettings_Attributes.htm
scraped_at: 2025-09-08T16:23:01.995187
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations](../html/N_Grasshopper_Rhinoceros_Annotations.htm
"Grasshopper.Rhinoceros.Annotations")

[AnnotationUnitsSettings.Attributes
Class](../html/T_Grasshopper_Rhinoceros_Annotations_AnnotationUnitsSettings_Attributes.htm
"AnnotationUnitsSettings.Attributes Class")

[AnnotationUnitsSettings.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_Annotations_AnnotationUnitsSettings_Attributes__ctor.htm
"AnnotationUnitsSettings.Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_AnnotationUnitsSettings_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_AnnotationUnitsSettings_Attributes.htm
"Attributes Methods")

!Click or drag to
resize

# AnnotationUnitsSettingsAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.Rhinoceros.AnnotationsAnnotationUnitsSettingsAttributes

**Namespace:**
Grasshopper.Rhinoceros.Annotations
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Attributes : ModelDataAttributes,
    	IStructuralEquatable, IEquatable<AnnotationUnitsSettingsAttributes>

    Public NotInheritable Class Attributes
    	Inherits ModelDataAttributes
    	Implements IStructuralEquatable, IEquatable(Of AnnotationUnitsSettingsAttributes)

The AnnotationUnitsSettingsAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
AnnotationUnitsSettingsAttributes|
Initializes a new instance of the AnnotationUnitsSettingsAttributes class
Top

Properties

| Name| Description
---|---|---
|
AngleFormat|
|
AngleResolution|
|
AngleRoundoff|
|
AngleZeroSuppression|
|
LengthDisplay|
|
LengthFactor|
|
LengthPrefix|
|
LengthResolution|
|
LengthRoundoff|
|
LengthSuffix|
|
LengthZeroSuppression|
|
StackFractionFormat|
|
StackHeightScale|
Top

Methods

| Name| Description
---|---|---
|
Clone|  (Inherited
from
ModelDataAttributes.)
|
Equals(Object)|
(Overrides
[ObjectEquals(Object)](https://docs.microsoft.com/dotnet/api/system.object.equals#system-
object-equals\(system-object\)).)
| Equals(Object,
IEqualityComparer)|
|
From|
|
GetHashCode|
(Overrides
[ObjectGetHashCode](https://docs.microsoft.com/dotnet/api/system.object.gethashcode#system-
object-gethashcode).)
|
GetHashCode(IEqualityComparer)|
|
ToDetails|
(Overrides
ModelDataAttributesToDetails.)
|
ToModelData|
(Overrides
ModelDataAttributesToModelData.)
|
ToString|
(Inherited from
ModelDataAttributes.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com