---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DebugDescriptionWriter.htm
scraped_at: 2025-09-08T16:16:01.167508
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DebugDescriptionWriter
Class](../html/T_Grasshopper_Kernel_GH_DebugDescriptionWriter.htm
"GH_DebugDescriptionWriter Class")

[GH_DebugDescriptionWriter Constructor
](../html/M_Grasshopper_Kernel_GH_DebugDescriptionWriter__ctor.htm
"GH_DebugDescriptionWriter Constructor ")

[GH_DebugDescriptionWriter
Properties](../html/Properties_T_Grasshopper_Kernel_GH_DebugDescriptionWriter.htm
"GH_DebugDescriptionWriter Properties")

[GH_DebugDescriptionWriter
Methods](../html/Methods_T_Grasshopper_Kernel_GH_DebugDescriptionWriter.htm
"GH_DebugDescriptionWriter Methods")

!Click or drag to
resize

# GH_DebugDescriptionWriter Class

---

Writer object used to create debug logs.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_DebugDescriptionWriter

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DebugDescriptionWriter

    Public Class GH_DebugDescriptionWriter

The GH_DebugDescriptionWriter type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DebugDescriptionWriter|
Initializes a new instance of the GH_DebugDescriptionWriter class
Top

Properties

| Name| Description
---|---|---
|
Depth|  Gets the
depth of the current writer. Depth is represented by whitespace in front of
each line.
Top

Methods

| Name| Description
---|---|---
|
CloseBlock|
Close the current block and decrease the depth by 1.
|
CreateBlock|
Begin a new block. This will increase the depth by 1. You _must_ call
CloseBlock() if you call this function.
|
CreateLog|
Get a single string that represents the entire log so far.
|
WriteLine|
Write a new blank line to the log.
|
WriteLine(String)|
Write a new line to the log.
| WriteLine(String,
Object)|
Write a new formatted line to the log.
|
WriteLogToFile|
Write the log to a text file.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com