---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_IGH_ResponsiveObject.htm
scraped_at: 2025-09-08T16:14:53.887841
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[IGH_ResponsiveObject
Interface](../html/T_Grasshopper_GUI_Canvas_IGH_ResponsiveObject.htm
"IGH_ResponsiveObject Interface")

[IGH_ResponsiveObject
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_IGH_ResponsiveObject.htm
"IGH_ResponsiveObject Methods")

!Click or drag to
resize

# IGH_ResponsiveObject Interface

---

If you wish to participate in Canvas UI events, you must implement this
interface.

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_ResponsiveObject

    Public Interface IGH_ResponsiveObject

The IGH_ResponsiveObject type exposes the following members.

Methods

| Name| Description
---|---|---
|
RespondToKeyDown|
|
RespondToKeyUp|
|
RespondToMouseDoubleClick|
This function will be called whenever the left button is double-clicked over
the canvas. If you are active, you will be the only object who gets called.
|
RespondToMouseDown|
This function will be called whenever a mouse button is pressed over the
canvas. If you are active, you will be the only object who gets called. If you
are inactive, you might get called if nobody on top of you decides to become
active.
|
RespondToMouseMove|
This function will be called when the mouse moves across the canvas. If you
are active, you will be the only object who gets called. If you are inactive,
you might get called if nobody on top of you decides to become active.
|
RespondToMouseUp|
This function will be called whenever a mouse button is released over the
canvas. If you are active, you will be the only object who gets called. If you
are inactive, you will not be called at all for MouseUp events.
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com