---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Undo_GH_UndoRecord.htm
scraped_at: 2025-09-08T16:22:03.737655
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Undo](../html/N_Grasshopper_Kernel_Undo.htm
"Grasshopper.Kernel.Undo")

[GH_UndoRecord Class](../html/T_Grasshopper_Kernel_Undo_GH_UndoRecord.htm
"GH_UndoRecord Class")

[GH_UndoRecord Constructor
](../html/Overload_Grasshopper_Kernel_Undo_GH_UndoRecord__ctor.htm
"GH_UndoRecord Constructor ")

[GH_UndoRecord
Properties](../html/Properties_T_Grasshopper_Kernel_Undo_GH_UndoRecord.htm
"GH_UndoRecord Properties")

[GH_UndoRecord
Methods](../html/Methods_T_Grasshopper_Kernel_Undo_GH_UndoRecord.htm
"GH_UndoRecord Methods")

!Click or drag to
resize

# GH_UndoRecord Class

---

Represents a single undo/redo record. A single record may contain any number
of undo actions.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.UndoGH_UndoRecord

**Namespace:** Grasshopper.Kernel.Undo
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_UndoRecord

    Public Class GH_UndoRecord

The GH_UndoRecord type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_UndoRecord|
Initializes a new instance of the GH_UndoRecord class
|
GH_UndoRecord(String)|
Initializes a new instance of the GH_UndoRecord class
| GH_UndoRecord(String,
IGH_UndoAction)|
Initializes a new instance of the GH_UndoRecord class
| GH_UndoRecord(String,
IGH_UndoAction)|
Initializes a new instance of the GH_UndoRecord class
| GH_UndoRecord(String,
IEnumerableIGH_UndoAction)|
Initializes a new instance of the GH_UndoRecord class
Top

Properties

| Name| Description
---|---|---
|
ActionCount|  Gets
the number of actions stored in this record.
|
Actions|  Gets or sets
the actions inside this record.
|
ExpiresDisplay|
Gets the display expiration flag for this event. If True, the Rhino viewports
will be redrawn once the entire undo record has been completed. If
ExpiresSolution is set to true, ExpriresDisplay is implied.
|
ExpiresSolution|
Gets the solution expiration flag for this event. If True, the solution needs
to be recalculated once the entire undo record has been completed.
|
Guid|  Gets the ID of this
undo item. Every undo record has a unique ID.
|
Name|  Gets or sets the
name of the undo record (as displayed in the menu)
|
State|  Gets the undo
state of this record. The state dictates which action are legal.
|
Time|  Gets the time at
which this record was created.
Top

Methods

| Name| Description
---|---|---
|
AddAction|  Append an
undo action to this record. You should only do this prior to calling undo for
the first time.
|
Redo|
|
Undo|
Top

See Also

#### Reference

Grasshopper.Kernel.Undo Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com