---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_DifferentialSolver.htm
scraped_at: 2025-09-08T16:20:32.364528
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[Complex Structure](../html/T_Grasshopper_Kernel_Types_Complex.htm "Complex
Structure")

[GH_AngularDimension
Class](../html/T_Grasshopper_Kernel_Types_GH_AngularDimension.htm
"GH_AngularDimension Class")

[GH_AnnotationBase
Class](../html/T_Grasshopper_Kernel_Types_GH_AnnotationBase.htm
"GH_AnnotationBase Class")

[GH_AnnotationBase.GH_AnnotationBaseProxy(T)
Class](../html/T_Grasshopper_Kernel_Types_GH_AnnotationBase_GH_AnnotationBaseProxy_1.htm
"GH_AnnotationBase.GH_AnnotationBaseProxy\(T\) Class")

GH_Arc Class

[GH_Boolean Class](../html/T_Grasshopper_Kernel_Types_GH_Boolean.htm
"GH_Boolean Class")

GH_Box Class

[GH_Box.GH_BoxProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Box_GH_BoxProxy.htm
"GH_Box.GH_BoxProxy Class")

[GH_Brep Class](../html/T_Grasshopper_Kernel_Types_GH_Brep.htm "GH_Brep
Class")

[GH_Brep.GH_BrepProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Brep_GH_BrepProxy.htm
"GH_Brep.GH_BrepProxy Class")

[GH_Centermark Class](../html/T_Grasshopper_Kernel_Types_GH_Centermark.htm
"GH_Centermark Class")

[GH_Circle Class](../html/T_Grasshopper_Kernel_Types_GH_Circle.htm "GH_Circle
Class")

[GH_Circle.GH_CircleProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Circle_GH_CircleProxy.htm
"GH_Circle.GH_CircleProxy Class")

[GH_Colour Class](../html/T_Grasshopper_Kernel_Types_GH_Colour.htm "GH_Colour
Class")

[GH_ComplexNumber
Class](../html/T_Grasshopper_Kernel_Types_GH_ComplexNumber.htm
"GH_ComplexNumber Class")

[GH_Culture Class](../html/T_Grasshopper_Kernel_Types_GH_Culture.htm
"GH_Culture Class")

[GH_Curve Class](../html/T_Grasshopper_Kernel_Types_GH_Curve.htm "GH_Curve
Class")

[GH_Curve.GH_CurveProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Curve_GH_CurveProxy.htm
"GH_Curve.GH_CurveProxy Class")

[GH_DetailView Class](../html/T_Grasshopper_Kernel_Types_GH_DetailView.htm
"GH_DetailView Class")

[GH_DifferentialSolver
Enumeration](../html/T_Grasshopper_Kernel_Types_GH_DifferentialSolver.htm
"GH_DifferentialSolver Enumeration")

[GH_Dimension Class](../html/T_Grasshopper_Kernel_Types_GH_Dimension.htm
"GH_Dimension Class")

[GH_Dimension.GH_DimensionProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Dimension_GH_DimensionProxy.htm
"GH_Dimension.GH_DimensionProxy Class")

[GH_Extrusion Class](../html/T_Grasshopper_Kernel_Types_GH_Extrusion.htm
"GH_Extrusion Class")

[GH_Extrusion.GH_ExtrusionProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Extrusion_GH_ExtrusionProxy.htm
"GH_Extrusion.GH_ExtrusionProxy Class")

[GH_Field Class](../html/T_Grasshopper_Kernel_Types_GH_Field.htm "GH_Field
Class")

[GH_FieldElement Class](../html/T_Grasshopper_Kernel_Types_GH_FieldElement.htm
"GH_FieldElement Class")

[GH_GeometricGoo(T)
Class](../html/T_Grasshopper_Kernel_Types_GH_GeometricGoo_1.htm
"GH_GeometricGoo\(T\) Class")

[GH_GeometricGooWrapper
Class](../html/T_Grasshopper_Kernel_Types_GH_GeometricGooWrapper.htm
"GH_GeometricGooWrapper Class")

[GH_GeometryGroup
Class](../html/T_Grasshopper_Kernel_Types_GH_GeometryGroup.htm
"GH_GeometryGroup Class")

[GH_GeometryGroup.GH_GeometryGroupProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_GeometryGroup_GH_GeometryGroupProxy.htm
"GH_GeometryGroup.GH_GeometryGroupProxy Class")

[GH_Goo(T) Class](../html/T_Grasshopper_Kernel_Types_GH_Goo_1.htm "GH_Goo\(T\)
Class")

[GH_GooProxy(T) Class](../html/T_Grasshopper_Kernel_Types_GH_GooProxy_1.htm
"GH_GooProxy\(T\) Class")

[GH_Guid Class](../html/T_Grasshopper_Kernel_Types_GH_Guid.htm "GH_Guid
Class")

[GH_Hatch Class](../html/T_Grasshopper_Kernel_Types_GH_Hatch.htm "GH_Hatch
Class")

[GH_Hatch.GH_HatchProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Hatch_GH_HatchProxy.htm
"GH_Hatch.GH_HatchProxy Class")

[GH_InstanceReference
Class](../html/T_Grasshopper_Kernel_Types_GH_InstanceReference.htm
"GH_InstanceReference Class")

[GH_InstanceReference.GH_InstanceReferenceProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_InstanceReference_GH_InstanceReferenceProxy.htm
"GH_InstanceReference.GH_InstanceReferenceProxy Class")

[GH_Integer Class](../html/T_Grasshopper_Kernel_Types_GH_Integer.htm
"GH_Integer Class")

[GH_Interval Class](../html/T_Grasshopper_Kernel_Types_GH_Interval.htm
"GH_Interval Class")

[GH_Interval2D Class](../html/T_Grasshopper_Kernel_Types_GH_Interval2D.htm
"GH_Interval2D Class")

[GH_Interval2D.GH_Interval2DProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Interval2D_GH_Interval2DProxy.htm
"GH_Interval2D.GH_Interval2DProxy Class")

[GH_Leader Class](../html/T_Grasshopper_Kernel_Types_GH_Leader.htm "GH_Leader
Class")

[GH_Light Class](../html/T_Grasshopper_Kernel_Types_GH_Light.htm "GH_Light
Class")

[GH_Line Class](../html/T_Grasshopper_Kernel_Types_GH_Line.htm "GH_Line
Class")

[GH_Line.GH_LineProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Line_GH_LineProxy.htm
"GH_Line.GH_LineProxy Class")

[GH_LinearDimension
Class](../html/T_Grasshopper_Kernel_Types_GH_LinearDimension.htm
"GH_LinearDimension Class")

[GH_LineCharge Class](../html/T_Grasshopper_Kernel_Types_GH_LineCharge.htm
"GH_LineCharge Class")

[GH_LonLatCoordinate
Class](../html/T_Grasshopper_Kernel_Types_GH_LonLatCoordinate.htm
"GH_LonLatCoordinate Class")

[GH_Material Class](../html/T_Grasshopper_Kernel_Types_GH_Material.htm
"GH_Material Class")

[GH_Material.GH_Material_Proxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Material_GH_Material_Proxy.htm
"GH_Material.GH_Material_Proxy Class")

[GH_Material.MaterialType
Enumeration](../html/T_Grasshopper_Kernel_Types_GH_Material_MaterialType.htm
"GH_Material.MaterialType Enumeration")

[GH_Matrix Class](../html/T_Grasshopper_Kernel_Types_GH_Matrix.htm "GH_Matrix
Class")

[GH_Mesh Class](../html/T_Grasshopper_Kernel_Types_GH_Mesh.htm "GH_Mesh
Class")

[GH_Mesh.GH_MeshProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Mesh_GH_MeshProxy.htm
"GH_Mesh.GH_MeshProxy Class")

[GH_MeshFace Class](../html/T_Grasshopper_Kernel_Types_GH_MeshFace.htm
"GH_MeshFace Class")

[GH_MeshFace.GH_MeshFaceProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_MeshFace_GH_MeshFaceProxy.htm
"GH_MeshFace.GH_MeshFaceProxy Class")

[GH_MeshingParameters
Class](../html/T_Grasshopper_Kernel_Types_GH_MeshingParameters.htm
"GH_MeshingParameters Class")

[GH_MeshingParameters.RhMesherSettings_Proxy
Class](../html/T_Grasshopper_Kernel_Types_GH_MeshingParameters_RhMesherSettings_Proxy.htm
"GH_MeshingParameters.RhMesherSettings_Proxy Class")

[GH_Number Class](../html/T_Grasshopper_Kernel_Types_GH_Number.htm "GH_Number
Class")

[GH_ObjectWrapper
Class](../html/T_Grasshopper_Kernel_Types_GH_ObjectWrapper.htm
"GH_ObjectWrapper Class")

[GH_OrdinateDimension
Class](../html/T_Grasshopper_Kernel_Types_GH_OrdinateDimension.htm
"GH_OrdinateDimension Class")

[GH_Plane Class](../html/T_Grasshopper_Kernel_Types_GH_Plane.htm "GH_Plane
Class")

[GH_Plane.GH_PlaneProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Plane_GH_PlaneProxy.htm
"GH_Plane.GH_PlaneProxy Class")

[GH_Point Class](../html/T_Grasshopper_Kernel_Types_GH_Point.htm "GH_Point
Class")

[GH_Point.GH_PointProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Point_GH_PointProxy.htm
"GH_Point.GH_PointProxy Class")

[GH_PointCharge Class](../html/T_Grasshopper_Kernel_Types_GH_PointCharge.htm
"GH_PointCharge Class")

[GH_PointCloud Class](../html/T_Grasshopper_Kernel_Types_GH_PointCloud.htm
"GH_PointCloud Class")

[GH_PointCloud.PointCloudProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_PointCloud_PointCloudProxy.htm
"GH_PointCloud.PointCloudProxy Class")

[GH_PointRefData Class](../html/T_Grasshopper_Kernel_Types_GH_PointRefData.htm
"GH_PointRefData Class")

[GH_PointRefType
Enumeration](../html/T_Grasshopper_Kernel_Types_GH_PointRefType.htm
"GH_PointRefType Enumeration")

[GH_PointUtil Class](../html/T_Grasshopper_Kernel_Types_GH_PointUtil.htm
"GH_PointUtil Class")

[GH_Predicate Class](../html/T_Grasshopper_Kernel_Types_GH_Predicate.htm
"GH_Predicate Class")

[GH_RadialDimension
Class](../html/T_Grasshopper_Kernel_Types_GH_RadialDimension.htm
"GH_RadialDimension Class")

[GH_Rectangle Class](../html/T_Grasshopper_Kernel_Types_GH_Rectangle.htm
"GH_Rectangle Class")

[GH_Rectangle.GH_RectangleProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Rectangle_GH_RectangleProxy.htm
"GH_Rectangle.GH_RectangleProxy Class")

[GH_SpinForce Class](../html/T_Grasshopper_Kernel_Types_GH_SpinForce.htm
"GH_SpinForce Class")

[GH_String Class](../html/T_Grasshopper_Kernel_Types_GH_String.htm "GH_String
Class")

[GH_StructurePath
Class](../html/T_Grasshopper_Kernel_Types_GH_StructurePath.htm
"GH_StructurePath Class")

[GH_SubD Class](../html/T_Grasshopper_Kernel_Types_GH_SubD.htm "GH_SubD
Class")

[GH_SubD.GH_SubDProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_SubD_GH_SubDProxy.htm
"GH_SubD.GH_SubDProxy Class")

[GH_Surface Class](../html/T_Grasshopper_Kernel_Types_GH_Surface.htm
"GH_Surface Class")

[GH_Surface.GH_SurfaceProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Surface_GH_SurfaceProxy.htm
"GH_Surface.GH_SurfaceProxy Class")

[GH_TextDot Class](../html/T_Grasshopper_Kernel_Types_GH_TextDot.htm
"GH_TextDot Class")

[GH_TextDot.GH_TextDotProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_TextDot_GH_TextDotProxy.htm
"GH_TextDot.GH_TextDotProxy Class")

[GH_TextEntity Class](../html/T_Grasshopper_Kernel_Types_GH_TextEntity.htm
"GH_TextEntity Class")

[GH_Time Class](../html/T_Grasshopper_Kernel_Types_GH_Time.htm "GH_Time
Class")

[GH_Transform Class](../html/T_Grasshopper_Kernel_Types_GH_Transform.htm
"GH_Transform Class")

[GH_Vector Class](../html/T_Grasshopper_Kernel_Types_GH_Vector.htm "GH_Vector
Class")

[GH_Vector.GH_VectorProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Vector_GH_VectorProxy.htm
"GH_Vector.GH_VectorProxy Class")

[GH_VectorForce Class](../html/T_Grasshopper_Kernel_Types_GH_VectorForce.htm
"GH_VectorForce Class")

[IGH_FieldElement
Interface](../html/T_Grasshopper_Kernel_Types_IGH_FieldElement.htm
"IGH_FieldElement Interface")

[IGH_GeometricGoo
Interface](../html/T_Grasshopper_Kernel_Types_IGH_GeometricGoo.htm
"IGH_GeometricGoo Interface")

[IGH_Goo Interface](../html/T_Grasshopper_Kernel_Types_IGH_Goo.htm "IGH_Goo
Interface")

[IGH_GooProxy Interface](../html/T_Grasshopper_Kernel_Types_IGH_GooProxy.htm
"IGH_GooProxy Interface")

[IGH_ReferencedData
Interface](../html/T_Grasshopper_Kernel_Types_IGH_ReferencedData.htm
"IGH_ReferencedData Interface")

[UVInterval Structure](../html/T_Grasshopper_Kernel_Types_UVInterval.htm
"UVInterval Structure")

!Click or drag to
resize

# GH_DifferentialSolver Enumeration

---

Enumerates all implemented differential samplers.

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public enum GH_DifferentialSolver

    Public Enumeration GH_DifferentialSolver

Members

| Member name| Value| Description
---|---|---|---
| None| 0|  Unset solver, always returns a zero-length tensor.
| Euler| 1|  Euler differential solver.
| RungeKutta2| 2|  Runge-Kutta second order solver.
| RungeKutta3| 3|  Runge-Kutta third order solver.
| RungeKutta4| 4|  Runge-Kutta fourth order solver.

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com