---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_Capsule.htm
scraped_at: 2025-09-08T16:14:34.879180
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_Capsule Class](../html/T_Grasshopper_GUI_Canvas_GH_Capsule.htm "GH_Capsule
Class")

[GH_Capsule
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_GH_Capsule.htm
"GH_Capsule Properties")

[GH_Capsule Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_Capsule.htm
"GH_Capsule Methods")

[GH_Capsule Fields](../html/Fields_T_Grasshopper_GUI_Canvas_GH_Capsule.htm
"GH_Capsule Fields")

!Click or drag to
resize

# GH_Capsule Class

---

Class used to draw standard Grasshopper interface boxes.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_Capsule

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Capsule : IDisposable

    Public Class GH_Capsule
    	Implements IDisposable

The GH_Capsule type exposes the following members.

Properties

| Name| Description
---|---|---
|
Box|  Gets the outline box for
this Capsule.
|
Box_Content|  Gets the
content box for this Capsule. Text and icons are drawn inside this box.
|
Font|  Gets or sets the Font
to use for text rendering.
|
Highlight|  Gets the
highlight size for this Capsule. Zero or negative means there is no highlight.
|
HighlightShape|
Gets the graphics path that describes the highlight bar shape of the capsule.
|
InputGrips|  Gets the
list of locally defined input grip locations.
|
JaggedLeft|  Gets
whether the left edge of this capsule is jagged.
|
JaggedRight|  Gets
whether the right edge of this capsule is jagged.
|
MaxRadius|  Gets the
largest radius defined for this capsule.
|
OutlineShape|  Gets
the graphics path that describes the outer edge of the capsule.
|
OutputGrips|  Gets the
list of locally defined output grip locations.
|
Palette|  Gets or sets the
palette for this Capsule.
|
Radius|  Gets the radius of
the rounded corners of this Capsule.
|
RenderEngine|  Gets
the RenderEngine associated with this capsule. You typically don't need to go
this far, just use one of the Render() overloads on GH_Capsule directly.
|
Text|  Gets or sets the text
to render in the content box.
|
TextOrientation|
Gets or sets the orientation of the text within the content box.
Top

Methods

| Name| Description
---|---|---
|
AddInputGrip(Point)|
Add an input grip to this UI Box.
|
AddInputGrip(PointF)|
Add an input grip to this UI Box.
|
AddInputGrip(Single)|
Add an input grip to this UI Box. This is the recommended overload.
| AddInputGrip(Single,
Single)|  Add an
input grip to this UI Box.
|
AddOutputGrip(Point)|
Add an output grip to this UI Box.
|
AddOutputGrip(PointF)|
Add an output grip to this UI Box.
|
AddOutputGrip(Single)|
Add an output grip to this UI Box. This is the recommended overload.
| AddOutputGrip(Single,
Single)|  Add an
output grip to this UI Box.
|
Contains|  Test a point
for capsule containment.
|
CreateCapsule(Rectangle,
GH_Palette)|  Create a
new blank capsule with default radius and highlight dimensions.
|
CreateCapsule(RectangleF,
GH_Palette)|  Create
a new blank capsule with default radius and highlight dimensions.
|
CreateCapsule(Rectangle, GH_Palette, Int32,
Int32)|  Create a
new blank capsule.
|
CreateCapsule(Rectangle, GH_Palette, Int32,
Int32)|  Create a
new blank capsule.
|
CreateCapsule(RectangleF, GH_Palette, Int32,
Int32)|  Create a
new blank capsule.
|
CreateCapsule(RectangleF, GH_Palette, Int32,
Int32)|  Create a
new blank capsule.
|
CreateTextCapsule(Rectangle, Rectangle, GH_Palette,
String)|  Create a
new capsule with content text.
|
CreateTextCapsule(RectangleF, RectangleF, GH_Palette,
String)|  Create
a new capsule with content text.
|
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String,
Font)|  Create a
new capsule with content text.
|
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String,
Font)|  Create
a new capsule with content text.
|
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font,
GH_Orientation)|
Create a new capsule with content text.
|
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Int32,
Int32)|  Create
a new capsule with content text.
|
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Int32,
Int32)|  Create
a new capsule with content text.
|
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font,
GH_Orientation)|
Create a new capsule with content text.
|
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Int32,
Int32)|  Create
a new capsule with content text.
|
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Int32,
Int32)|  Create
a new capsule with content text.
|
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font, Int32,
Int32)|  Create
a new capsule with content text.
|
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font, Int32,
Int32)|  Create
a new capsule with content text.
|
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font, Int32,
Int32)|  Create
a new capsule with content text.
|
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font, Int32,
Int32)|  Create
a new capsule with content text.
|
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font,
GH_Orientation, Int32,
Int32)|  Create
a new capsule with content text.
|
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font,
GH_Orientation, Int32,
Int32)|  Create
a new capsule with content text.
|
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font,
GH_Orientation, Int32,
Int32)|  Create
a new capsule with content text.
|
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font,
GH_Orientation, Int32,
Int32)|  Create
a new capsule with content text.
|
Dispose| Releases all
resources used by the GH_Capsule
|
Dispose(Boolean)|
Releases the unmanaged resources used by the GH_Capsule and optionally
releases the managed resources
| Render(Graphics,
GH_PaletteStyle)|  Have this
capsule draw itself onto a Graphics surface with a custom Style override.
| Render(Graphics,
Color)|  Have this capsule
draw itself onto a Graphics surface with a custom colour override.
| Render(Graphics, Image,
GH_PaletteStyle)|  Have
this capsule draw itself onto a Graphics surface with a custom Style override.
| Render(Graphics, Image,
Color)|  Have this capsule
draw itself onto a Graphics surface with a custom colour override.
| Render(Graphics, Boolean, Boolean,
Boolean)|  Render the
capsule onto a graphics context.
| Render(Graphics, Image, Boolean,
Boolean, Boolean)|  Render
the capsule onto a graphics context.
|
SetJaggedEdges|
Assign left and right jagged edges.
Top

Fields

| Name| Description
---|---|---
|
DefaultHighlight|
The default size (in pixel units) of the highlight bar.
|
DefaultRadius|  The
default radius (in pixel units) of the rounded corners.
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com