---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_ContextualParameter2.htm
scraped_at: 2025-09-08T16:18:20.786673
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_ContextualParameter2
Interface](../html/T_Grasshopper_Kernel_IGH_ContextualParameter2.htm
"IGH_ContextualParameter2 Interface")

[IGH_ContextualParameter2
Properties](../html/Properties_T_Grasshopper_Kernel_IGH_ContextualParameter2.htm
"IGH_ContextualParameter2 Properties")

[IGH_ContextualParameter2
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_ContextualParameter2.htm
"IGH_ContextualParameter2 Methods")

!Click or drag to
resize

# IGH_ContextualParameter2 Interface

---

Version 2 of Base interface for contextual parameters. This makes accessing
non-strongly-typed functionality easier.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_ContextualParameter2 : IGH_ContextualParameter

    Public Interface IGH_ContextualParameter2
    	Inherits IGH_ContextualParameter

The IGH_ContextualParameter2 type exposes the following members.

Properties

| Name| Description
---|---|---
|
AtLeast|  Minimum
number of inputs to request  (Inherited from
IGH_ContextualParameter.)
|
AtMost|  Maximum
number of inputs to request.  (Inherited from
IGH_ContextualParameter.)
|
ContextualData|
Iterate over all specified contextual values.  (Inherited from
IGH_ContextualParameter.)
|
Immediate|  Gets
whether this parameter triggers immediate updates from inside its getter.
Immediacy is important for a smooth experience, but it maybe disabled if the
expected recalculation time becomes excessive.  (Inherited from
IGH_ContextualParameter.)
|
Prompt|  Gets the
prompt to be displayed while asking the user to enter data. The prompt string
may contain '{0}' fields which will be populated with the amount of values
picked so far.  (Inherited from
IGH_ContextualParameter.)
Top

Methods

| Name| Description
---|---|---
|
AssignContextualData|
Assign a collection of values as contextual data.  (Inherited from
IGH_ContextualParameter.)
|
AutoAssignContextualData|
Use the in-build getter UI to assign data to the parameter.  (Inherited from
IGH_ContextualParameter.)
|
ClearContextualData|
Clear previously assigned collection of values as contextual data
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com