---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelUnitSystem.htm
scraped_at: 2025-09-08T16:22:42.906161
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelUnitSystem Class](../html/T_Grasshopper_Rhinoceros_ModelUnitSystem.htm
"ModelUnitSystem Class")

[ModelUnitSystem Constructor
](../html/Overload_Grasshopper_Rhinoceros_ModelUnitSystem__ctor.htm
"ModelUnitSystem Constructor ")

[ModelUnitSystem
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelUnitSystem.htm
"ModelUnitSystem Properties")

[ModelUnitSystem
Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelUnitSystem.htm
"ModelUnitSystem Methods")

[ModelUnitSystem Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_ModelUnitSystem.htm
"ModelUnitSystem Type Conversions")

!Click or drag to
resize

# ModelUnitSystem Class

---

Represents a Rhino Unit System. Wraps the functionality of the UnitSystem
type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.RhinocerosModelUnitSystem

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelUnitSystem : ModelValue

    Public NotInheritable Class ModelUnitSystem
    	Inherits ModelValue

The ModelUnitSystem type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelUnitSystem|
Initializes a new instance of the ModelUnitSystem class
|
ModelUnitSystem(ModelUnitSystemValue)|
Initializes a new instance of the ModelUnitSystem class
| ModelUnitSystem(ActiveSpace,
RhinoDoc)| Initializes
a new instance of the ModelUnitSystem class
Top

Properties

| Name| Description
---|---|---
|
ActiveSpace|
|
BaseSystem|
|
Factor|
|
IsValid|  (Overrides
ModelValue.IsValid.)
|
MetersPerUnit|
|
Name|
Top

Methods

| Name| Description
---|---|---
|
AdjustDocumentUnitSystem|
|
Cast|
|
CastToT(T)|
(Overrides
ModelValueCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelValue.)
|
Copy|
|
Equals(ModelValue)|
(Inherited from ModelValue.)
|
Equals(Object)|
(Overrides
ModelValueEquals(Object).)
|
GetHashCode|
(Overrides
ModelValueGetHashCode.)
|
TooltipString|
(Overrides
ModelValueTooltipString.)
|
ToString|  (Inherited from
ModelValue.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelUnitSystem to
ModelUnitSystemValue)|
!Static
member| (ModelUnitSystemValue to
ModelUnitSystem)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com