---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_ParamServerEventArgs.htm
scraped_at: 2025-09-08T16:17:22.517921
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_ParamServerEventArgs
Class](../html/T_Grasshopper_Kernel_GH_ParamServerEventArgs.htm
"GH_ParamServerEventArgs Class")

[GH_ParamServerEventArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_ParamServerEventArgs.htm
"GH_ParamServerEventArgs Properties")

!Click or drag to
resize

# GH_ParamServerEventArgs Class

---

Arguments used in events for the GH_ComponentParamServer type.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_ParamServerEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ParamServerEventArgs : EventArgs

    Public Class GH_ParamServerEventArgs
    	Inherits EventArgs

The GH_ParamServerEventArgs type exposes the following members.

Properties

| Name| Description
---|---|---
|
OriginalArguments|
Gets access to the original parameter event arguments.
|
Parameter|  Gets
the parameter that caused the original event.
|
ParameterIndex|
Gets the index of the parameter that caused the original event.
|
ParameterSide|
Gets the side of the parameter that caused the original event.
|
Server|  Gets the
GH_ComponentParamServer object that raised the event.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com