---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_RuntimeMessage.htm
scraped_at: 2025-09-08T16:17:47.690660
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_RuntimeMessage Class](../html/T_Grasshopper_Kernel_GH_RuntimeMessage.htm
"GH_RuntimeMessage Class")

[GH_RuntimeMessage Constructor
](../html/M_Grasshopper_Kernel_GH_RuntimeMessage__ctor.htm "GH_RuntimeMessage
Constructor ")

[GH_RuntimeMessage
Properties](../html/Properties_T_Grasshopper_Kernel_GH_RuntimeMessage.htm
"GH_RuntimeMessage Properties")

!Click or drag to
resize

# GH_RuntimeMessage Class

---

Contains all fields that together define a RuntimeMessage. Runtime Messages
are created and recorded by document objects during Grasshopper solutions.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_RuntimeMessage

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RuntimeMessage

    Public Class GH_RuntimeMessage

The GH_RuntimeMessage type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_RuntimeMessage|
Initializes a new instance of the GH_RuntimeMessage class
Top

Properties

| Name| Description
---|---|---
|
Event|  Gets the time at
which the message was recorded.
|
HasSource|  Gets a
value indicating whether or not this message has a source.
|
Message|  Gets the
contents of the message.
|
Source|  Gets a string
describing the source object that created the message.
|
Type|  Gets the type
qualifier of the message.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com