---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_CursorServer.htm
scraped_at: 2025-09-08T16:12:22.228328
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_CursorServer Class](../html/T_Grasshopper_GUI_GH_CursorServer.htm
"GH_CursorServer Class")

[GH_CursorServer
Properties](../html/Properties_T_Grasshopper_GUI_GH_CursorServer.htm
"GH_CursorServer Properties")

[GH_CursorServer
Methods](../html/Methods_T_Grasshopper_GUI_GH_CursorServer.htm
"GH_CursorServer Methods")

!Click or drag to
resize

# GH_CursorServer Class

---

Class used to cache and set cursors.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_CursorServer

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_CursorServer

    Public NotInheritable Class GH_CursorServer

The GH_CursorServer type exposes the following members.

Properties

| Name| Description
---|---|---
|
Count|  Gets the number of
cached cursors.
Top

Methods

| Name| Description
---|---|---
|
AttachCursor|  Attach a
cursor to a control.
|
Cursor|  Gets a cursor from
the cache.
|
IsCursor|  Test for the
existence of a cursor.
|
ReferenceCursors|
Reference all the cursor files in a given directory.
|
ResetCursor|  Reset the
cursor of the given control to default.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com