---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_ObjectDisplay.htm
scraped_at: 2025-09-08T16:23:29.106575
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[ObjectDisplay
Class](../html/T_Grasshopper_Rhinoceros_Display_ObjectDisplay.htm
"ObjectDisplay Class")

[ObjectDisplay Constructor
](../html/Overload_Grasshopper_Rhinoceros_Display_ObjectDisplay__ctor.htm
"ObjectDisplay Constructor ")

[ObjectDisplay
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_ObjectDisplay.htm
"ObjectDisplay Properties")

[ObjectDisplay
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_ObjectDisplay.htm
"ObjectDisplay Methods")

[ObjectDisplay Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Display_ObjectDisplay.htm
"ObjectDisplay Type Conversions")

!Click or drag to
resize

# ObjectDisplay Class

---

Represents a Rhino object display attributes.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.Rhinoceros.DisplayObjectDisplay

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ObjectDisplay : ModelValue

    Public NotInheritable Class ObjectDisplay
    	Inherits ModelValue

The ObjectDisplay type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectDisplay|
Initializes a new instance of the ObjectDisplay class
|
ObjectDisplay(ObjectDisplayAttributes)|
Initializes a new instance of the ObjectDisplay class
Top

Properties

| Name| Description
---|---|---
|
Color|
|
WireDensity|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelValueCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelValue.)
|
Equals(ModelValue)|
(Inherited from ModelValue.)
|
Equals(Object)|
(Overrides
ModelValueEquals(Object).)
|
GetHashCode|
(Overrides
ModelValueGetHashCode.)
|
ToAttributes|
|
ToDetails|
|
TooltipString|
(Inherited from ModelValue.)
|
ToString|  (Inherited from
ModelValue.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ObjectDisplayAttributes to
ObjectDisplay)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com