---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Expressions_GH_SolverException.htm
scraped_at: 2025-09-08T16:19:45.170438
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Expressions](../html/N_Grasshopper_Kernel_Expressions.htm
"Grasshopper.Kernel.Expressions")

[GH_SolverException
Class](../html/T_Grasshopper_Kernel_Expressions_GH_SolverException.htm
"GH_SolverException Class")

[GH_SolverException Constructor
](../html/M_Grasshopper_Kernel_Expressions_GH_SolverException__ctor.htm
"GH_SolverException Constructor ")

!Click or drag to
resize

# GH_SolverException Class

---

Inheritance Hierarchy

SystemObject
SystemException
Grasshopper.Kernel.ExpressionsGH_SolverException

**Namespace:**
Grasshopper.Kernel.Expressions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_SolverException : Exception

    Public Class GH_SolverException
    	Inherits Exception

The GH_SolverException type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_SolverException|
Initializes a new instance of the GH_SolverException class
Top

See Also

#### Reference

Grasshopper.Kernel.Expressions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com