---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_StateServer.htm
scraped_at: 2025-09-08T16:17:59.702073
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_StateServer Class](../html/T_Grasshopper_Kernel_GH_StateServer.htm
"GH_StateServer Class")

[GH_StateServer Constructor
](../html/M_Grasshopper_Kernel_GH_StateServer__ctor.htm "GH_StateServer
Constructor ")

[GH_StateServer
Properties](../html/Properties_T_Grasshopper_Kernel_GH_StateServer.htm
"GH_StateServer Properties")

[GH_StateServer
Methods](../html/Methods_T_Grasshopper_Kernel_GH_StateServer.htm
"GH_StateServer Methods")

!Click or drag to
resize

# GH_StateServer Class

---

Maintains all the recorded states for this document.

Inheritance Hierarchy

SystemObject
System.Collections.GenericListGH_State
Grasshopper.KernelGH_StateServer

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_StateServer : List<GH_State>,
    	GH_ISerializable

    Public Class GH_StateServer
    	Inherits List(Of GH_State)
    	Implements GH_ISerializable

The GH_StateServer type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_StateServer| Initializes a
new instance of the GH_StateServer class
Top

Properties

| Name| Description
---|---|---
|
Names|  Gets a list of all
the state names in this server.
|
Owner|  Gets the document
that owns this server.
Top

Methods

| Name| Description
---|---|---
|
NewStateFromDocument|
Displays UI for new state creation. If the user aborts, then null is returned.
If the user successfully defines a new state, it is appended to this server.
|
Read|
|
RemoveState|  Remove a
certain state. This method adds an undo record to the document.
| RestoreState(Int32, Int32,
Int32)|  Restore a
certain state.
| RestoreState(String, Int32,
Int32)|  Restore a
certain state.
| RestoreState(Int32, Boolean, Int32,
Int32)|  Restore a
certain state.
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com