---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_TreeFilter.htm
scraped_at: 2025-09-08T16:19:22.077582
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_TreeFilter Class](../html/T_Grasshopper_Kernel_Data_GH_TreeFilter.htm
"GH_TreeFilter Class")

[GH_TreeFilter Constructor
](../html/M_Grasshopper_Kernel_Data_GH_TreeFilter__ctor.htm "GH_TreeFilter
Constructor ")

[GH_TreeFilter
Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_TreeFilter.htm
"GH_TreeFilter Methods")

[GH_TreeFilter
Fields](../html/Fields_T_Grasshopper_Kernel_Data_GH_TreeFilter.htm
"GH_TreeFilter Fields")

!Click or drag to
resize

# GH_TreeFilter Class

---

Represents a collection of rules for validating DataTree paths and indices.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_TreeFilter

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_TreeFilter

    Public Class GH_TreeFilter

The GH_TreeFilter type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_TreeFilter|
Initializes a new instance of the GH_TreeFilter class
Top

Methods

| Name| Description
---|---|---
|
FindItemBrackets|
Locate the two parenthesis that delineate the index segment of an Index Rule
set.
|
FindNextLevelChar|
Find the next occurance of a char in a string that is level with the search
start index.
|
FindPathBrackets|
Locate the two curly brackets that delineate the path segment of an Index Rule
set.
|
FindPrevLevelChar|
Find the previous occurance of a char in a string that is level with the
search start index.
|
ParsePattern|
Parses a textual filter and returns an instance of the GH_TreeFilter. If the
filter cannot be parsed an exception will be thrown.
|
SplitStringWithExpressions|
Split a string into segments using level-aware split. This method throws
exceptions if the input string is not correctly formatted.
Top

Fields

| Name| Description
---|---|---
|
ItemClose|
|
ItemOpen|
|
PathClose|
|
PathOpen|
|
PathSeparator|
|
SegmentSeparator|
|
StringDelimeter|
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com