---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_AsynchFileData.htm
scraped_at: 2025-09-08T16:12:13.215796
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_AsynchFileData Class](../html/T_Grasshopper_GUI_GH_AsynchFileData.htm
"GH_AsynchFileData Class")

[GH_AsynchFileData Constructor
](../html/M_Grasshopper_GUI_GH_AsynchFileData__ctor.htm "GH_AsynchFileData
Constructor ")

[GH_AsynchFileData
Properties](../html/Properties_T_Grasshopper_GUI_GH_AsynchFileData.htm
"GH_AsynchFileData Properties")

[GH_AsynchFileData
Methods](../html/Methods_T_Grasshopper_GUI_GH_AsynchFileData.htm
"GH_AsynchFileData Methods")

[GH_AsynchFileData
Fields](../html/Fields_T_Grasshopper_GUI_GH_AsynchFileData.htm
"GH_AsynchFileData Fields")

!Click or drag to
resize

# GH_AsynchFileData Class

---

This class provides asynchronous methods to keep tabs on a file.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_AsynchFileData

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_AsynchFileData : IDisposable

    Public Class GH_AsynchFileData
    	Implements IDisposable

The GH_AsynchFileData type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_AsynchFileData|
Asynchronous constructor. File properties will be loaded asychronously.
Top

Properties

| Name| Description
---|---|---
|
Callback|  Gets or sets
the callback delegate to be used when properties are updated.
|
FileCreated|  Gets the
date at which the file was created.
|
FileExists|  Gets
whether the file exists. Note that this property returns false if
DataExists=False, regardless of whether the file exists.
|
FileLastChanged|
Gets the date at which the file was last changed.
|
FileSize|  Gets the size
of the file.
|
FileThumbnail|  Gets
the thumbnail bitmap associated with the file.
|
HarvestThumbnail|
Gets or sets whether the thumbnail ought to be parsed. At the moment this only
makes sense for GH/GHX files.
|
IsFileData|  Gets
whether the data has been retrieved at least once.
Top

Methods

| Name| Description
---|---|---
|
Dispose| Releases all
resources used by the GH_AsynchFileData
|
UpdateProperties|
Updates all file properties on the thread on which this method is called.
Top

Fields

| Name| Description
---|---|---
|
FilePath|  Gets the
location this instance is watching.
|
IsLocal|  Gets whether
Grasshopper thinks the file it is watching is on a local machine.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com