---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DocObjectEventArgs.htm
scraped_at: 2025-09-08T16:16:07.192786
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocObjectEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DocObjectEventArgs.htm
"GH_DocObjectEventArgs Class")

[GH_DocObjectEventArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_DocObjectEventArgs.htm
"GH_DocObjectEventArgs Properties")

!Click or drag to
resize

# GH_DocObjectEventArgs Class

---

These arguments are passed along with ObjectsAdded and ObjectsRemoved events
on GH_Document.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_DocObjectEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DocObjectEventArgs : EventArgs

    Public Class GH_DocObjectEventArgs
    	Inherits EventArgs

The GH_DocObjectEventArgs type exposes the following members.

Properties

| Name| Description
---|---|---
|
Attributes|  Gets
all the attributes that are associated with all objects in the event.
|
Document|  Gets the
document that raised the event.
|
Object|  Gets the
object to which this event pertains.
|
ObjectCount|
Gets the number of objects in this event.
|
Objects|  Gets a
readonly list of the objects to which this event pertains.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com