---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelContent_Attributes.htm
scraped_at: 2025-09-08T16:22:34.875051
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelContent.Attributes
Class](../html/T_Grasshopper_Rhinoceros_ModelContent_Attributes.htm
"ModelContent.Attributes Class")

[ModelContent.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_ModelContent_Attributes__ctor.htm
"ModelContent.Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelContent_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelContent_Attributes.htm
"Attributes Methods")

!Click or drag to
resize

# ModelContentAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
More...

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class Attributes : ModelDataAttributes,
    	IStructuralEquatable, IEquatable<ModelContentAttributes>

    Public MustInherit Class Attributes
    	Inherits ModelDataAttributes
    	Implements IStructuralEquatable, IEquatable(Of ModelContentAttributes)

The ModelContentAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelContentAttributes|
Initializes a new instance of the ModelContentAttributes class
Top

Properties

| Name| Description
---|---|---
|
Name|  The last
component of the element Path.
|
Notes|
|
Parent|  Path
of the parent element in 'Root::Parent' format if nested.
|
Path|  Full
content path in 'Root::Parent::Name' format if is nested.
|
Tags|
Top

Methods

| Name| Description
---|---|---
|
AsFrozen|
|
Clone|  (Inherited
from
ModelDataAttributes.)
!Static
member|
CloneOnWriteA|
|
Equals(Object)|
(Overrides
[ObjectEquals(Object)](https://docs.microsoft.com/dotnet/api/system.object.equals#system-
object-equals\(system-object\)).)
| Equals(Object,
IEqualityComparer)|
|
GetHashCode|
(Overrides
[ObjectGetHashCode](https://docs.microsoft.com/dotnet/api/system.object.gethashcode#system-
object-gethashcode).)
|
GetHashCode(IEqualityComparer)|
|
IsValidContentName|
|
Read|  (Overrides
ModelDataAttributesRead(GH_IReader).)
|
ReadData|
|
SubClone|
(Inherited from
ModelDataAttributes.)
|
ToDetails|
(Inherited from
ModelDataAttributes.)
|
ToModelData|
(Inherited from
ModelDataAttributes.)
|
ToString|
(Overrides
ModelDataAttributesToString.)
|
Write|
(Overrides
ModelDataAttributesWrite(GH_IWriter).)
|
WriteData|
Top

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
Grasshopper.Rhinoceros.DisplayModelDisplayModeAttributes
Grasshopper.Rhinoceros.DisplayModelNamedViewAttributes
Grasshopper.Rhinoceros.DisplayModelViewportAttributes
Grasshopper.Rhinoceros.ModelModelEarthAnchorPointAttributes
Grasshopper.RhinocerosModelComponentContentAttributes
Grasshopper.Rhinoceros.RenderModelRenderContentAttributes
Grasshopper.Rhinoceros.RenderModelRenderSkylightAttributes
Grasshopper.Rhinoceros.RenderModelRenderSunAttributes

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com