---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Brep.htm
scraped_at: 2025-09-08T16:20:21.347413
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Brep Class](../html/T_Grasshopper_Kernel_Types_GH_Brep.htm "GH_Brep
Class")

[GH_Brep Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Brep__ctor.htm "GH_Brep
Constructor ")

[GH_Brep Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Brep.htm
"GH_Brep Properties")

[GH_Brep Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Brep.htm
"GH_Brep Methods")

[GH_Brep Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Brep.htm
"GH_Brep Fields")

!Click or drag to
resize

# GH_Brep Class

---

Represents a 3D polysurface. GH_Brep wraps the functionality of the OpenNURBS
OnBrep class.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooBrep
Grasshopper.Kernel.TypesGH_GeometricGooBrep
Grasshopper.Kernel.TypesGH_Brep

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Brep : GH_GeometricGoo<Brep>,
    	IGH_BakeAwareData, IGH_PreviewData, IGH_PreviewMeshData, IGH_RenderAwareData

    Public Class GH_Brep
    	Inherits GH_GeometricGoo(Of Brep)
    	Implements IGH_BakeAwareData, IGH_PreviewData, IGH_PreviewMeshData, IGH_RenderAwareData

The GH_Brep type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Brep| Initializes a new
instance of the GH_Brep class
|
GH_Brep(Brep)| Initializes a
new instance of the GH_Brep class
|
GH_Brep(GH_Brep)|
Initializes a new instance of the GH_Brep class
|
GH_Brep(Guid)| Initializes a
new instance of the GH_Brep class
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|  (Overrides
GH_GeometricGooTBoundingbox.)
|
ClippingBox|
|
IsGeometryLoaded|
(Overrides
GH_GeometricGooTIsGeometryLoaded.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  (Overrides
GH_GeometricGooTIsValid.)
|
IsValidWhyNot|  Gets a
string describing the state of "invalidness". If the instance _is_ valid, then
this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
ReferenceID|  (Overrides
GH_GeometricGooTReferenceID.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  (Overrides
GH_GeometricGooTValue.)
Top

Methods

| Name| Description
---|---|---
|
AppendRenderGeometry|
|
BakeGeometry|
|
BrepTightBoundingBox|
Compute the boundingbox of a Brep object without meshing.
|
CastFrom|  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToT(T)|  (Overrides
GH_GeometricGooTCastToQ(Q).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
ClearCaches|  (Overrides
GH_GeometricGooTClearCaches.)
|
DestroyPreviewMeshes|
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|  (Overrides
GH_GeometricGooTDuplicate.)
|
DuplicateBrep|
|
DuplicateGeometry|
(Overrides
GH_GeometricGooTDuplicateGeometry.)
|
EmitProxy|  (Overrides
GH_GeometricGooTEmitProxy.)
|
GetBoundingBox|
(Overrides
GH_GeometricGooTGetBoundingBox(Transform).)
|
GetPreviewMeshes|
|
LoadGeometry|  If the
geometry is referenced and not yet loaded, attempts to load the geometry.
(Overrides
GH_GeometricGooTLoadGeometry.)
|
LoadGeometry(RhinoDoc)|
(Overrides
GH_GeometricGooTLoadGeometry(RhinoDoc).)
|
Morph|  (Overrides
GH_GeometricGooTMorph(SpaceMorph).)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Transform|  (Overrides
GH_GeometricGooTTransform(Transform).)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com