---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_EtoExtensions_EtoWin32Window.htm
scraped_at: 2025-09-08T16:11:44.075812
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper

[EtoExtensions.EtoWin32Window
Class](../html/T_Grasshopper_EtoExtensions_EtoWin32Window.htm
"EtoExtensions.EtoWin32Window Class")

[EtoWin32Window
Properties](../html/Properties_T_Grasshopper_EtoExtensions_EtoWin32Window.htm
"EtoWin32Window Properties")

[EtoWin32Window
Methods](../html/Methods_T_Grasshopper_EtoExtensions_EtoWin32Window.htm
"EtoWin32Window Methods")

!Click or drag to
resize

# EtoExtensionsEtoWin32Window Class

---

Inheritance Hierarchy

SystemObject
GrasshopperEtoExtensionsEtoWin32Window

**Namespace:** Grasshopper
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class EtoWin32Window : IWin32Window

    Public Class EtoWin32Window
    	Implements IWin32Window

The EtoExtensionsEtoWin32Window type exposes the following members.

Properties

| Name| Description
---|---|---
|
Handle|
Top

Extension Methods

| Name| Description
---|---|---
|
ToEtoWindow|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com