---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_ModelAnnotationStyle_Attributes.htm
scraped_at: 2025-09-08T16:23:04.016285
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations](../html/N_Grasshopper_Rhinoceros_Annotations.htm
"Grasshopper.Rhinoceros.Annotations")

[ModelAnnotationStyle.Attributes
Class](../html/T_Grasshopper_Rhinoceros_Annotations_ModelAnnotationStyle_Attributes.htm
"ModelAnnotationStyle.Attributes Class")

[ModelAnnotationStyle.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_Annotations_ModelAnnotationStyle_Attributes__ctor.htm
"ModelAnnotationStyle.Attributes Constructor ")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_ModelAnnotationStyle_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_ModelAnnotationStyle_Attributes.htm
"Attributes Methods")

[Attributes Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Annotations_ModelAnnotationStyle_Attributes.htm
"Attributes Type Conversions")

!Click or drag to
resize

# ModelAnnotationStyleAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.RhinocerosModelContentAttributes
Grasshopper.RhinocerosModelComponentContentAttributes
Grasshopper.Rhinoceros.AnnotationsModelAnnotationStyleAttributes

**Namespace:**
Grasshopper.Rhinoceros.Annotations
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Attributes : ModelComponentContentAttributes,
    	IEquatable<ModelAnnotationStyleAttributes>

    Public NotInheritable Class Attributes
    	Inherits ModelComponentContentAttributes
    	Implements IEquatable(Of ModelAnnotationStyleAttributes)

The ModelAnnotationStyleAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelAnnotationStyleAttributes|
Initializes a new instance of the ModelAnnotationStyleAttributes class
Top

Properties

| Name| Description
---|---|---
|
ArrowSettings|
|
DimensionScale|
|
DimensionSettings|
|
LeaderSettings|
|
Name|  The last
component of the element Path.  (Inherited from
ModelContentAttributes.)
|
Notes|
(Inherited from
ModelContentAttributes.)
|
Parent|  Path
of the parent element in 'Root::Parent' format if nested.  (Inherited from
ModelContentAttributes.)
|
Path|  Full
content path in 'Root::Parent::Name' format if is nested.  (Inherited from
ModelContentAttributes.)
|
Tags|  (Inherited
from
ModelContentAttributes.)
|
TextSettings|
|
ToleranceSettings|
|
UnitsSettings|
|
UserText|
(Inherited from
ModelComponentContentAttributes.)
Top

Methods

| Name| Description
---|---|---
|
Clone|  (Inherited
from
ModelDataAttributes.)
|
Equals(Object)|
(Inherited from
ModelContentAttributes.)
|
GetHashCode|
(Inherited from
ModelContentAttributes.)
|
ToDetails|
(Overrides
ModelComponentContentAttributesToDetails.)
|
ToModelData|
(Overrides
ModelDataAttributesToModelData.)
|
ToString|
(Inherited from
ModelContentAttributes.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (String to
ModelAnnotationStyleAttributes)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com