---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Model_ModelEarthAnchorPoint.htm
scraped_at: 2025-09-08T16:24:12.304968
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Model](../html/N_Grasshopper_Rhinoceros_Model.htm
"Grasshopper.Rhinoceros.Model")

[ModelEarthAnchorPoint
Class](../html/T_Grasshopper_Rhinoceros_Model_ModelEarthAnchorPoint.htm
"ModelEarthAnchorPoint Class")

[ModelEarthAnchorPoint Constructor
](../html/Overload_Grasshopper_Rhinoceros_Model_ModelEarthAnchorPoint__ctor.htm
"ModelEarthAnchorPoint Constructor ")

[ModelEarthAnchorPoint
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Model_ModelEarthAnchorPoint.htm
"ModelEarthAnchorPoint Properties")

[ModelEarthAnchorPoint
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Model_ModelEarthAnchorPoint.htm
"ModelEarthAnchorPoint Methods")

[ModelEarthAnchorPoint Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Model_ModelEarthAnchorPoint.htm
"ModelEarthAnchorPoint Type Conversions")

!Click or drag to
resize

# ModelEarthAnchorPoint Class

---

Represents a Rhino Earth anchor point. Wraps the functionality of the
EarthAnchorPoint type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.Rhinoceros.ModelModelEarthAnchorPoint

**Namespace:**
Grasshopper.Rhinoceros.Model
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelEarthAnchorPoint : ModelContent,
    	IGH_BakeAwareData

    Public NotInheritable Class ModelEarthAnchorPoint
    	Inherits ModelContent
    	Implements IGH_BakeAwareData

The ModelEarthAnchorPoint type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelEarthAnchorPoint|
Initializes a new instance of the ModelEarthAnchorPoint class
|
ModelEarthAnchorPoint(ModelEarthAnchorPointAttributes)|
Initializes a new instance of the ModelEarthAnchorPoint class
|
ModelEarthAnchorPoint(EarthAnchorPoint)|
Initializes a new instance of the ModelEarthAnchorPoint class
Top

Properties

| Name| Description
---|---|---
|
Elevation|
Gets a point elevation on earth, in meters.
|
ElevationCoordinateSystem|
Gets the value indicating the zero level convention relating to a location on
Earth
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
Latitude|
Gets a point latitude on earth, in degrees. [-90, +90]
|
Longitude|
Gets a point longitude on earth, in degrees. [-180, +180]
|
ModelCompass|
Gets the corresponding compass plane in model coordinates
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelContentCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Overrides
ModelContentTooltipString.)
|
ToString|
(Overrides
ModelContentToString.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelEarthAnchorPointAttributes to
ModelEarthAnchorPoint)|
!Static
member| (EarthAnchorPoint to
ModelEarthAnchorPoint)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Model Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com