---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_GooProxy_1.htm
scraped_at: 2025-09-08T16:20:44.428731
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_GooProxy(T) Class](../html/T_Grasshopper_Kernel_Types_GH_GooProxy_1.htm
"GH_GooProxy\(T\) Class")

[GH_GooProxy(T) Constructor
](../html/M_Grasshopper_Kernel_Types_GH_GooProxy_1__ctor.htm "GH_GooProxy\(T\)
Constructor ")

[GH_GooProxy(T)
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_GooProxy_1.htm
"GH_GooProxy\(T\) Properties")

[GH_GooProxy(T)
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_GooProxy_1.htm
"GH_GooProxy\(T\) Methods")

!Click or drag to
resize

# GH_GooProxyT Class

---

Abstract base implementation of IGH_GooProxy

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyT
More...

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_GooProxy<T> : IGH_GooProxy
    where T : IGH_Goo

    Public MustInherit Class GH_GooProxy(Of T As IGH_Goo)
    	Implements IGH_GooProxy

#### Type Parameters

T

The GH_GooProxyT type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_GooProxyT|
Initializes a new instance of the GH_GooProxyT class
Top

Properties

| Name| Description
---|---|---
|
TypeDescription|
|
TypeName|
|
Valid|  Gets a value
indicating whether this proxy represents valid data.
Top

Methods

| Name| Description
---|---|---
|
Construct|  Override
this method to supply a custom UI during proxy construction.
|
FormatInstance|
Returns a String description of the current value.
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
|
MutateString|
Munge a string to remove obvious errors on account of the user.
|
NumberToString|
|
StringToNumber|
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyT
Grasshopper.Kernel.TypesGH_AnnotationBaseGH_AnnotationBaseProxyT
Grasshopper.Kernel.TypesGH_BoxGH_BoxProxy
Grasshopper.Kernel.TypesGH_BrepGH_BrepProxy
Grasshopper.Kernel.TypesGH_CircleGH_CircleProxy
Grasshopper.Kernel.TypesGH_CurveGH_CurveProxy
Grasshopper.Kernel.TypesGH_ExtrusionGH_ExtrusionProxy
Grasshopper.Kernel.TypesGH_GeometryGroupGH_GeometryGroupProxy
Grasshopper.Kernel.TypesGH_HatchGH_HatchProxy
Grasshopper.Kernel.TypesGH_InstanceReferenceGH_InstanceReferenceProxy
Grasshopper.Kernel.TypesGH_Interval2DGH_Interval2DProxy
Grasshopper.Kernel.TypesGH_LineGH_LineProxy
Grasshopper.Kernel.TypesGH_MaterialGH_Material_Proxy
Grasshopper.Kernel.TypesGH_MeshGH_MeshProxy
Grasshopper.Kernel.TypesGH_MeshFaceGH_MeshFaceProxy
Grasshopper.Kernel.TypesGH_MeshingParametersRhMesherSettings_Proxy
Grasshopper.Kernel.TypesGH_PlaneGH_PlaneProxy
Grasshopper.Kernel.TypesGH_PointGH_PointProxy
Grasshopper.Kernel.TypesGH_PointCloudPointCloudProxy
Grasshopper.Kernel.TypesGH_RectangleGH_RectangleProxy
Grasshopper.Kernel.TypesGH_SubDGH_SubDProxy
Grasshopper.Kernel.TypesGH_SurfaceGH_SurfaceProxy
Grasshopper.Kernel.TypesGH_TextDotGH_TextDotProxy
Grasshopper.Kernel.TypesGH_VectorGH_VectorProxy

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com