---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Box_GH_BoxProxy.htm
scraped_at: 2025-09-08T16:20:20.327130
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Box.GH_BoxProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Box_GH_BoxProxy.htm
"GH_Box.GH_BoxProxy Class")

[GH_Box.GH_BoxProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Box_GH_BoxProxy__ctor.htm
"GH_Box.GH_BoxProxy Constructor ")

[GH_BoxProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Box_GH_BoxProxy.htm
"GH_BoxProxy Properties")

[GH_BoxProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Box_GH_BoxProxy.htm
"GH_BoxProxy Methods")

!Click or drag to
resize

# GH_BoxGH_BoxProxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Box
Grasshopper.Kernel.TypesGH_BoxGH_BoxProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_BoxProxy : GH_GooProxy<GH_Box>

    Public Class GH_BoxProxy
    	Inherits GH_GooProxy(Of GH_Box)

The GH_BoxGH_BoxProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_BoxGH_BoxProxy|
Initializes a new instance of the GH_BoxGH_BoxProxy class
Top

Properties

| Name| Description
---|---|---
|
Area|
|
ObjectID|
|
Origin|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
|
Volume|
|
XAxis|
|
XSize|
|
YAxis|
|
YSize|
|
ZAxis|
|
ZSize|
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com