---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Model_ModelInstanceDefinition.htm
scraped_at: 2025-09-08T16:24:14.305358
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Model](../html/N_Grasshopper_Rhinoceros_Model.htm
"Grasshopper.Rhinoceros.Model")

[ModelInstanceDefinition
Class](../html/T_Grasshopper_Rhinoceros_Model_ModelInstanceDefinition.htm
"ModelInstanceDefinition Class")

[ModelInstanceDefinition Constructor
](../html/Overload_Grasshopper_Rhinoceros_Model_ModelInstanceDefinition__ctor.htm
"ModelInstanceDefinition Constructor ")

[ModelInstanceDefinition
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Model_ModelInstanceDefinition.htm
"ModelInstanceDefinition Properties")

[ModelInstanceDefinition
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Model_ModelInstanceDefinition.htm
"ModelInstanceDefinition Methods")

[ModelInstanceDefinition Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Model_ModelInstanceDefinition.htm
"ModelInstanceDefinition Type Conversions")

!Click or drag to
resize

# ModelInstanceDefinition Class

---

Represents a Rhino block definition. Wraps the functionality of the
InstanceDefinition type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.RhinocerosModelComponentContent
Grasshopper.Rhinoceros.ModelModelInstanceDefinition

**Namespace:**
Grasshopper.Rhinoceros.Model
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelInstanceDefinition : ModelComponentContent,
    	IGH_BakeAwareData, IGH_PreviewData

    Public NotInheritable Class ModelInstanceDefinition
    	Inherits ModelComponentContent
    	Implements IGH_BakeAwareData, IGH_PreviewData

The ModelInstanceDefinition type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelInstanceDefinition|
Initializes a new instance of the ModelInstanceDefinition class
|
ModelInstanceDefinition(ModelInstanceDefinitionAttributes)|
Initializes a new instance of the ModelInstanceDefinition class
|
ModelInstanceDefinition(Guid)|
Initializes a new instance of the ModelInstanceDefinition class
|
ModelInstanceDefinition(InstanceDefinition)|
Initializes a new instance of the ModelInstanceDefinition class
Top

Properties

| Name| Description
---|---|---
|
FilePath|
|
Id|  (Inherited from
ModelContent.)
|
IsValid|
(Overrides
ModelContentIsValid.)
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Objects|
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
!Static
member|
Unset|
|
UpdateType|
|
Url|
|
UrlDescription|
|
UserText|
(Inherited from
ModelComponentContent.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
|
Cast|
|
CastToT(T)|
(Overrides
ModelContentCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetBoundingBox|
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelInstanceDefinitionAttributes to
ModelInstanceDefinition)|
!Static
member| (InstanceDefinition to
ModelInstanceDefinition)|
!Static
member| (String to
ModelInstanceDefinition)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Model Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com