---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Base_GH_SliderBase.htm
scraped_at: 2025-09-08T16:13:46.682944
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Base](../html/N_Grasshopper_GUI_Base.htm
"Grasshopper.GUI.Base")

[GH_SliderBase Class](../html/T_Grasshopper_GUI_Base_GH_SliderBase.htm
"GH_SliderBase Class")

[GH_SliderBase Constructor
](../html/M_Grasshopper_GUI_Base_GH_SliderBase__ctor.htm "GH_SliderBase
Constructor ")

[GH_SliderBase
Properties](../html/Properties_T_Grasshopper_GUI_Base_GH_SliderBase.htm
"GH_SliderBase Properties")

[GH_SliderBase
Methods](../html/Methods_T_Grasshopper_GUI_Base_GH_SliderBase.htm
"GH_SliderBase Methods")

[GH_SliderBase Events](../html/Events_T_Grasshopper_GUI_Base_GH_SliderBase.htm
"GH_SliderBase Events")

!Click or drag to
resize

# GH_SliderBase Class

---

Provides Numeric slider GUI not tied to a control-handle.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.BaseGH_TextBoxInputBase
Grasshopper.GUI.BaseGH_SliderBase

**Namespace:** Grasshopper.GUI.Base
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_SliderBase : GH_TextBoxInputBase

    Public Class GH_SliderBase
    	Inherits GH_TextBoxInputBase

The GH_SliderBase type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_SliderBase| Initializes a
new instance of the GH_SliderBase class
Top

Properties

| Name| Description
---|---|---
|
Bounds|  Gets or sets the
bounds of the slider.  (Overrides GH_TextBoxInputBase.Bounds.)
|
ControlBackColour|
Gets or sets the BackColour for this slider control.
|
ControlEdgeColour|
Gets or sets the EdgeColor for this slider control.
|
ControlShadowColour|
Gets or sets the Shadow colour for this control.
|
DecimalPlaces|  Gets
or sets the number of decimal places allowed for floating point type sliders.
Valid values between zero and 12.
|
DrawControlBackground|
Gets or sets whether the background of the slider should be drawn.
|
DrawControlBorder|
Gets or sets whether the border of the slider should be drawn.
|
DrawControlShadows|
Gets or sets whether the drop shadows of the slider should be drawn.
|
Epsilon|  Gets the
smallest value change supported by the current slider properties.
|
Font|  Gets or sets the font
for this slider.  (Overrides
GH_TextBoxInputBaseFont.)
|
FormatMask|  Gets or
sets the string format mask to use for the display. Should contain at least
one "{0}" element.
|
Grip|  Gets the box of the
current grip. If the slider value/limits are not set up correctly then this
rectangle may well be outside of the bounds. If the limits are coincident,
this will fail (divide by zero).
|
GripBottomColour|
Gets or sets the fill colour for the bottom edge of the slider grip.
|
GripDisplay|  Gets or
sets how the slider grip (or thumb) is drawn.
|
GripEdgeColour|
Gets or sets the edge colour for the slider grip.
|
GripText|  Gets the text
that will be drawn on the slider.
|
GripTopColour|  Gets
or sets the fill colour for the top edge of the slider grip.
|
GripWidth|  Gets an
estimate of the maximum number of pixels taken up by the grip. This property
depends on many different factors, though should remain constant when other
properties are not changed. If the Font hasn't been specified, the default
Windows.Forms.Control font is used.
|
IsTextInput|
Gets whether the text input box is currently on screen.  (Inherited from
GH_TextBoxInputBase.)
|
Maximum|  Gets or sets the
upper limit of the slider.
|
Minimum|  Gets or sets the
lower limit of the slider.
|
NormalizedValue|
Gets or sets the normalized value within the slider domain.
|
Padding|  Gets or sets the
padding around the slider border.
|
Rail|  Gets the shape of the
rail. The height of the rectangle will be zero, but the y-position will be
rounded to integer precision.
|
RailBrightColour|
Gets or sets the bright colour used to draw rails and ticks.
|
RailDarkColour|
Gets or sets the dark colour used to draw rails and ticks.
|
RailDisplay|  Gets or
sets how the slider rail (or track) is drawn.
|
RailEmptyColour|
Gets or sets the fill colour for the empty portion of the rail.
|
RailFullColour|
Gets or sets the fill colour for the full portion of the rail.
|
RaiseEvents|  Gets or
sets a value indicating whether this slider raises the ValueChanged event.
|
ShadowSize|  Gets or
sets the size of the border shadow along all edges of the box.
|
SnapDistance|  Gets
or sets the snap distance in absolute values.
|
TextColour|  Gets or
sets the fill colour for the slider text.
|
TextInputHandlerDelegate|
Gets or sets the custom handler for text input. If you do not set a custom
handler the default behaviour will be used.
|
TickCount|  Gets or sets
the number of ticks displayed.
|
TickDisplay|  Gets or
sets how the slider ticks are drawn.
|
TickFrequency|  Gets
or sets the frequency of large ticks vs small ticks.
|
Ticks|  Gets a list of all
the tick offset x positions.
|
Type|  Gets or sets the
accuracy type of the slider.
|
Value|  Gets or sets the
value of the slider.
|
ValueF|  Gets or sets the
value of the slider in single precision.
Top

Methods

| Name| Description
---|---|---
|
FixDomain|  Fix the
limits of the slider. Limits will be rounded according to slider type and
accuracy. Also, a minimum range for all types is ensured.
|
FixValue|  Fix the value
of the slider. The value will be rounded according to slider type and
accuracy. Also, the value will be clipped to the limits. Before you call this
function, ensure the limits are set up correctly.
|
HandleTextInputAccepted|
(Overrides
GH_TextBoxInputBaseHandleTextInputAccepted(String).)
|
HideTextInputBox|
Hides the text-input override form (if it is displayed).  (Inherited from
GH_TextBoxInputBase.)
|
KeyDown|  Respond to a
KeyDown event.
|
MouseDown|  Respond to
mouse-down events.
|
MouseMove|  Respond to
mouse-move events.
|
MouseUp|  Respond to
mouse-up events.
|
OnValueChanged|
Raise the ValueChanged event.
|
ProcessNumber|
Process a number using the given slider characteristics.
|
Render|  Render this slider
into a Graphics context.
|
RespondToEnter|
(Inherited from
GH_TextBoxInputBase.)
|
RespondToEscape|
(Inherited from
GH_TextBoxInputBase.)
|
SetSnapRanges|
Assign a collection of snap ranges to this slider.
|
ShowTextInputBox(Control)|
| ShowTextInputBox(Control,
Boolean)|
| ShowTextInputBox(Control, Boolean,
Matrix)|
| ShowTextInputBox(Control, String,
Boolean)|
Display a floating text-box on top of the owner control.  (Inherited from
GH_TextBoxInputBase.)
| ShowTextInputBox(Control, Boolean,
Matrix, String)|
| ShowTextInputBox(Control, String,
Boolean,
Boolean)|
Display a floating text-box on top of the owner control.  (Inherited from
GH_TextBoxInputBase.)
| ShowTextInputBox(Control, String,
Boolean, Boolean,
Matrix)|
Display a floating text-box on top of the owner control.  (Inherited from
GH_TextBoxInputBase.)
Top

Events

| Name| Description
---|---|---
|
ValueChanged|  Raised
whenever the value of this slider is changed due to User-Interface methods.
Top

See Also

#### Reference

Grasshopper.GUI.Base Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com