---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingColor.htm
scraped_at: 2025-09-08T16:23:56.210542
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Drafting](../html/N_Grasshopper_Rhinoceros_Drafting.htm
"Grasshopper.Rhinoceros.Drafting")

[ObjectDraftingColor
Class](../html/T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingColor.htm
"ObjectDraftingColor Class")

[ObjectDraftingColor Constructor
](../html/Overload_Grasshopper_Rhinoceros_Drafting_ObjectDraftingColor__ctor.htm
"ObjectDraftingColor Constructor ")

[ObjectDraftingColor
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingColor.htm
"ObjectDraftingColor Properties")

[ObjectDraftingColor
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingColor.htm
"ObjectDraftingColor Methods")

[ObjectDraftingColor Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingColor.htm
"ObjectDraftingColor Type Conversions")

!Click or drag to
resize

# ObjectDraftingColor Class

---

Represents a Rhino object drafting color.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.Rhinoceros.DraftingObjectDraftingColor

**Namespace:**
Grasshopper.Rhinoceros.Drafting
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ObjectDraftingColor : ModelValue

    Public NotInheritable Class ObjectDraftingColor
    	Inherits ModelValue

The ObjectDraftingColor type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectDraftingColor|
Initializes a new instance of the ObjectDraftingColor class
|
ObjectDraftingColor(ObjectDraftingColorValue)|
Initializes a new instance of the ObjectDraftingColor class
Top

Properties

| Name| Description
---|---|---
|
Color|
|
Source|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelValueCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelValue.)
|
Equals(ModelValue)|
(Inherited from ModelValue.)
|
Equals(Object)|
(Overrides
ModelValueEquals(Object).)
|
GetHashCode|
(Overrides
ModelValueGetHashCode.)
|
ToAttributes|
|
TooltipString|
(Inherited from ModelValue.)
|
ToString|  (Inherited from
ModelValue.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ObjectDraftingColor to
ObjectDraftingColorValue)|
!Static
member| (ObjectDraftingColorValue to
ObjectDraftingColor)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Drafting
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com