---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Documentation_GH_Topic.htm
scraped_at: 2025-09-08T16:12:06.173166
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Documentation](../html/N_Grasshopper_Documentation.htm
"Grasshopper.Documentation")

[GH_Topic Class](../html/T_Grasshopper_Documentation_GH_Topic.htm "GH_Topic
Class")

[GH_Topic
Properties](../html/Properties_T_Grasshopper_Documentation_GH_Topic.htm
"GH_Topic Properties")

[GH_Topic Methods](../html/Methods_T_Grasshopper_Documentation_GH_Topic.htm
"GH_Topic Methods")

!Click or drag to
resize

# GH_Topic Class

---

Represents a single topic in the Grasshopper help.

Inheritance Hierarchy

SystemObject
Grasshopper.DocumentationGH_Topic

**Namespace:** Grasshopper.Documentation
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Topic

    Public Class GH_Topic

The GH_Topic type exposes the following members.

Properties

| Name| Description
---|---|---
|
Description|
|
SafeDescription|
Top

Methods

| Name| Description
---|---|---
|
ParseFile|  Parse a
*.topic file and return a topic entry.
Top

See Also

#### Reference

Grasshopper.Documentation Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com