---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_Transforms_Scale.htm
scraped_at: 2025-09-08T16:21:56.708772
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types.Transforms](../html/N_Grasshopper_Kernel_Types_Transforms.htm
"Grasshopper.Kernel.Types.Transforms")

[Scale Class](../html/T_Grasshopper_Kernel_Types_Transforms_Scale.htm "Scale
Class")

[Scale Constructor
](../html/Overload_Grasshopper_Kernel_Types_Transforms_Scale__ctor.htm "Scale
Constructor ")

[Scale
Properties](../html/Properties_T_Grasshopper_Kernel_Types_Transforms_Scale.htm
"Scale Properties")

[Scale
Methods](../html/Methods_T_Grasshopper_Kernel_Types_Transforms_Scale.htm
"Scale Methods")

!Click or drag to
resize

# Scale Class

---

Implements a scaling transformation.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.Types.TransformsScale

**Namespace:**
Grasshopper.Kernel.Types.Transforms
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class Scale : ITransform

    Public Class Scale
    	Implements ITransform

The Scale type exposes the following members.

Constructors

| Name| Description
---|---|---
|
Scale| Initializes a
new instance of the Scale class
| Scale(Plane,
Double)| Initializes
a new instance of the Scale class
| Scale(Point3d,
Double)| Initializes
a new instance of the Scale class
| Scale(Plane, Double, Double,
Double)| Initializes
a new instance of the Scale class
Top

Properties

| Name| Description
---|---|---
|
Name|
|
ScaleXFactor|
|
ScaleYFactor|
|
ScaleZFactor|
|
ScalingFrame|
Top

Methods

| Name| Description
---|---|---
|
Duplicate|
|
Read|
|
Reverse|
|
ToMatrix|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types.Transforms
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com