---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Documentation_GH_Format.htm
scraped_at: 2025-09-08T16:11:56.131307
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Documentation](../html/N_Grasshopper_Documentation.htm
"Grasshopper.Documentation")

[GH_Format Class](../html/T_Grasshopper_Documentation_GH_Format.htm "GH_Format
Class")

[GH_Format
Properties](../html/Properties_T_Grasshopper_Documentation_GH_Format.htm
"GH_Format Properties")

[GH_Format Methods](../html/Methods_T_Grasshopper_Documentation_GH_Format.htm
"GH_Format Methods")

!Click or drag to
resize

# GH_Format Class

---

Represents a piece of formatted content.

Inheritance Hierarchy

SystemObject
Grasshopper.DocumentationGH_Format

**Namespace:** Grasshopper.Documentation
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Format : IGH_Content

    Public Class GH_Format
    	Implements IGH_Content

The GH_Format type exposes the following members.

Properties

| Name| Description
---|---|---
|
Content|
|
Style|
Top

Methods

| Name| Description
---|---|---
|
Create(IGH_Content,
GH_Style)|
|
Create(String,
GH_Style)|
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

See Also

#### Reference

Grasshopper.Documentation Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com