---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Expressions_GH_ScriptVariant.htm
scraped_at: 2025-09-08T16:19:42.175368
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Expressions](../html/N_Grasshopper_Kernel_Expressions.htm
"Grasshopper.Kernel.Expressions")

[GH_ScriptVariant
Class](../html/T_Grasshopper_Kernel_Expressions_GH_ScriptVariant.htm
"GH_ScriptVariant Class")

[GH_ScriptVariant Constructor
](../html/Overload_Grasshopper_Kernel_Expressions_GH_ScriptVariant__ctor.htm
"GH_ScriptVariant Constructor ")

[GH_ScriptVariant
Properties](../html/Properties_T_Grasshopper_Kernel_Expressions_GH_ScriptVariant.htm
"GH_ScriptVariant Properties")

[GH_ScriptVariant
Methods](../html/Methods_T_Grasshopper_Kernel_Expressions_GH_ScriptVariant.htm
"GH_ScriptVariant Methods")

[GH_ScriptVariant Operators and Type
Conversions](../html/Operators_T_Grasshopper_Kernel_Expressions_GH_ScriptVariant.htm
"GH_ScriptVariant Operators and Type Conversions")

[GH_ScriptVariant
Fields](../html/Fields_T_Grasshopper_Kernel_Expressions_GH_ScriptVariant.htm
"GH_ScriptVariant Fields")

!Click or drag to
resize

# GH_ScriptVariant Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.ExpressionsGH_ScriptVariant

**Namespace:**
Grasshopper.Kernel.Expressions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ScriptVariant

    Public Class GH_ScriptVariant

The GH_ScriptVariant type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ScriptVariant|
Initializes a new instance of the GH_ScriptVariant class
|
GH_ScriptVariant(Boolean)|
Initializes a new instance of the GH_ScriptVariant class
|
GH_ScriptVariant(Byte)|
Initializes a new instance of the GH_ScriptVariant class
|
GH_ScriptVariant(DateTime)|
Initializes a new instance of the GH_ScriptVariant class
|
GH_ScriptVariant(Double)|
Initializes a new instance of the GH_ScriptVariant class
|
GH_ScriptVariant(Int32)|
Initializes a new instance of the GH_ScriptVariant class
|
GH_ScriptVariant(Plane)|
Initializes a new instance of the GH_ScriptVariant class
|
GH_ScriptVariant(Point3d)|
Initializes a new instance of the GH_ScriptVariant class
|
GH_ScriptVariant(String)|
Initializes a new instance of the GH_ScriptVariant class
|
GH_ScriptVariant(Vector3d)|
Initializes a new instance of the GH_ScriptVariant class
Top

Properties

| Name| Description
---|---|---
|
Boolean|
|
DateTime|
|
Double|
|
Integer|
|
Object|
|
Plane|
|
Point|
|
String|
|
Type|
|
Vector|
Top

Methods

| Name| Description
---|---|---
!Static
member|
ThrowNullOperatorException|
!Static
member| ThrowOperatorException(String,
GH_ScriptVariantType)|
!Static
member| ThrowOperatorException(String,
String)|
!Static
member| ThrowOperatorException(String,
GH_ScriptVariantType,
GH_ScriptVariantType)|
!Static
member| ThrowOperatorException(String, String,
String)|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

Operators

| Name| Description
---|---|---
!Static
member|
Addition|
!Static
member|
BitwiseAnd|
!Static
member|
BitwiseOr|
!Static
member|
Concatenate|
!Static
member|
Division|
!Static
member|
Equality|
!Static
member|
ExclusiveOr|
!Static
member| (GH_ScriptVariant to
Plane)|
!Static
member| (GH_ScriptVariant to
Point3d)|
!Static
member| (GH_ScriptVariant to
Vector3d)|
!Static
member| (GH_ScriptVariant to
Boolean)|
!Static
member| (GH_ScriptVariant to
DateTime)|
!Static
member| (GH_ScriptVariant to
Double)|
!Static
member| (GH_ScriptVariant to
Int32)|
!Static
member| (GH_ScriptVariant to
String)|
!Static
member|
Exponent|
!Static
member|
False|
!Static
member|
GreaterThan|
!Static
member|
GreaterThanOrEqual|
!Static
member| (Boolean to
GH_ScriptVariant)|
!Static
member| (DateTime to
GH_ScriptVariant)|
!Static
member| (Double to
GH_ScriptVariant)|
!Static
member| (Int32 to
GH_ScriptVariant)|
!Static
member| (Plane to
GH_ScriptVariant)|
!Static
member| (Point3d to
GH_ScriptVariant)|
!Static
member| (String to
GH_ScriptVariant)|
!Static
member| (Vector3d to
GH_ScriptVariant)|
!Static
member|
Inequality|
!Static
member|
IntegerDivision|
!Static
member|
LeftShift|
!Static
member|
LessThan|
!Static
member|
LessThanOrEqual|
!Static
member|
Modulus|
!Static
member|
Multiply|
!Static
member|
OnesComplement|
!Static
member|
RightShift|
!Static
member|
Subtraction|
!Static
member|
True|
!Static
member|
UnaryNegation|
!Static
member|
UnaryPlus|
Top

Fields

| Name| Description
---|---|---
|
m_type|
|
m_value|
Top

See Also

#### Reference

Grasshopper.Kernel.Expressions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com