---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_AttributesChangedEventArgs.htm
scraped_at: 2025-09-08T16:15:25.028940
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_AttributesChangedEventArgs
Class](../html/T_Grasshopper_Kernel_GH_AttributesChangedEventArgs.htm
"GH_AttributesChangedEventArgs Class")

[GH_AttributesChangedEventArgs Constructor
](../html/M_Grasshopper_Kernel_GH_AttributesChangedEventArgs__ctor.htm
"GH_AttributesChangedEventArgs Constructor ")

!Click or drag to
resize

# GH_AttributesChangedEventArgs Class

---

Event arguments passed during AttributesChanged events.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_AttributesChangedEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_AttributesChangedEventArgs : EventArgs

    Public Class GH_AttributesChangedEventArgs
    	Inherits EventArgs

The GH_AttributesChangedEventArgs type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_AttributesChangedEventArgs|
Initializes a new instance of the GH_AttributesChangedEventArgs class
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com