---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Render_ModelRenderTexture.htm
scraped_at: 2025-09-08T16:24:45.436388
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Render](../html/N_Grasshopper_Rhinoceros_Render.htm
"Grasshopper.Rhinoceros.Render")

[ModelRenderTexture
Class](../html/T_Grasshopper_Rhinoceros_Render_ModelRenderTexture.htm
"ModelRenderTexture Class")

[ModelRenderTexture Constructor
](../html/Overload_Grasshopper_Rhinoceros_Render_ModelRenderTexture__ctor.htm
"ModelRenderTexture Constructor ")

[ModelRenderTexture
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Render_ModelRenderTexture.htm
"ModelRenderTexture Properties")

[ModelRenderTexture
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Render_ModelRenderTexture.htm
"ModelRenderTexture Methods")

[ModelRenderTexture Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Render_ModelRenderTexture.htm
"ModelRenderTexture Type Conversions")

!Click or drag to
resize

# ModelRenderTexture Class

---

Represents a Rhino render texture. Wraps the functionality of the
RenderTexture type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.Rhinoceros.RenderModelRenderContent
Grasshopper.Rhinoceros.RenderModelRenderTexture

**Namespace:**
Grasshopper.Rhinoceros.Render
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelRenderTexture : ModelRenderContent,
    	IGH_BakeAwareData

    Public NotInheritable Class ModelRenderTexture
    	Inherits ModelRenderContent
    	Implements IGH_BakeAwareData

The ModelRenderTexture type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelRenderTexture|
Initializes a new instance of the ModelRenderTexture class
|
ModelRenderTexture(ModelRenderTextureAttributes)|
Initializes a new instance of the ModelRenderTexture class
|
ModelRenderTexture(Guid)|
Initializes a new instance of the ModelRenderTexture class
|
ModelRenderTexture(RenderTexture)|
Initializes a new instance of the ModelRenderTexture class
Top

Properties

| Name| Description
---|---|---
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
|
TypeName|
(Overrides
ModelRenderContentTypeName.)
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
CastToT(T)|
(Overrides
ModelContentCastToT(T).)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelRenderTextureAttributes to
ModelRenderTexture)|
!Static
member| (ColorRGBA to
ModelRenderTexture)|
!Static
member| (RenderTexture to
ModelRenderTexture)|
!Static
member| (String to
ModelRenderTexture)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Render Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com