---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_Border.htm
scraped_at: 2025-09-08T16:13:57.657466
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_Border Class](../html/T_Grasshopper_GUI_Canvas_GH_Border.htm "GH_Border
Class")

[GH_Border Constructor ](../html/M_Grasshopper_GUI_Canvas_GH_Border__ctor.htm
"GH_Border Constructor ")

[GH_Border
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_GH_Border.htm
"GH_Border Properties")

[GH_Border Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_Border.htm
"GH_Border Methods")

!Click or drag to
resize

# GH_Border Class

---

Represents a resizing border of a Grasshopper canvas object.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_Border
Grasshopper.GUI.CanvasGH_ResizeBorder

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Border

    Public Class GH_Border

The GH_Border type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Border|  Create a new
border.
Top

Properties

| Name| Description
---|---|---
|
Region|  Gets the shape of
the border.
|
Size_Cursor|  Gets the
cursor associated with this border.
|
Topology|  Gets the type of
border.
Top

Methods

| Name| Description
---|---|---
|
Contains|  Test a point for
border inclusion.
|
CreateBorders(RectangleF,
Int32)|  Static
(Shared) method for creating a set of borders.
|
CreateBorders(RectangleF,
Padding)|  Static
(Shared) method for creating a set of borders.
|
CreateBorders(RectangleF, Int32,
Int32)|  Static
(Shared) method for creating a set of borders.
|
CreateBorders(RectangleF, Int32, Int32, Int32,
Int32)|  Static
(Shared) method for creating a set of borders.
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com