---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelValue.htm
scraped_at: 2025-09-08T16:22:45.922295
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelValue Class](../html/T_Grasshopper_Rhinoceros_ModelValue.htm "ModelValue
Class")

[ModelValue
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelValue.htm
"ModelValue Properties")

[ModelValue Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelValue.htm
"ModelValue Methods")

!Click or drag to
resize

# ModelValue Class

---

Represents a value in a Rhino model.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
More...

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class ModelValue : IGH_ModelData,
    	ICloneable, IEquatable<ModelValue>

    Public MustInherit Class ModelValue
    	Implements IGH_ModelData, ICloneable, IEquatable(Of ModelValue)

The ModelValue type exposes the following members.

Properties

| Name| Description
---|---|---
|
IsValidWhyNot|
|
TypeDescription|
Top

Methods

| Name| Description
---|---|---
|
CastToT|
|
Clone|
|
Equals(ModelValue)|
|
Equals(Object)|
(Overrides
[ObjectEquals(Object)](https://docs.microsoft.com/dotnet/api/system.object.equals#system-
object-equals\(system-object\)).)
|
GetHashCode|
(Overrides
[ObjectGetHashCode](https://docs.microsoft.com/dotnet/api/system.object.gethashcode#system-
object-gethashcode).)
|
Read|
!Static
member|
ReadValueT|
|
ScriptVariable|
|
TooltipString|
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|
!Static
member|
WriteValueT|
Top

Remarks

This type is the base type of a family of immutable types.

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.Rhinoceros.DisplayObjectDisplay
Grasshopper.Rhinoceros.DisplayObjectDisplayColor
Grasshopper.Rhinoceros.DisplayObjectVisibility
Grasshopper.Rhinoceros.DraftingModelHatchLine
Grasshopper.Rhinoceros.DraftingObjectDrafting
Grasshopper.Rhinoceros.DraftingObjectDraftingColor
Grasshopper.Rhinoceros.DraftingObjectDraftingLinetype
Grasshopper.Rhinoceros.DraftingObjectDraftingLineWidth
Grasshopper.RhinocerosModelMeshingParameters
Grasshopper.RhinocerosModelUnitSystem
Grasshopper.Rhinoceros.RenderObjectRender
Grasshopper.Rhinoceros.RenderObjectRenderMaterial

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com