---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_FadeAnimation.htm
scraped_at: 2025-09-08T16:12:33.283643
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_FadeAnimation Class](../html/T_Grasshopper_GUI_GH_FadeAnimation.htm
"GH_FadeAnimation Class")

[GH_FadeAnimation Constructor
](../html/Overload_Grasshopper_GUI_GH_FadeAnimation__ctor.htm
"GH_FadeAnimation Constructor ")

[GH_FadeAnimation
Properties](../html/Properties_T_Grasshopper_GUI_GH_FadeAnimation.htm
"GH_FadeAnimation Properties")

[GH_FadeAnimation
Methods](../html/Methods_T_Grasshopper_GUI_GH_FadeAnimation.htm
"GH_FadeAnimation Methods")

[GH_FadeAnimation
Fields](../html/Fields_T_Grasshopper_GUI_GH_FadeAnimation.htm
"GH_FadeAnimation Fields")

!Click or drag to
resize

# GH_FadeAnimation Class

---

Utility class for animating fade ZUI events on the canvas.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_FadeAnimation

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_FadeAnimation

    Public Class GH_FadeAnimation

The GH_FadeAnimation type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_FadeAnimation|  Creates a
new instance of the Animator class with default settings.
|
GH_FadeAnimation(Single)|
Create a new instance of the Animator class with custom values for zoom
threshold.
| GH_FadeAnimation(Single,
Int32)|  Create a new
instance of the Animator class with custom values for zoom threshold and
duration.
Top

Properties

| Name| Description
---|---|---
|
Duration|  Gets or sets the
duration (in milliseconds) for ZUI animations. Negative durations are not
allowed. The default is 350 milliseconds.
|
FadeAlpha|  Gets the blend
alpha byte for the current state. 0 means fully hidden, 255 means fully shown.
|
FadeFactor|  Gets the
blend factor for the current state. 0.0 means fully hidden, 1.0 means fully
shown.
|
IsFinished|  Gets a value
indicating whether this animator has finished animating.
|
Phase|  Gets the current
animation phase.
|
Threshold|  Gets or sets
the threshold value for the fade animation trigger.
|
TriggerUpdate|  Gets
or sets whether this animator triggers canvas updates.
Top

Methods

| Name| Description
---|---|---
|
Evaluate(GH_Canvas)|
Reevaluate the fade animation parameters. You should call this method from
within the Render method of your attributes. If an animation is currently in
progress a redraw of the canvas will be scheduled, whether or not the
attributes are actually visible on the canvas. You should therefore only call
this method if your attributes are already drawing themselves.
| Evaluate(GH_Canvas,
Boolean)|  Reevaluate the
fade animation parameters. You should call this method from within the Render
method of your attributes. If an animation is currently in progress a redraw
of the canvas will be scheduled, whether or not the attributes are actually
visible on the canvas. You should therefore only call this method if your
attributes are already drawing themselves.
| Evaluate(GH_Canvas,
Single)|  Reevaluate the
fade animation parameters. You should call this method from within the Render
method of your attributes. If an animation is currently in progress a redraw
of the canvas will be scheduled, whether or not the attributes are actually
visible on the canvas. You should therefore only call this method if your
attributes are already drawing themselves.
| Evaluate(GH_Canvas, Single,
Boolean)|  Reevaluate the
fade animation parameters. You should call this method from within the Render
method of your attributes. If an animation is currently in progress a redraw
of the canvas will be scheduled, whether or not the attributes are actually
visible on the canvas. You should therefore only call this method if your
attributes are already drawing themselves.
Top

Fields

| Name| Description
---|---|---
|
Delay|  Gets the number of
milliseconds between redraws (25 milliseconds, resulting in ~40 fps)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com