---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_ObjectVisibility_Attributes.htm
scraped_at: 2025-09-08T16:23:34.124074
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[ObjectVisibility.Attributes
Structure](../html/T_Grasshopper_Rhinoceros_Display_ObjectVisibility_Attributes.htm
"ObjectVisibility.Attributes Structure")

[Attributes
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_ObjectVisibility_Attributes.htm
"Attributes Properties")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_ObjectVisibility_Attributes.htm
"Attributes Methods")

!Click or drag to
resize

# ObjectVisibilityAttributes Structure

---

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct Attributes : GH_ISerializable,
    	IEquatable<ObjectVisibilityAttributes>

    Public Structure Attributes
    	Implements GH_ISerializable, IEquatable(Of ObjectVisibilityAttributes)

The ObjectVisibilityAttributes type exposes the following members.

Properties

| Name| Description
---|---|---
|
Hidden|
|
Locked|
|
Viewport|
Top

Methods

| Name| Description
---|---|---
|
Equals(ObjectVisibilityAttributes)|
|
Equals(Object)|
(Overrides
[ValueTypeEquals(Object)](https://docs.microsoft.com/dotnet/api/system.valuetype.equals#system-
valuetype-equals\(system-object\)).)
|
GetHashCode|
(Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com