---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_IconPicker.htm
scraped_at: 2025-09-08T16:12:46.329584
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_IconPicker Class](../html/T_Grasshopper_GUI_GH_IconPicker.htm
"GH_IconPicker Class")

[GH_IconPicker Constructor ](../html/M_Grasshopper_GUI_GH_IconPicker__ctor.htm
"GH_IconPicker Constructor ")

[GH_IconPicker
Properties](../html/Properties_T_Grasshopper_GUI_GH_IconPicker.htm
"GH_IconPicker Properties")

[GH_IconPicker Methods](../html/Methods_T_Grasshopper_GUI_GH_IconPicker.htm
"GH_IconPicker Methods")

!Click or drag to
resize

# GH_IconPicker Class

---

Provides a standard icon selection interface.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsUserControl
Grasshopper.GUIGH_IconPicker

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_IconPicker : UserControl

    Public Class GH_IconPicker
    	Inherits UserControl

The GH_IconPicker type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_IconPicker| Initializes a new
instance of the GH_IconPicker class
Top

Properties

| Name| Description
---|---|---
|
Icon|  Gets or sets the icon to be
displayed in this picker.
|
IconChanged|  Gets a value
indicating whether or not the icon has been changed.
Top

Methods

| Name| Description
---|---|---
|
Dispose| Releases the unmanaged
resources used by the GH_IconPicker and optionally releases the managed
resources (Overrides
[ContainerControlDispose(Boolean)](https://docs.microsoft.com/dotnet/api/system.windows.forms.containercontrol.dispose#system-
windows-forms-containercontrol-dispose\(system-boolean\)).)
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com