---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Plugin_GH_RhinoScriptInterface.htm
scraped_at: 2025-09-08T16:22:28.843848
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Plugin

[GH_RhinoScriptInterface
Class](../html/T_Grasshopper_Plugin_GH_RhinoScriptInterface.htm
"GH_RhinoScriptInterface Class")

[GH_RhinoScriptInterface Constructor
](../html/M_Grasshopper_Plugin_GH_RhinoScriptInterface__ctor.htm
"GH_RhinoScriptInterface Constructor ")

[GH_RhinoScriptInterface
Methods](../html/Methods_T_Grasshopper_Plugin_GH_RhinoScriptInterface.htm
"GH_RhinoScriptInterface Methods")

!Click or drag to
resize

# GH_RhinoScriptInterface Class

---

Plugin Interface object that is exposed via the RhinoScript layer.

Inheritance Hierarchy

SystemObject
Grasshopper.PluginGH_RhinoScriptInterface

**Namespace:** Grasshopper.Plugin
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RhinoScriptInterface

    Public Class GH_RhinoScriptInterface

The GH_RhinoScriptInterface type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_RhinoScriptInterface|
Initializes a new instance of the GH_RhinoScriptInterface class
Top

Methods

| Name| Description
---|---|---
|
AssignDataToParameter|
Find a parameter and assign some persistent data.
|
BakeDataInObject|
Find an object and bake all geometry inside of it.
!Code
example|
CloseAllDocuments|
Close all Grasshopper documents.
!Code
example|
CloseDocument|
Close the currently active Grasshopper document. If there is not active
document, nothing will happen.
!Code
example|
DisableBanner|
Disables the display of the Grasshopper banner during Component loading. The
banner is typically only shown once during a Grasshopper session, namely when
the Editor is first loaded.
!Code
example|
DisableSolver|
Disables the Grasshopper Solver. If the Solver is disabled, expired components
and parameter will not be recomputed, though any existing solution will remain
intact.
!Code
example|
EnableBanner|
Enables the display of the Grasshopper banner during Component loading. The
banner is typically only shown once during a Grasshopper session, namely when
the Editor is first loaded.
!Code
example|
EnableSolver|
Enables the Grasshopper Solver. If the Solver is enabled, expired components
and parameter will be recomputed.
!Code
example|
HideEditor|
Hide the main Grasshopper Editor. If the editor hasn't been loaded or if the
Editor is already hidden, nothing will happen.
!Code
example|
IsEditorLoaded|
Returns the loaded state of the Grasshopper Main window.
!Code
example|
IsEditorVisible|
Returns the visible state of the Grasshopper Main window.
!Code
example|
IsSolverEnabled|
Returns the state of the Grasshopper Solver.
!Code
example|
LoadEditor|
Load the main Grasshopper Editor. If the editor has already been loaded
nothing will happen.
|
LoadedPluginGuids|
Gets an array of the IDs of all loaded plugins.
|
LoadedPluginNames|
Gets an array of the names and versions (if known) of all loaded plugins.
!Code
example|
OpenDocument|
Open a Grasshopper document. The editor will be loaded if necessary, but it
will not be automatically shown.
|
RunAsCommand|
**Obsolete.**
|
RunHeadless|
|
RunInCommandContext|
|
RunSolver|  Runs
the solver once, even if the global solver lock is on.
!Code
example|
SaveDocument|
Save the currently active Grasshopper document. If the active document has
never been saved, a Save... dialog will be shown. If there is no active
document, nothing will happen.
!Code
example|
SaveDocumentAs|
Save the currently active Grasshopper document in a specific location. If
there is no active document, nothing will happen.
|
SetSliderRangeAndValue|
Find a slider and assign a new value.
|
SetSliderValue|
Find a slider and assign a new value.
!Code
example|
ShowEditor|
Show the main Grasshopper Editor. The editor will be loaded first if needed.
If the Editor is already on screen, nothing will happen.
Top

See Also

#### Reference

Grasshopper.Plugin Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com