---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_ObjectChangedEventArgs.htm
scraped_at: 2025-09-08T16:17:11.483698
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_ObjectChangedEventArgs
Class](../html/T_Grasshopper_Kernel_GH_ObjectChangedEventArgs.htm
"GH_ObjectChangedEventArgs Class")

[GH_ObjectChangedEventArgs Constructor
](../html/Overload_Grasshopper_Kernel_GH_ObjectChangedEventArgs__ctor.htm
"GH_ObjectChangedEventArgs Constructor ")

[GH_ObjectChangedEventArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_ObjectChangedEventArgs.htm
"GH_ObjectChangedEventArgs Properties")

[GH_ObjectChangedEventArgs
Fields](../html/Fields_T_Grasshopper_Kernel_GH_ObjectChangedEventArgs.htm
"GH_ObjectChangedEventArgs Fields")

!Click or drag to
resize

# GH_ObjectChangedEventArgs Class

---

Event arguments passed during ObjectChanged events.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_ObjectChangedEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ObjectChangedEventArgs : EventArgs

    Public Class GH_ObjectChangedEventArgs
    	Inherits EventArgs

The GH_ObjectChangedEventArgs type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ObjectChangedEventArgs(IGH_DocumentObject,
GH_ObjectEventType)|
Initializes a new instance of the GH_ObjectChangedEventArgs class
|
GH_ObjectChangedEventArgs(IGH_DocumentObject,
String)|
Initializes a new instance of the GH_ObjectChangedEventArgs class
|
GH_ObjectChangedEventArgs(IGH_DocumentObject, GH_ObjectEventType,
Object)|
Initializes a new instance of the GH_ObjectChangedEventArgs class
|
GH_ObjectChangedEventArgs(IGH_DocumentObject, String,
Object)|
Initializes a new instance of the GH_ObjectChangedEventArgs class
Top

Properties

| Name| Description
---|---|---
|
CustomType|
Gets the customised type description of this event. This field is only set
when the Type is GH_ObjectEventType.Custom.
|
Sender|  Gets the
object which raised this event.
|
Tag|  Gets the tag
for this event.
|
Type|  Gets the
type of this event.
Top

Fields

| Name| Description
---|---|---
|
m_custom|
|
m_sender|
|
m_tag|
|
m_type|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com