---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Base_GH_TextBoxInputBase.htm
scraped_at: 2025-09-08T16:13:54.652413
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Base](../html/N_Grasshopper_GUI_Base.htm
"Grasshopper.GUI.Base")

[GH_TextBoxInputBase
Class](../html/T_Grasshopper_GUI_Base_GH_TextBoxInputBase.htm
"GH_TextBoxInputBase Class")

[GH_TextBoxInputBase Constructor
](../html/M_Grasshopper_GUI_Base_GH_TextBoxInputBase__ctor.htm
"GH_TextBoxInputBase Constructor ")

[GH_TextBoxInputBase
Properties](../html/Properties_T_Grasshopper_GUI_Base_GH_TextBoxInputBase.htm
"GH_TextBoxInputBase Properties")

[GH_TextBoxInputBase
Methods](../html/Methods_T_Grasshopper_GUI_Base_GH_TextBoxInputBase.htm
"GH_TextBoxInputBase Methods")

!Click or drag to
resize

# GH_TextBoxInputBase Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.BaseGH_TextBoxInputBase
Grasshopper.GUI.BaseGH_DigitScrollerBase
Grasshopper.GUI.BaseGH_SliderBase

**Namespace:** Grasshopper.GUI.Base
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_TextBoxInputBase

    Public MustInherit Class GH_TextBoxInputBase

The GH_TextBoxInputBase type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_TextBoxInputBase|
Initializes a new instance of the GH_TextBoxInputBase class
Top

Properties

| Name| Description
---|---|---
|
Font|  Gets or sets the
Font to use in this control.
|
IsTextInput|
Gets whether the text input box is currently on screen.
Top

Methods

| Name| Description
---|---|---
|
HandleTextInputAccepted|
|
HideTextInputBox|
Hides the text-input override form (if it is displayed).
|
RespondToEnter|
|
RespondToEscape|
| ShowTextInputBox(Control, String,
Boolean)|
Display a floating text-box on top of the owner control.
| ShowTextInputBox(Control, String,
Boolean,
Boolean)|
Display a floating text-box on top of the owner control.
| ShowTextInputBox(Control, String,
Boolean, Boolean,
Matrix)|
Display a floating text-box on top of the owner control.
Top

See Also

#### Reference

Grasshopper.GUI.Base Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com