---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_IndexRanges.htm
scraped_at: 2025-09-08T16:19:01.976284
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_IndexRanges Class](../html/T_Grasshopper_Kernel_Data_GH_IndexRanges.htm
"GH_IndexRanges Class")

[GH_IndexRanges Constructor
](../html/M_Grasshopper_Kernel_Data_GH_IndexRanges__ctor.htm "GH_IndexRanges
Constructor ")

[GH_IndexRanges
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_IndexRanges.htm
"GH_IndexRanges Properties")

[GH_IndexRanges
Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_IndexRanges.htm
"GH_IndexRanges Methods")

!Click or drag to
resize

# GH_IndexRanges Class

---

Represents a sorted, non-colliding collection of index ranges.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_IndexRanges

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_IndexRanges : GH_ISerializable

    Public Class GH_IndexRanges
    	Implements GH_ISerializable

The GH_IndexRanges type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_IndexRanges|
Initializes a new instance of the GH_IndexRanges class
Top

Properties

| Name| Description
---|---|---
|
Count|  Gets the number
of ranges stored in this collection.
|
Range|  Gets the range
at the given index.
Top

Methods

| Name| Description
---|---|---
|
InsertRange|
Insert an index range into the collection.
|
Read|
|
RemoveRange|
Remove an index range from the collection.
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com