---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_FontList.htm
scraped_at: 2025-09-08T16:12:36.302048
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_FontList Class](../html/T_Grasshopper_GUI_GH_FontList.htm "GH_FontList
Class")

[GH_FontList Constructor ](../html/M_Grasshopper_GUI_GH_FontList__ctor.htm
"GH_FontList Constructor ")

[GH_FontList Properties](../html/Properties_T_Grasshopper_GUI_GH_FontList.htm
"GH_FontList Properties")

[GH_FontList Methods](../html/Methods_T_Grasshopper_GUI_GH_FontList.htm
"GH_FontList Methods")

!Click or drag to
resize

# GH_FontList Class

---

Represents the installed Font collection. This control allows both navigation
and selection of Font Families.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsPanel
Grasshopper.GUIGH_DoubleBufferedPanel
Grasshopper.GUIGH_FontList

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_FontList : GH_DoubleBufferedPanel

    Public Class GH_FontList
    	Inherits GH_DoubleBufferedPanel

The GH_FontList type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_FontList| Initializes a new
instance of the GH_FontList class
Top

Properties

| Name| Description
---|---|---
|
DisplayText|  Gets or sets
the placeholder string.
|
Filter|  Gets or sets the filter
string. You must call RecreateFontList() before the new font list is created.
|
FontFamily|  Gets or sets the
selected font family.
|
FontSize|  Gets or sets the font
size.
|
FontStyle|  Gets or sets the
font style for all families.
Top

Methods

| Name| Description
---|---|---
|
CreateFont|  Create a font
that best approximates the current settings.
|
OnPaint|  (Overrides
[ControlOnPaint(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.control.onpaint#system-
windows-forms-control-onpaint\(system-windows-forms-painteventargs\)).)
|
OnPaintBackground|
(Overrides
[ScrollableControlOnPaintBackground(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.scrollablecontrol.onpaintbackground#system-
windows-forms-scrollablecontrol-onpaintbackground\(system-windows-forms-
painteventargs\)).)
|
RecreateFontList|
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com