---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_Transforms_Generic.htm
scraped_at: 2025-09-08T16:21:50.691661
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types.Transforms](../html/N_Grasshopper_Kernel_Types_Transforms.htm
"Grasshopper.Kernel.Types.Transforms")

[Generic Class](../html/T_Grasshopper_Kernel_Types_Transforms_Generic.htm
"Generic Class")

[Generic Constructor
](../html/Overload_Grasshopper_Kernel_Types_Transforms_Generic__ctor.htm
"Generic Constructor ")

[Generic
Properties](../html/Properties_T_Grasshopper_Kernel_Types_Transforms_Generic.htm
"Generic Properties")

[Generic
Methods](../html/Methods_T_Grasshopper_Kernel_Types_Transforms_Generic.htm
"Generic Methods")

!Click or drag to
resize

# Generic Class

---

Implements a generic matrix transformation.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.Types.TransformsGeneric

**Namespace:**
Grasshopper.Kernel.Types.Transforms
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class Generic : ITransform

    Public Class Generic
    	Implements ITransform

The Generic type exposes the following members.

Constructors

| Name| Description
---|---|---
|
Generic|
Initializes a new instance of the Generic class
|
Generic(Transform)|
Initializes a new instance of the Generic class
Top

Properties

| Name| Description
---|---|---
|
Name|
|
Transform|
Top

Methods

| Name| Description
---|---|---
|
Duplicate|
|
Read|
|
Reverse|
|
ToMatrix|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types.Transforms
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com