---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_ContextualComponent.htm
scraped_at: 2025-09-08T16:18:18.764415
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_ContextualComponent
Interface](../html/T_Grasshopper_Kernel_IGH_ContextualComponent.htm
"IGH_ContextualComponent Interface")

[IGH_ContextualComponent
Properties](../html/Properties_T_Grasshopper_Kernel_IGH_ContextualComponent.htm
"IGH_ContextualComponent Properties")

!Click or drag to
resize

# IGH_ContextualComponent Interface

---

Base interface for contextual components. This makes accessing non-strongly-
typed functionality easier.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_ContextualComponent

    Public Interface IGH_ContextualComponent

The IGH_ContextualComponent type exposes the following members.

Properties

| Name| Description
---|---|---
|
Archive|  Gets
instance of embedded Grasshopper GH_Archive
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com