---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_MemoryBitmap.htm
scraped_at: 2025-09-08T16:17:10.478915
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_MemoryBitmap Class](../html/T_Grasshopper_Kernel_GH_MemoryBitmap.htm
"GH_MemoryBitmap Class")

[GH_MemoryBitmap Constructor
](../html/Overload_Grasshopper_Kernel_GH_MemoryBitmap__ctor.htm
"GH_MemoryBitmap Constructor ")

[GH_MemoryBitmap
Properties](../html/Properties_T_Grasshopper_Kernel_GH_MemoryBitmap.htm
"GH_MemoryBitmap Properties")

[GH_MemoryBitmap
Methods](../html/Methods_T_Grasshopper_Kernel_GH_MemoryBitmap.htm
"GH_MemoryBitmap Methods")

!Click or drag to
resize

# GH_MemoryBitmap Class

---

Utility class for ultra-fast bitmap sampling and filters.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_MemoryBitmap

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_MemoryBitmap

    Public NotInheritable Class GH_MemoryBitmap

The GH_MemoryBitmap type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_MemoryBitmap(Bitmap)|
Default constructor.
| GH_MemoryBitmap(Bitmap,
WrapMode)|  Constructor
with Wrap mode override.
Top

Properties

| Name| Description
---|---|---
|
HasAlphaChannel|
Gets a value indicating whether or not the local image has an alpha channel
defined.
|
Height|  Gets the height
(in pixels) of the local image.
|
SizeOf|  Gets the size (in
bytes) of the local image.
|
Width|  Gets the width (in
pixels) of the local image.
Top

Methods

| Name| Description
---|---|---
|
A|  Gets the alpha channel value
at the given pixel coordinates.
|
B|  Gets the blue channel value
at the given pixel coordinates.
| Colour(Int32,
Int32)|  Gets the colour at
the given pixel coordinates.
| Colour(Int32, Int32,
Color)|  Sets the colour
at the given pixel coordinates.
|
CopyChannel|  Copy the
contents of one channel into another.
|
Filter_AlphaEdges|
Set the alpha component on all edges to a specific value.
|
Filter_Blur|  Blur the
image in both directions.
|
Filter_Blur(Int32)|
Blur the image N times in both directions.
| Filter_Blur(Int32,
Int32)|  Blur the
image in both directions.
| Filter_Blur(Int32, Int32,
Int32)|  Blur the
image N times in both directions.
|
Filter_BlurAlpha|
Blur the alpha channel of the image N times in both directions.
|
Filter_Contrast|
Adjust the contrast of a specific channel.
|
Filter_DitherPattern|
Create a checkerboard dither pattern.
|
Filter_DropShadow|
Add a drop-shadow to the image. Image is not grown, so if you want the drop
shadow to extend beyond the image boundaries, you have to add padding to the
image first.
|
Filter_Dullify|
Reduces contrast based on opacity. This filter pulls all colours towards dull
grey, without wrecking drop-shadows.
|
Filter_Equalize|
Set all the values in a specific channel to a specific value.
|
Filter_GreyScale|
Convert the image to a greyscale shadow of its former self.
|
Filter_GreyScale(Double)|
Convert the image to a greyscale shadow of its former self.
|
Filter_HueScale|
Convert the image to a greyscale representation of the hues.
|
Filter_Invert|
Invert all values in a specific channel.
|
Filter_LumScale|
Convert the image to a greyscale representation of the luminance.
| Filter_Multiply(GH_BitmapChannel,
Double)|  Multiply
all values in a specific channel with a specific factor.
| Filter_Multiply(GH_BitmapChannel,
Double, Byte)|
Multiply all values in a specific channel with a specific factor, using a
custom scaling center anchor.
|
Filter_SatScale|
Convert the image to a greyscale representation of the saturation.
|
Filter_Shift|  Shift
all values in a specific channel with a specific amount.
|
Filter_SpectrumScale|
Convert the image to a spectral representation of the hues.
|
Filter_Tint|  Colorize
the image using Hue and Saturation from a base colour.
|
G|  Gets the greeb channel value
at the given pixel coordinates.
|
OpaqueArea|  Find the
opaque area of a bitmap. The opaque area is the rectangle that contains pixels
with a colour that is not fully transparent.
|
PadBitmap|  Add padding
edges around a bitmap.
|
R|  Gets the red channel value
at the given pixel coordinates.
|
Release|  Release the
locked bits. You **must** call this function when you are done with this
GH_MemoryBitmap instance.
| Sample(Double, Double,
Color)|  Top level sampling
function for interpolated sampling.
| Sample(Int32, Int32,
Color)|  Top level
sampling function.
|
ShrinkBitmap|  Shrink
an image by removing all outer columns and rows that contain only fully
transparent pixels.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com