---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingColor_Value.htm
scraped_at: 2025-09-08T16:23:57.235728
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Drafting](../html/N_Grasshopper_Rhinoceros_Drafting.htm
"Grasshopper.Rhinoceros.Drafting")

[ObjectDraftingColor.Value
Structure](../html/T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingColor_Value.htm
"ObjectDraftingColor.Value Structure")

[Value Constructor
](../html/Overload_Grasshopper_Rhinoceros_Drafting_ObjectDraftingColor_Value__ctor.htm
"Value Constructor ")

[Value
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingColor_Value.htm
"Value Properties")

[Value
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingColor_Value.htm
"Value Methods")

[Value Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Drafting_ObjectDraftingColor_Value.htm
"Value Type Conversions")

!Click or drag to
resize

# ObjectDraftingColorValue Structure

---

**Namespace:**
Grasshopper.Rhinoceros.Drafting
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct Value : GH_ISerializable, IEquatable<ObjectDraftingColorValue>,
    	IComparable<ObjectDraftingColorValue>, IComparable

    Public Structure Value
    	Implements GH_ISerializable, IEquatable(Of ObjectDraftingColorValue),
    	IComparable(Of ObjectDraftingColorValue), IComparable

The ObjectDraftingColorValue type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectDraftingColorValue(ModelColor)|
Initializes a new instance of the ObjectDraftingColorValue class
|
ObjectDraftingColorValue(ObjectPlotColorSource)|
Initializes a new instance of the ObjectDraftingColorValue class
|
ObjectDraftingColorValue(ObjectPlotColorSource,
ModelColor)|
Initializes a new instance of the ObjectDraftingColorValue class
Top

Properties

| Name| Description
---|---|---
!Static
member|
ByDisplay|
!Static
member|
ByLayer|
!Static
member|
ByParent|
|
Color|
|
Source|
Top

Methods

| Name| Description
---|---|---
|
CompareTo(Object)|
|
CompareTo(ObjectDraftingColorValue)|
|
Deconstruct|
|
Equals(Object)|
(Overrides
[ValueTypeEquals(Object)](https://docs.microsoft.com/dotnet/api/system.valuetype.equals#system-
valuetype-equals\(system-object\)).)
|
Equals(ObjectDraftingColorValue)|
|
GetHashCode|
(Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
|
ToString|
(Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelColor to
ObjectDraftingColorValue)|
!Static
member| (ObjectPlotColorSource to
ObjectDraftingColorValue)|
!Static
member| (ObjectDraftingColorValue to
ModelColor)|
!Static
member| (ObjectDraftingColorValue to
ObjectPlotColorSource)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Drafting
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com