---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_IGH_FileDropTarget.htm
scraped_at: 2025-09-08T16:13:26.499635
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[IGH_FileDropTarget
Interface](../html/T_Grasshopper_GUI_IGH_FileDropTarget.htm
"IGH_FileDropTarget Interface")

[IGH_FileDropTarget
Methods](../html/Methods_T_Grasshopper_GUI_IGH_FileDropTarget.htm
"IGH_FileDropTarget Methods")

!Click or drag to
resize

# IGH_FileDropTarget Interface

---

Implement this interface in your IGH_DocumentObject if you want to participate
in Drag+Drop events.

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_FileDropTarget

    Public Interface IGH_FileDropTarget

The IGH_FileDropTarget type exposes the following members.

Methods

| Name| Description
---|---|---
|
AcceptableFile|
Gets a value indicating whether or not the path can be handled by the local
object.
|
HandleDrop|  Handle a
file drop.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com