---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_PathOffset.htm
scraped_at: 2025-09-08T16:19:08.008128
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_PathOffset Class](../html/T_Grasshopper_Kernel_Data_GH_PathOffset.htm
"GH_PathOffset Class")

[GH_PathOffset Constructor
](../html/Overload_Grasshopper_Kernel_Data_GH_PathOffset__ctor.htm
"GH_PathOffset Constructor ")

[GH_PathOffset
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_PathOffset.htm
"GH_PathOffset Properties")

[GH_PathOffset
Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_PathOffset.htm
"GH_PathOffset Methods")

!Click or drag to
resize

# GH_PathOffset Class

---

Represents a relative offset within a data structure.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_PathOffset

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PathOffset

    Public Class GH_PathOffset

The GH_PathOffset type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PathOffset|
Initializes a new instance of the GH_PathOffset class
|
GH_PathOffset(IEnumerableInt32)|
Initializes a new instance of the GH_PathOffset class
| GH_PathOffset(IEnumerableInt32,
Int32)| Initializes a
new instance of the GH_PathOffset class
| GH_PathOffset(IEnumerableInt32,
Int32, Boolean,
Boolean)| Initializes a
new instance of the GH_PathOffset class
Top

Properties

| Name| Description
---|---|---
|
ItemOffset|  Gets or
sets the relative offset for branch items.
|
ItemWrap|  Gets or
sets the ItemWrap flag.
|
PathOffset|  Gets
access to the relative offsets for path indices.
|
PathWrap|  Gets or
sets the PathWrap flag.
Top

Methods

| Name| Description
---|---|---
| OffsetPath(GH_Path, Int32, GH_Path,
Int32)|  Offset a
path + index value without wrapping.
| OffsetPath(GH_Path, Int32,
IGH_Structure, GH_Path,
Int32)|  Offset a
path + index value with wrapping and bounds checking.
|
ParseString|
|
ToString|  Format the
Path Offset.  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com