---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Interval2D.htm
scraped_at: 2025-09-08T16:20:52.441351
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Interval2D Class](../html/T_Grasshopper_Kernel_Types_GH_Interval2D.htm
"GH_Interval2D Class")

[GH_Interval2D Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Interval2D__ctor.htm
"GH_Interval2D Constructor ")

[GH_Interval2D
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Interval2D.htm
"GH_Interval2D Properties")

[GH_Interval2D
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Interval2D.htm
"GH_Interval2D Methods")

[GH_Interval2D
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Interval2D.htm
"GH_Interval2D Fields")

!Click or drag to
resize

# GH_Interval2D Class

---

Represents a two-dimensional numeric domain.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooUVInterval
Grasshopper.Kernel.TypesGH_Interval2D

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Interval2D : GH_Goo<UVInterval>

    Public Class GH_Interval2D
    	Inherits GH_Goo(Of UVInterval)

The GH_Interval2D type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Interval2D|  Default
constructor. Creates two empty intervals.
|
GH_Interval2D(GH_Interval2D)|
Create a duplicate of another two-dimensional interval
|
GH_Interval2D(UVInterval)|
Duplicates a one-dimensional interval in both directions.
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets the
validity of this instance. Valid intervals contain no #NaN extremes
(Overrides GH_GooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  Remote to
Local caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  Local
to Remote caster function. this stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GooTCastToQ(Q).)
|
Duplicate|  Create a
duplicate of this interval.  (Overrides
GH_GooTDuplicate.)
|
DuplicateInterval|
Create a duplicate of this interval.
|
EmitProxy|  Returns
a proxy that represents this interval. Do not call this function unless you're
(Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  Format the
interval using default grasshopper formatting logic.  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com