---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Arc.htm
scraped_at: 2025-09-08T16:20:17.327258
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

GH_Arc Class

[GH_Arc Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Arc__ctor.htm "GH_Arc
Constructor ")

[GH_Arc Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Arc.htm
"GH_Arc Properties")

[GH_Arc Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Arc.htm "GH_Arc
Methods")

[GH_Arc Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Arc.htm "GH_Arc
Fields")

!Click or drag to
resize

# GH_Arc Class

---

Represents a 3D circular arc. GH_Arc re-implements the OpenNURBS OnArc class.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooArc
Grasshopper.Kernel.TypesGH_GeometricGooArc
Grasshopper.Kernel.TypesGH_Arc

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Arc : GH_GeometricGoo<Arc>,
    	IGH_BakeAwareData, IGH_PreviewData

    Public Class GH_Arc
    	Inherits GH_GeometricGoo(Of Arc)
    	Implements IGH_BakeAwareData, IGH_PreviewData

The GH_Arc type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Arc|  Default constructor
|
GH_Arc(Arc)|  Create a
duplicate of another arc
|
GH_Arc(GH_Arc)|  Create a
duplicate of another arc
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|  Gets the
boundingbox for this geometry.  (Overrides
GH_GeometricGooTBoundingbox.)
|
ClippingBox|
|
IsGeometryLoaded|
Gets a value indicating whether or not this geometry is currently loaded
(assuming it is referenced). Not all IGH_GeometricGoo implementations support
referenced geometry. The default is to always return True.  (Inherited from
GH_GeometricGooT.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  Gets the validity
of this instance.
|
IsValidWhyNot|  Gets a
string describing the state of "invalidness". If the instance _is_ valid, then
this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
ReferenceID|
Gets or sets the Guid of the object that is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry. The default
implementation is to always return Guid.Empty.  (Inherited from
GH_GeometricGooT.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets
the value of this type. Note that if the type has a ReferenceID this value
might get destroyed in the future.  (Inherited from
GH_GeometricGooT.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
|
CastFrom|  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToT(T)|  (Overrides
GH_GeometricGooTCastToQ(Q).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
ClearCaches|
Clears all caches. Typically if the geometry is referenced, this will erase
the local copy. If your T is a value-type, you must override this function and
specifically unset the local value.  (Inherited from
GH_GeometricGooT.)
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|  (Overrides
GH_GeometricGooTDuplicate.)
|
DuplicateArc|  Create a
duplicate of this arc.
|
DuplicateGeometry|
Create a duplicate of this arc.  (Overrides
GH_GeometricGooTDuplicateGeometry.)
|
EmitProxy|  Returns a proxy
that represents this arc. Do not call this function unless you're  (Overrides
GH_GeometricGooTEmitProxy.)
|
GetBoundingBox|
(Overrides
GH_GeometricGooTGetBoundingBox(Transform).)
|
LoadGeometry|
If the geometry is referenced and currently unloaded, forces loading of the
geometry. Not all IGH_GeometricGoo implementations support referenced
geometry.  (Inherited from
GH_GeometricGooT.)
|
LoadGeometry(RhinoDoc)|
If the geometry is referenced and currently unloaded, forces loading of the
geometry. Not all IGH_GeometricGoo implementations support referenced
geometry. The default is to always return True.  (Inherited from
GH_GeometricGooT.)
|
Morph|  (Overrides
GH_GeometricGooTMorph(SpaceMorph).)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Transform|  (Overrides
GH_GeometricGooTTransform(Transform).)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com