---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Goo_1.htm
scraped_at: 2025-09-08T16:20:43.413485
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Goo(T) Class](../html/T_Grasshopper_Kernel_Types_GH_Goo_1.htm "GH_Goo\(T\)
Class")

[GH_Goo(T) Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Goo_1__ctor.htm "GH_Goo\(T\)
Constructor ")

[GH_Goo(T)
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Goo_1.htm
"GH_Goo\(T\) Properties")

[GH_Goo(T) Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Goo_1.htm
"GH_Goo\(T\) Methods")

[GH_Goo(T) Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Goo_1.htm
"GH_Goo\(T\) Fields")

!Click or drag to
resize

# GH_GooT Class

---

Base class for IGH_Goo implementation. Takes care of some default behaviour.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooT
More...

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_Goo<T> : IGH_Goo

    Public MustInherit Class GH_Goo(Of T)
    	Implements IGH_Goo

#### Type Parameters

T

The GH_GooT type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_GooT|  Blank constructor,
m_value will be set to default (null for reference types, zeroes for value
types)
|
GH_GooT(T)|  Data
constructor, m_value will be set to internal_data.
|
GH_GooT(GH_GooT)|  Copy
constructor, copies the data from another GH_Goo(Of T) instance. Reference
types will not be duplicated.
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets a value
indicating whether or not the current value is valid.
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.
|
TypeDescription|
Gets a description of the type of the implementation.
|
TypeName|  Gets the name
of the type of the implementation.
|
Value|  Gets or sets the
internal data.
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  Attempt a cast
from generic data.
|
CastToQ|  Attempt a cast
to type Q.
|
Duplicate|  Make a
complete duplicate of this instance. No shallow copies.
|
EmitProxy|  Create a new
proxy for this instance. Return Null if this class does not support proxies.
|
Read|  Default behaviour is to
return True.
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.
|
ToString|  Creates a
string description of the current instance value.  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|  Default behaviour is
to return True.
Top

Fields

| Name| Description
---|---|---
|
m_value|
Top

Remarks

Feel free to implement IGH_Goo directly though.

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooT
Grasshopper.Kernel.TypesGH_Boolean
Grasshopper.Kernel.TypesGH_Colour
Grasshopper.Kernel.TypesGH_ComplexNumber
Grasshopper.Kernel.TypesGH_Culture
Grasshopper.Kernel.TypesGH_GeometricGooT
Grasshopper.Kernel.TypesGH_Guid
Grasshopper.Kernel.TypesGH_Integer
Grasshopper.Kernel.TypesGH_Interval
Grasshopper.Kernel.TypesGH_Interval2D
Grasshopper.Kernel.TypesGH_Material
Grasshopper.Kernel.TypesGH_Matrix
Grasshopper.Kernel.TypesGH_MeshFace
Grasshopper.Kernel.TypesGH_MeshingParameters
Grasshopper.Kernel.TypesGH_Number
Grasshopper.Kernel.TypesGH_ObjectWrapper
Grasshopper.Kernel.TypesGH_String
Grasshopper.Kernel.TypesGH_StructurePath
Grasshopper.Kernel.TypesGH_Time
Grasshopper.Kernel.TypesGH_Transform
Grasshopper.Kernel.TypesGH_Vector
Grasshopper.Rhinoceros.DisplayDisplayColorGradient
Grasshopper.Rhinoceros.DisplayDisplayColorStop
Grasshopper.RhinocerosModelFont

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com