---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_DebugDescription.htm
scraped_at: 2025-09-08T16:18:22.777512
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_DebugDescription
Interface](../html/T_Grasshopper_Kernel_IGH_DebugDescription.htm
"IGH_DebugDescription Interface")

[IGH_DebugDescription
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_DebugDescription.htm
"IGH_DebugDescription Methods")

!Click or drag to
resize

# IGH_DebugDescription Interface

---

Implement this interface to participate in Debug Logging.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_DebugDescription

    Public Interface IGH_DebugDescription

The IGH_DebugDescription type exposes the following members.

Methods

| Name| Description
---|---|---
|
AppendToDebugLog|
Write important debugging data to a debug writer object.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com