---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_FileSystemEventServer.htm
scraped_at: 2025-09-08T16:16:42.335565
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_FileSystemEventServer
Class](../html/T_Grasshopper_Kernel_GH_FileSystemEventServer.htm
"GH_FileSystemEventServer Class")

[GH_FileSystemEventServer
Properties](../html/Properties_T_Grasshopper_Kernel_GH_FileSystemEventServer.htm
"GH_FileSystemEventServer Properties")

[GH_FileSystemEventServer
Methods](../html/Methods_T_Grasshopper_Kernel_GH_FileSystemEventServer.htm
"GH_FileSystemEventServer Methods")

!Click or drag to
resize

# GH_FileSystemEventServer Class

---

Provides a easy-to-use way to keep tabs on files.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_FileSystemEventServer

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_FileSystemEventServer

    Public NotInheritable Class GH_FileSystemEventServer

The GH_FileSystemEventServer type exposes the following members.

Properties

| Name| Description
---|---|---
!Static
member|
AllPaths|  Gets
a list of all the paths currently under surveillance.
Top

Methods

| Name| Description
---|---|---
|
AddWatcher|
Add a new file watcher instance.
|
RemoveWatcher(Object)|
Remove all watchers that are linked to a specific object.
|
RemoveWatcher(Object,
String)|
Remove all watchers that are linked to a specific object and a specific file
path.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com