---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_LoadProtectDialog.htm
scraped_at: 2025-09-08T16:12:48.351502
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_LoadProtectDialog
Class](../html/T_Grasshopper_GUI_GH_LoadProtectDialog.htm
"GH_LoadProtectDialog Class")

[GH_LoadProtectDialog Constructor
](../html/M_Grasshopper_GUI_GH_LoadProtectDialog__ctor.htm
"GH_LoadProtectDialog Constructor ")

[GH_LoadProtectDialog
Methods](../html/Methods_T_Grasshopper_GUI_GH_LoadProtectDialog.htm
"GH_LoadProtectDialog Methods")

!Click or drag to
resize

# GH_LoadProtectDialog Class

---

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsForm
Grasshopper.GUIGH_LoadProtectDialog

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_LoadProtectDialog : Form

    Public Class GH_LoadProtectDialog
    	Inherits Form

The GH_LoadProtectDialog type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_LoadProtectDialog|
Initializes a new instance of the GH_LoadProtectDialog class
Top

Methods

| Name| Description
---|---|---
|
Dispose| Releases the
unmanaged resources used by the GH_LoadProtectDialog and optionally releases
the managed resources (Overrides
[FormDispose(Boolean)](https://docs.microsoft.com/dotnet/api/system.windows.forms.form.dispose#system-
windows-forms-form-dispose\(system-boolean\)).)
|
SetAssemblyName|
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto| Overloaded. (Defined by
EtoExtensions.)
|
ToEto| Overloaded. (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com