---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Matrix.htm
scraped_at: 2025-09-08T16:21:04.497411
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Matrix Class](../html/T_Grasshopper_Kernel_Types_GH_Matrix.htm "GH_Matrix
Class")

[GH_Matrix Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Matrix__ctor.htm "GH_Matrix
Constructor ")

[GH_Matrix
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Matrix.htm
"GH_Matrix Properties")

[GH_Matrix Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Matrix.htm
"GH_Matrix Methods")

[GH_Matrix Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Matrix.htm
"GH_Matrix Fields")

!Click or drag to
resize

# GH_Matrix Class

---

Represents a rectangular numeric matrix. GH_Integer re-implements
Rhino.Geometry.Matrix.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooMatrix
Grasshopper.Kernel.TypesGH_Matrix

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Matrix : GH_Goo<Matrix>

    Public Class GH_Matrix
    	Inherits GH_Goo(Of Matrix)

The GH_Matrix type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Matrix|  Blank
constructor
|
GH_Matrix(GH_Matrix)|
Initializes a new instance of the GH_Matrix class
|
GH_Matrix(Matrix)|
Initializes a new instance of the GH_Matrix class
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets the
validity of this instance. Integers are always valid.  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Inherited from
GH_GooT.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  (Overrides
GH_GooTCastToQ(Q).)
|
CloneMatrix|
Duplicates a Matrix.
|
Duplicate|  (Overrides
GH_GooTDuplicate.)
|
DuplicateMatrix|
|
EmitProxy|  Create a new
proxy for this instance. Return Null if this class does not support proxies.
(Inherited from GH_GooT.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com