---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Model_ModelObject.htm
scraped_at: 2025-09-08T16:24:18.320072
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Model](../html/N_Grasshopper_Rhinoceros_Model.htm
"Grasshopper.Rhinoceros.Model")

[ModelObject Class](../html/T_Grasshopper_Rhinoceros_Model_ModelObject.htm
"ModelObject Class")

[ModelObject Constructor
](../html/Overload_Grasshopper_Rhinoceros_Model_ModelObject__ctor.htm
"ModelObject Constructor ")

[ModelObject
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Model_ModelObject.htm
"ModelObject Properties")

[ModelObject
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Model_ModelObject.htm
"ModelObject Methods")

[ModelObject Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Model_ModelObject.htm
"ModelObject Type Conversions")

!Click or drag to
resize

# ModelObject Class

---

Represents a Rhino model object. Wraps the functionality of the RhinoObject
type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.RhinocerosModelComponentContent
Grasshopper.Rhinoceros.ModelModelObject

**Namespace:**
Grasshopper.Rhinoceros.Model
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelObject : ModelComponentContent,
    	IGH_BakeAwareData, IGH_PreviewData, IGH_PreviewMeshData, IGH_RenderAwareData

    Public NotInheritable Class ModelObject
    	Inherits ModelComponentContent
    	Implements IGH_BakeAwareData, IGH_PreviewData, IGH_PreviewMeshData, IGH_RenderAwareData

The ModelObject type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelObject|
Initializes a new instance of the ModelObject class
|
ModelObject(ModelObjectAttributes)|
Initializes a new instance of the ModelObject class
|
ModelObject(Guid)|
Initializes a new instance of the ModelObject class
|
ModelObject(RhinoObject)|
Initializes a new instance of the ModelObject class
| ModelObject(RhinoDoc,
ObjectAttributes)|
Initializes a new instance of the ModelObject class
| ModelObject(RhinoDoc,
ObjectAttributes,
GeometryBase)|
Initializes a new instance of the ModelObject class
Top

Properties

| Name| Description
---|---|---
|
Display|
|
Drafting|
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Overrides
ModelContentIsValid.)
|
Layer|
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
ObjectType|
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Render|
|
Tags|  (Inherited from
ModelContent.)
|
TypeName|
(Overrides ModelData.TypeName.)
|
Url|
|
UserText|
(Inherited from
ModelComponentContent.)
|
Visibility|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelContentCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetBoundingBox|
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Overrides
ModelContentTooltipString.)
|
ToString|
(Overrides
ModelContentToString.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelObjectAttributes to
ModelObject)|
!Static
member| (RhinoObject to
ModelObject)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Model Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com