---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Documentation_GH_ContentCollection.htm
scraped_at: 2025-09-08T16:11:55.118736
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Documentation](../html/N_Grasshopper_Documentation.htm
"Grasshopper.Documentation")

[GH_ContentCollection
Class](../html/T_Grasshopper_Documentation_GH_ContentCollection.htm
"GH_ContentCollection Class")

[GH_ContentCollection Constructor
](../html/M_Grasshopper_Documentation_GH_ContentCollection__ctor.htm
"GH_ContentCollection Constructor ")

[GH_ContentCollection
Properties](../html/Properties_T_Grasshopper_Documentation_GH_ContentCollection.htm
"GH_ContentCollection Properties")

[GH_ContentCollection
Methods](../html/Methods_T_Grasshopper_Documentation_GH_ContentCollection.htm
"GH_ContentCollection Methods")

!Click or drag to
resize

# GH_ContentCollection Class

---

Represents an ordered collection of IGH_Content.

Inheritance Hierarchy

SystemObject
Grasshopper.DocumentationGH_ContentCollection

**Namespace:** Grasshopper.Documentation
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ContentCollection : IGH_Content

    Public Class GH_ContentCollection
    	Implements IGH_Content

The GH_ContentCollection type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ContentCollection|
Initializes a new instance of the GH_ContentCollection class
Top

Properties

| Name| Description
---|---|---
|
Content|
|
Count|
|
Item|
Top

Methods

| Name| Description
---|---|---
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

See Also

#### Reference

Grasshopper.Documentation Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com