---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_WindowsFormUtil.htm
scraped_at: 2025-09-08T16:13:22.497240
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_WindowsFormUtil Class](../html/T_Grasshopper_GUI_GH_WindowsFormUtil.htm
"GH_WindowsFormUtil Class")

[GH_WindowsFormUtil
Methods](../html/Methods_T_Grasshopper_GUI_GH_WindowsFormUtil.htm
"GH_WindowsFormUtil Methods")

!Click or drag to
resize

# GH_WindowsFormUtil Class

---

Exposes some static (Shared) utility functions for positioning custom windows.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_WindowsFormUtil

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_WindowsFormUtil

    Public NotInheritable Class GH_WindowsFormUtil

Methods

| Name| Description
---|---|---
|
CenterFormOnCursor(Form,
Boolean)|
Positions a Form so that it is centered around the cursor
|
CenterFormOnCursor(Window,
Boolean)|
Positions a Form so that it is centered around the cursor
|
CenterFormOnEditor(Form,
Boolean)|
Positions a Form so that it is centered on the active editor. If the editor
doesn't exist or is hidden, the form will be centered on the screen instead.
|
CenterFormOnEditor(Window,
Boolean)|
Positions a Form so that it is centered on the active editor. If the editor
doesn't exist or is hidden, the form will be centered on the screen instead.
|
CenterFormOnScreen(Form,
Boolean)|
Positions a Form so that it is centered on the current screen. The current
screen being defined as the screen containing the cursor.
|
CenterFormOnScreen(Window,
Boolean)|
Positions a Form so that it is centered on the current screen. The current
screen being defined as the screen containing the cursor.
|
CenterFormOnWindow(Form, Form,
Boolean)|
Positions a Form so that it is centered on the supplied window. If the window
doesn't exist or is hidden, the form will be centered on the screen instead.
|
CenterFormOnWindow(Window, Window,
Boolean)|
Positions a Form so that it is centered on the supplied window. If the window
doesn't exist or is hidden, the form will be centered on the screen instead.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com