---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Drafting_ModelHatchLine.htm
scraped_at: 2025-09-08T16:23:47.182573
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Drafting](../html/N_Grasshopper_Rhinoceros_Drafting.htm
"Grasshopper.Rhinoceros.Drafting")

[ModelHatchLine
Class](../html/T_Grasshopper_Rhinoceros_Drafting_ModelHatchLine.htm
"ModelHatchLine Class")

[ModelHatchLine Constructor
](../html/Overload_Grasshopper_Rhinoceros_Drafting_ModelHatchLine__ctor.htm
"ModelHatchLine Constructor ")

[ModelHatchLine
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Drafting_ModelHatchLine.htm
"ModelHatchLine Properties")

[ModelHatchLine
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Drafting_ModelHatchLine.htm
"ModelHatchLine Methods")

[ModelHatchLine Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Drafting_ModelHatchLine.htm
"ModelHatchLine Type Conversions")

!Click or drag to
resize

# ModelHatchLine Class

---

Represents a Rhino model hatch line.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.Rhinoceros.DraftingModelHatchLine

**Namespace:**
Grasshopper.Rhinoceros.Drafting
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelHatchLine : ModelValue

    Public NotInheritable Class ModelHatchLine
    	Inherits ModelValue

The ModelHatchLine type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelHatchLine|
Initializes a new instance of the ModelHatchLine class
|
ModelHatchLine(ModelHatchLineAttributes)|
Initializes a new instance of the ModelHatchLine class
|
ModelHatchLine(HatchLine)|
Initializes a new instance of the ModelHatchLine class
Top

Properties

| Name| Description
---|---|---
|
Angle|
|
Base|
|
Offset|
|
Segments|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT|  (Inherited from
ModelValue.)
|
Equals(ModelValue)|
(Inherited from ModelValue.)
|
Equals(Object)|
(Overrides
ModelValueEquals(Object).)
|
GetHashCode|
(Overrides
ModelValueGetHashCode.)
|
ToAttributes|
|
ToHatchLine|
|
TooltipString|
(Inherited from ModelValue.)
|
ToString|
(Overrides
ModelValueToString.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelHatchLineAttributes to
ModelHatchLine)|
!Static
member| (HatchLine to
ModelHatchLine)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Drafting
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com