---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_RuleAnyNumbers.htm
scraped_at: 2025-09-08T16:19:10.014733
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_RuleAnyNumbers
Class](../html/T_Grasshopper_Kernel_Data_GH_RuleAnyNumbers.htm
"GH_RuleAnyNumbers Class")

[GH_RuleAnyNumbers Constructor
](../html/M_Grasshopper_Kernel_Data_GH_RuleAnyNumbers__ctor.htm
"GH_RuleAnyNumbers Constructor ")

[GH_RuleAnyNumbers
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_RuleAnyNumbers.htm
"GH_RuleAnyNumbers Properties")

[GH_RuleAnyNumbers
Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_RuleAnyNumbers.htm
"GH_RuleAnyNumbers Methods")

!Click or drag to
resize

# GH_RuleAnyNumbers Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_RuleAnyNumbers

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RuleAnyNumbers : IGH_Rule

    Public Class GH_RuleAnyNumbers
    	Implements IGH_Rule

The GH_RuleAnyNumbers type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_RuleAnyNumbers|
Initializes a new instance of the GH_RuleAnyNumbers class
Top

Properties

| Name| Description
---|---|---
|
Kind|
|
Notation|
Top

Methods

| Name| Description
---|---|---
|
Apply|
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com