---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Gradient_GH_Grip.htm
scraped_at: 2025-09-08T16:15:04.944174
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Gradient](../html/N_Grasshopper_GUI_Gradient.htm
"Grasshopper.GUI.Gradient")

[GH_Grip Class](../html/T_Grasshopper_GUI_Gradient_GH_Grip.htm "GH_Grip
Class")

[GH_Grip Constructor
](../html/Overload_Grasshopper_GUI_Gradient_GH_Grip__ctor.htm "GH_Grip
Constructor ")

[GH_Grip Properties](../html/Properties_T_Grasshopper_GUI_Gradient_GH_Grip.htm
"GH_Grip Properties")

[GH_Grip Methods](../html/Methods_T_Grasshopper_GUI_Gradient_GH_Grip.htm
"GH_Grip Methods")

!Click or drag to
resize

# GH_Grip Class

---

Represents a grip in a gradient. A grip defines both where and how the colour
of a gradient changes.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.GradientGH_Grip

**Namespace:** Grasshopper.GUI.Gradient
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Grip : IComparable<GH_Grip>,
    	GH_ISerializable

    Public Class GH_Grip
    	Implements IComparable(Of GH_Grip), GH_ISerializable

The GH_Grip type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Grip| Initializes a new
instance of the GH_Grip class
|
GH_Grip(GH_Grip)|
Initializes a new instance of the GH_Grip class
| GH_Grip(Double,
Color)| Initializes a new
instance of the GH_Grip class
| GH_Grip(Double, Color,
Color)| Initializes a new
instance of the GH_Grip class
Top

Properties

| Name| Description
---|---|---
|
ColourLeft|  Gets the
colour to the left of this grip.
|
ColourRight|  Gets the
colour to the right of this grip.
|
GripId|  Gets the Grip ID.
|
IsValid|  Gets whether this
grip is valid. A valid grip must have a non-empty Id and a non-NaN parameter.
|
Parameter|  Gets or sets
the numeric parameter of the grip.
|
Selected|  Gets or sets
whether this grip is selected. Selection state is not (de)serialized.
|
Type|  Gets whether the colour
across this grip is smooth.
Top

Methods

| Name| Description
---|---|---
|
Blend|
|
CompareTo|
|
MutateId|  Create a new
grip ID.
|
Read|
|
Write|
Top

See Also

#### Reference

Grasshopper.GUI.Gradient Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com