---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_DocDiagramPainter.htm
scraped_at: 2025-09-08T16:14:36.845106
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_DocDiagramPainter
Class](../html/T_Grasshopper_GUI_Canvas_GH_DocDiagramPainter.htm
"GH_DocDiagramPainter Class")

[GH_DocDiagramPainter Constructor
](../html/M_Grasshopper_GUI_Canvas_GH_DocDiagramPainter__ctor.htm
"GH_DocDiagramPainter Constructor ")

[GH_DocDiagramPainter
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_GH_DocDiagramPainter.htm
"GH_DocDiagramPainter Properties")

[GH_DocDiagramPainter
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_DocDiagramPainter.htm
"GH_DocDiagramPainter Methods")

!Click or drag to
resize

# GH_DocDiagramPainter Class

---

This class paints diagrammatic images of a collection of objects.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_DocDiagramPainter

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DocDiagramPainter

    Public Class GH_DocDiagramPainter

The GH_DocDiagramPainter type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DocDiagramPainter|
Initializes a new instance of the GH_DocDiagramPainter class
Top

Properties

| Name| Description
---|---|---
|
BoundingBox|
Gets the 2D domain of the diagram in canvas coordinates.
|
DrawingBox|
Gets the 2D domain of the diagram in image coordinates.
|
IgnoreSelectedStates|
Gets or sets the Ignore Selected State flag. When set to True, selected
objects are not drawn in a different colour.
|
Image|  Gets the
diagram image (only available after a call to PaintDiagram().
|
Size|  Gets the
width and height (in pixels) of this diagram image.
|
Zoom|  Gets the zoom
factor for this diagram.
Top

Methods

| Name| Description
---|---|---
|
MapPoint(Point)|
|
MapPoint(PointF)|
|
MapRectangle|
|
MapX(Int32)|
|
MapX(Single)|
|
MapY(Int32)|
|
MapY(Single)|
|
PaintDiagram(IEnumerableIGH_DocumentObject, Int32,
Int32)|
Paint a diagram of a document.
|
PaintDiagram(IEnumerableIGH_DocumentObject, Int32, Int32,
Int32)|
Paint a diagram of a document.
|
UnmapPoint|
|
UnmapRectangle|
|
UnmapX|
|
UnmapY|
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com