---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Versioning.htm
scraped_at: 2025-09-08T16:11:51.105594
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper

Versioning Class

[Versioning Properties](../html/Properties_T_Grasshopper_Versioning.htm
"Versioning Properties")

[Versioning Methods](../html/Methods_T_Grasshopper_Versioning.htm "Versioning
Methods")

!Click or drag to
resize

# Versioning Class

---

Static class that provides information regarding the Grasshopper versioning.

Inheritance Hierarchy

SystemObject
GrasshopperVersioning

**Namespace:** Grasshopper
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Versioning

    Public NotInheritable Class Versioning

The Versioning type exposes the following members.

Properties

| Name| Description
---|---|---
!Static
member|
BuildDate|  Gets the build date
string. This is the visible release iteration tag. Typically the BuildDate is
just the date (MMMM-dd, yyyy), but it may carry a prefix or suffix for special
builds.
!Static
member| Version|
Gets the version of the current build of Grasshopper.
!Static
member|
VersionString|  Gets the version
of the current build of Grasshopper.
Top

Methods

| Name| Description
---|---|---
|
SyncVersionHistoryData|
Attempts to download the version history information. The downloaded data (if
the download works) will eventually be stored at:
Grasshopper.Folders.VersionHistoryFile
|
VersionHistoryData|  Gets
the currently most up-to-date version history data.
Top

See Also

#### Reference

Grasshopper Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com