---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_Author.htm
scraped_at: 2025-09-08T16:15:26.026135
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_Author Class](../html/T_Grasshopper_Kernel_GH_Author.htm "GH_Author
Class")

[GH_Author Constructor
](../html/Overload_Grasshopper_Kernel_GH_Author__ctor.htm "GH_Author
Constructor ")

[GH_Author Properties](../html/Properties_T_Grasshopper_Kernel_GH_Author.htm
"GH_Author Properties")

[GH_Author Methods](../html/Methods_T_Grasshopper_Kernel_GH_Author.htm
"GH_Author Methods")

!Click or drag to
resize

# GH_Author Class

---

Maintains author information such as name, company, copyright, address etc.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_Author

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Author : GH_ISerializable, IGH_Author

    Public Class GH_Author
    	Implements GH_ISerializable, IGH_Author

The GH_Author type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Author| Initializes a new
instance of the GH_Author class
|
GH_Author(IGH_Author)|
Initializes a new instance of the GH_Author class
Top

Properties

| Name| Description
---|---|---
|
Address|
|
Company|
|
Copyright|
|
EMail|
|
IsEmpty|  Gets whether any of
the fields have been assigned.
|
Name|
|
Phone|
|
Website|
Top

Methods

| Name| Description
---|---|---
|
Clear|  Erase all fields.
|
Read|
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com