---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Documentation_GH_Text.htm
scraped_at: 2025-09-08T16:12:05.167666
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Documentation](../html/N_Grasshopper_Documentation.htm
"Grasshopper.Documentation")

[GH_Text Class](../html/T_Grasshopper_Documentation_GH_Text.htm "GH_Text
Class")

[GH_Text
Properties](../html/Properties_T_Grasshopper_Documentation_GH_Text.htm
"GH_Text Properties")

[GH_Text Methods](../html/Methods_T_Grasshopper_Documentation_GH_Text.htm
"GH_Text Methods")

!Click or drag to
resize

# GH_Text Class

---

Represents a single string.

Inheritance Hierarchy

SystemObject
Grasshopper.DocumentationGH_Text

**Namespace:** Grasshopper.Documentation
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Text : IGH_Content

    Public Class GH_Text
    	Implements IGH_Content

The GH_Text type exposes the following members.

Properties

| Name| Description
---|---|---
|
Text|  Gets the text string.
Top

Methods

| Name| Description
---|---|---
|
Create|  Create a new
instance of GH_Text.
|
ToString|  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

See Also

#### Reference

Grasshopper.Documentation Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com