---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Guid.htm
scraped_at: 2025-09-08T16:20:45.415045
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Guid Class](../html/T_Grasshopper_Kernel_Types_GH_Guid.htm "GH_Guid
Class")

[GH_Guid Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Guid__ctor.htm "GH_Guid
Constructor ")

[GH_Guid Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Guid.htm
"GH_Guid Properties")

[GH_Guid Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Guid.htm
"GH_Guid Methods")

[GH_Guid Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Guid.htm
"GH_Guid Fields")

!Click or drag to
resize

# GH_Guid Class

---

Represents a globally unique identifier. GH_Guid re-implements the framework
System.Guid type.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooGuid
Grasshopper.Kernel.TypesGH_Guid

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Guid : GH_Goo<Guid>

    Public Class GH_Guid
    	Inherits GH_Goo(Of Guid)

The GH_Guid type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Guid|  Blank constructor
|
GH_Guid(GH_Guid)|
Initializes a new instance of the GH_Guid class
|
GH_Guid(Guid)| Initializes a
new instance of the GH_Guid class
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets the validity
of this instance. Guids are always valid.  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Inherited from
GH_GooT.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  (Overrides
GH_GooTCastToQ(Q).)
|
Duplicate|  (Overrides
GH_GooTDuplicate.)
|
DuplicateGuid|
|
EmitProxy|  (Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com