---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelTags.htm
scraped_at: 2025-09-08T16:22:41.908327
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelTags Structure](../html/T_Grasshopper_Rhinoceros_ModelTags.htm
"ModelTags Structure")

[ModelTags Constructor ](../html/M_Grasshopper_Rhinoceros_ModelTags__ctor.htm
"ModelTags Constructor ")

[ModelTags
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelTags.htm
"ModelTags Properties")

[ModelTags Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelTags.htm
"ModelTags Methods")

[ModelTags Operators and Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_ModelTags.htm
"ModelTags Operators and Type Conversions")

[ModelTags Fields](../html/Fields_T_Grasshopper_Rhinoceros_ModelTags.htm
"ModelTags Fields")

!Click or drag to
resize

# ModelTags Structure

---

Represents an immutable set of strings.

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct ModelTags : GH_ISerializable, IReadOnlyCollection<string>,
    	IEquatable<ModelTags>, IStructuralEquatable, IComparable, IComparable<ModelTags>

    Public Structure ModelTags
    	Implements GH_ISerializable, IReadOnlyCollection(Of String),
    	IEquatable(Of ModelTags), IStructuralEquatable, IComparable, IComparable(Of ModelTags)

The ModelTags type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelTags| Initializes a new
instance of the ModelTags class
Top

Properties

| Name| Description
---|---|---
|
Count|
|
IsDefault|
|
IsDefaultOrEmpty|
|
IsEmpty|
Top

Methods

| Name| Description
---|---|---
|
AddRange|
|
CompareTo(ModelTags)|
|
CompareTo(Object)|
|
Contains|
|
Equals(ModelTags)|
|
Equals(Object)|  (Overrides
[ValueTypeEquals(Object)](https://docs.microsoft.com/dotnet/api/system.valuetype.equals#system-
valuetype-equals\(system-object\)).)
|
GetEnumerator|
|
GetHashCode|  (Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
|
RemoveRange|
|
ToString|  (Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Operators

| Name| Description
---|---|---
!Static
member|
Addition|
!Static
member|
Equality|
!Static
member| (ModelTags to
String)|
!Static
member| (String to
ModelTags)|
!Static
member|
Inequality|
!Static
member|
Subtraction|
Top

Fields

| Name| Description
---|---|---
|
Empty|
Top

Remarks

Comparison is not case sensitive.

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com