---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Gradient_GH_GradientChangedEventArgs.htm
scraped_at: 2025-09-08T16:15:03.924295
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Gradient](../html/N_Grasshopper_GUI_Gradient.htm
"Grasshopper.GUI.Gradient")

[GH_GradientChangedEventArgs
Class](../html/T_Grasshopper_GUI_Gradient_GH_GradientChangedEventArgs.htm
"GH_GradientChangedEventArgs Class")

[GH_GradientChangedEventArgs Constructor
](../html/M_Grasshopper_GUI_Gradient_GH_GradientChangedEventArgs__ctor.htm
"GH_GradientChangedEventArgs Constructor ")

[GH_GradientChangedEventArgs
Properties](../html/Properties_T_Grasshopper_GUI_Gradient_GH_GradientChangedEventArgs.htm
"GH_GradientChangedEventArgs Properties")

!Click or drag to
resize

# GH_GradientChangedEventArgs Class

---

Arguments for te GradientChanged event.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.GUI.GradientGH_GradientChangedEventArgs

**Namespace:** Grasshopper.GUI.Gradient
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_GradientChangedEventArgs : EventArgs

    Public Class GH_GradientChangedEventArgs
    	Inherits EventArgs

The GH_GradientChangedEventArgs type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_GradientChangedEventArgs|
Initializes a new instance of the GH_GradientChangedEventArgs class
Top

Properties

| Name| Description
---|---|---
|
Gradient|
Gets the gradient that raised this event.
|
Intermediate|
Gets whether this event is intermediate. I.e. whether it will be followed by
another, similar event.
Top

See Also

#### Reference

Grasshopper.GUI.Gradient Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com