---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_CapsuleRenderEngine.htm
scraped_at: 2025-09-08T16:14:35.852898
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_CapsuleRenderEngine
Class](../html/T_Grasshopper_GUI_Canvas_GH_CapsuleRenderEngine.htm
"GH_CapsuleRenderEngine Class")

[GH_CapsuleRenderEngine
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_CapsuleRenderEngine.htm
"GH_CapsuleRenderEngine Methods")

!Click or drag to
resize

# GH_CapsuleRenderEngine Class

---

Provides basic Render methods for capsule display. You typically don't need
this class, just use the Render() overloads on GH_Capsule directly.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_CapsuleRenderEngine

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_CapsuleRenderEngine

    Public Class GH_CapsuleRenderEngine

The GH_CapsuleRenderEngine type exposes the following members.

Methods

| Name| Description
---|---|---
|
CreateHighlightBar(Rectangle, Int32,
Int32)|
Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
|
CreateHighlightBar(Rectangle, Int32, Int32,
Int32)|
Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
|
CreateHighlightBar(Rectangle, Int32, Int32, Boolean,
Boolean)|
Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
|
CreateHighlightBar(Rectangle, Int32, Int32, Int32, Boolean,
Boolean)|
Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
|
CreateJaggedRectangle|
Static (Shared in VB) method for creating rectangles with rounded corners.
|
CreateRoundedRectangle(Rectangle,
Int32)|
Static (Shared in VB) method for creating rectangles with rounded corners.
|
CreateRoundedRectangle(RectangleF,
Single)|
Static (Shared in VB) method for creating rectangles with rounded corners.
|
CreateRoundedRectangle(Rectangle, Int32, Int32, Int32,
Int32)|
Static (Shared in VB) method for creating rectangles with rounded corners.
|
CreateRoundedRectangle(RectangleF, Single, Single, Single,
Single)|
Static (Shared in VB) method for creating rectangles with rounded corners.
|
GetImpliedPalette|
Static (Shared in VB) method for solving which palette is the default given a
specific object's properties. Default palettes are either GH_Palette.Normal,
GH_Palette.Warning or GH_Palette.Error depending on the objects' runtime
message level.
|
GetImpliedStyle(GH_Palette,
IGH_Attributes)|
Static (Shared in VB) method for solving which palette style is implied by the
properties.
|
GetImpliedStyle(GH_Palette, Boolean, Boolean,
Boolean)|
Static (Shared in VB) method for solving which palette style is implied by the
properties.
|
RenderAlphaFill|
Render a standard transparancy background hatch. This is only needed when the
capsule background colour is not fully opaque. This is usually the second
stage in a capsule rendering, right after the Grips are drawn.
|
RenderBackground|
Render a default capsule background fill. This is usually the third stage in a
capsule rendering.
|
RenderBackground_Alternative|
Render a custom capsule background fill. This is usually the third stage in a
capsule rendering.
|
RenderBoundaryDots|
Render a collection of boundary dots along the top edge of the capsule.
|
RenderGrips|
Render all the grips associates with the capsule. Grips are not drawn if the
zoom level is less than 50%. This is usually the first stage in a Capsule
rendering.
|
RenderGrips_Alternative|
Render all the grips associates with the capsule as semi-circles. This is
needed if the capsule background is not fully opaque. Grips are not drawn if
the zoom level is less than 50%. This is usually the first stage in a Capsule
rendering.
|
RenderHighlight|
Render a highlight bar. This is highly zoom-dependant. Highlight rendering is
usually the fourth stage in a Capsule Rendering, after the background but
prior to the edges.
| RenderIcon(Graphics, Image, Int32,
Int32)|
Render an image icon centered into the box. If the content box has been
defined the icon will be centered there, otherwise the outline box will be
used.
| RenderIcon(Graphics, Image,
RectangleF, Int32,
Int32)|
Render an image icon centered into the box. If the content box has been
defined the icon will be centered there, otherwise the outline box will be
used.
|
RenderInputGrip|
Static (Shared in VB) method to render a default input grip.
|
RenderMessage|
Render a text message underneath the capsule.
|
RenderOutlines|
Render default capsule outlines. If the zoom factor is less than 50% the inner
outline is not drawn. This is usually the fifth stage in a Capsule rendering.
|
RenderOutputGrip|
Static (Shared in VB) method to render a default output grip.
|
RenderText|
Render the capsule text. This is usually the sixth and final stage in a
capsule rendering.
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com