---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_Path.htm
scraped_at: 2025-09-08T16:19:06.008456
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

GH_Path Class

[GH_Path Constructor
](../html/Overload_Grasshopper_Kernel_Data_GH_Path__ctor.htm "GH_Path
Constructor ")

[GH_Path Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_Path.htm
"GH_Path Properties")

[GH_Path Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_Path.htm
"GH_Path Methods")

[GH_Path Operators](../html/Operators_T_Grasshopper_Kernel_Data_GH_Path.htm
"GH_Path Operators")

!Click or drag to
resize

# GH_Path Class

---

Describes the path in structure space of a data item or a list of items. A
path consists of a series of integers, each one of which represents an index
in a branch structure.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_Path

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Path : IComparable<GH_Path>,
    	IComparer<GH_Path>, GH_ISerializable

    Public Class GH_Path
    	Implements IComparable(Of GH_Path), IComparer(Of GH_Path),
    	GH_ISerializable

The GH_Path type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Path|  Default constructor,
creates a path with zero elements.
|
GH_Path(GH_Path)|  Creates an
exact copy of another path.
|
GH_Path(Int32)|  Creates a
new path with a single element.
|
GH_Path(Int32)|  Creates a
new path from a series of elements.
Top

Properties

| Name| Description
---|---|---
|
Indices|  Gets or sets the
entire index space; the path that identifies an element in structure space.
You should not change the index space when the path is used inside a structure
since it will invalidate the sort order. If you don't know what you're doing,
for Pete's sake don't touch this.
|
Length|  Returns the number of
dimensions in the path.
|
Valid|  Gets whether this path
is valid. Invalid paths either have no elements or negative elements.
Top

Methods

| Name| Description
---|---|---
|
AppendElement|  Create
a new path by appending a new index value to this path.
|
Compare|  Compare two paths.
This function determines the Sorting behaviour of paths.
|
CompareTo|  Compare this
path to another path. This function determines the Sorting behaviour of paths.
|
CullElement|  Removes the
last index value from the path. If the path is already empty, nothing will
happen.
|
CullFirstElement|
Removes the first index value from the path. If the path is already empty,
nothing will happen.
|
Format|  Format a path.
|
FromString|  Try to
deserialize a GH_Path from a String.
|
GetHashCode|  Specialized
Hash code pattern.  (Overrides
[ObjectGetHashCode](https://docs.microsoft.com/dotnet/api/system.object.gethashcode#system-
object-gethashcode).)
|
Increment(Int32)|
Increment a specific index in this path by one.
| Increment(Int32,
Int32)|  Increment a
specific index in this path by one.
|
IsAncestor|  Test another
path to see if it is an ancestor of this path. For a path to be considered an
ancestor, it must share the initial dimensions.
|
IsCoincident(GH_Path)|
Test to see if this path is coincident with another path.
|
IsCoincident(Int32)|
Test to see if this path is coincident with set of integers.
|
PrependElement|
Create a new path by prepending a new index value to this path.
|
Read|  Read this path from an
archive.
|
SplitPathLikeString|
Try to split up a path-like formatted string "{A;B;C}(i)" into component
parts.
|
ToString|  Concatenates the
indices in the path.  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
ToString(Boolean)|
Concatenates the indices in the path.
|
Write|  Write this path to an
archive.
Top

Operators

| Name| Description
---|---|---
!Static
member|
Equality|
!Static
member|
GreaterThan|
!Static
member|
Inequality|
!Static
member|
LessThan|
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com