---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_FontServer.htm
scraped_at: 2025-09-08T16:16:49.385743
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_FontServer Class](../html/T_Grasshopper_Kernel_GH_FontServer.htm
"GH_FontServer Class")

[GH_FontServer
Properties](../html/Properties_T_Grasshopper_Kernel_GH_FontServer.htm
"GH_FontServer Properties")

[GH_FontServer Methods](../html/Methods_T_Grasshopper_Kernel_GH_FontServer.htm
"GH_FontServer Methods")

[GH_FontServer Events](../html/Events_T_Grasshopper_Kernel_GH_FontServer.htm
"GH_FontServer Events")

!Click or drag to
resize

# GH_FontServer Class

---

Maintains a collection of standard fonts and mays to measure them.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_FontServer

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_FontServer

    Public NotInheritable Class GH_FontServer

The GH_FontServer type exposes the following members.

Properties

| Name| Description
---|---|---
!Static
member|
Console|
FontFamily.GenericMonospace, 10pt, regular
!Static
member|
ConsoleAdjusted|
FontFamily.GenericMonospace, 10pt, regular, adjusted to counter UI scaling.
!Static
member|
ConsoleSmall|
FontFamily.GenericMonospace, 8pt, regular
!Static
member|
ConsoleSmallAdjusted|
FontFamily.GenericMonospace, 8pt, regular, adjusted to counter UI scaling.
!Static
member|
FamilyConsole|  Gets
or sets the FontFamily used for monospaced fonts in Grasshopper.
!Static
member|
FamilyScript|  Gets or
sets the FontFamily used for scripted fonts in Grasshopper.
!Static
member|
FamilyStandard|  Gets
or sets the FontFamily used for standard fonts in Grasshopper.
!Static
member|
Large|
SystemFonts.CaptionFont, 10pt, bold
!Static
member|
LargeAdjusted|
SystemFonts.CaptionFont, 10pt, bold, adjusted for logical pixel size.
!Static
member|
Script|
FontFamily.GenericSansSerif, 10pt, italic
!Static
member|
ScriptSmall|
FontFamily.GenericSansSerif, 8pt, italic
!Static
member|
Small|
SystemFonts.CaptionFont, 6pt, regular
!Static
member|
Standard|
SystemFonts.CaptionFont, 8pt, regular
!Static
member|
StandardAdjusted|
SystemFonts.CaptionFont, 8pt, regular, adjusted for logical pixel size.
!Static
member|
StandardBold|
SystemFonts.CaptionFont, 8pt, bold
!Static
member|
StandardItalic|
SystemFonts.CaptionFont, 8pt, italic
Top

Methods

| Name| Description
---|---|---
|
FontToString|  Convert
a font to a string.
|
MeasureString(String,
Font)|  Measure the
size of a string
|
MeasureString(String, Font,
SizeF)|  Measure the
size of a string
|
MeasureString(String, Font,
Single)|  Measure the
size of a string
|
NewFont(Font, FontStyle)|
Safe font constructor.
|
NewFont(Font, Single)|
Safe font constructor.
|
NewFont(FontFamily,
Single)|  Safe font
constructor.
|
NewFont(Font, Single,
FontStyle)|  Safe font
constructor.
|
NewFont(FontFamily, Single,
FontStyle)|  Safe font
constructor.
|
NewFont(String, Single,
FontStyle)|  High level
function for Font creation. We've ran into loads of trouble in the past with
missing Fonts. _Never_ create a font directly via GDI+, _always_ use this
method.
|
StringToFont|  Convert
a font description string back into a font.
|
StringWidth(IEnumerableString,
Font)|  Measure the
maximum width of a collection of strings
|
StringWidth(String,
Font)|  Measure the
width of a string in pixels
Top

Events

| Name| Description
---|---|---
|
ConsoleFamilyChanged|
Raised whenever the MonospacedFamily is changed.
|
ScriptFamilyChanged|
Raised whenever the ScriptFamily is changed.
|
StandardFamilyChanged|
Raised whenever the StandardFamily is changed.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com