---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Expressions_GH_ParserSymbol.htm
scraped_at: 2025-09-08T16:19:40.140764
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Expressions](../html/N_Grasshopper_Kernel_Expressions.htm
"Grasshopper.Kernel.Expressions")

[GH_ParserSymbol
Class](../html/T_Grasshopper_Kernel_Expressions_GH_ParserSymbol.htm
"GH_ParserSymbol Class")

[GH_ParserSymbol Constructor
](../html/Overload_Grasshopper_Kernel_Expressions_GH_ParserSymbol__ctor.htm
"GH_ParserSymbol Constructor ")

[GH_ParserSymbol
Methods](../html/Methods_T_Grasshopper_Kernel_Expressions_GH_ParserSymbol.htm
"GH_ParserSymbol Methods")

[GH_ParserSymbol
Fields](../html/Fields_T_Grasshopper_Kernel_Expressions_GH_ParserSymbol.htm
"GH_ParserSymbol Fields")

!Click or drag to
resize

# GH_ParserSymbol Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.ExpressionsGH_ParserSymbol

**Namespace:**
Grasshopper.Kernel.Expressions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ParserSymbol : IComparable<GH_ParserSymbol>

    Public Class GH_ParserSymbol
    	Implements IComparable(Of GH_ParserSymbol)

The GH_ParserSymbol type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ParserSymbol|
Initializes a new instance of the GH_ParserSymbol class
| GH_ParserSymbol(String,
GH_ParserTokenClass,
GH_ParserPrecedence)|
Initializes a new instance of the GH_ParserSymbol class
Top

Methods

| Name| Description
---|---|---
|
CompareTo|
|
Equals|
(Overrides
[ObjectEquals(Object)](https://docs.microsoft.com/dotnet/api/system.object.equals#system-
object-equals\(system-object\)).)
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

Fields

| Name| Description
---|---|---
|
m_class|
|
m_level|
|
m_token|
Top

See Also

#### Reference

Grasshopper.Kernel.Expressions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com