---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_BakeAwareObject.htm
scraped_at: 2025-09-08T16:18:16.752740
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_BakeAwareObject
Interface](../html/T_Grasshopper_Kernel_IGH_BakeAwareObject.htm
"IGH_BakeAwareObject Interface")

[IGH_BakeAwareObject
Properties](../html/Properties_T_Grasshopper_Kernel_IGH_BakeAwareObject.htm
"IGH_BakeAwareObject Properties")

[IGH_BakeAwareObject
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_BakeAwareObject.htm
"IGH_BakeAwareObject Methods")

!Click or drag to
resize

# IGH_BakeAwareObject Interface

---

Implement this interface on your IGH_ActiveObject if you want to participate
in the Bake GUI.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_BakeAwareObject

    Public Interface IGH_BakeAwareObject

The IGH_BakeAwareObject type exposes the following members.

Properties

| Name| Description
---|---|---
|
IsBakeCapable|
Gets a value indicating whether or not the object can potentially Bake data in
its current state.
Top

Methods

| Name| Description
---|---|---
| BakeGeometry(RhinoDoc,
ListGuid)|  Bake
all the goemetry in this object in the given Rhino document.
| BakeGeometry(RhinoDoc,
ObjectAttributes,
ListGuid)|  Bake
all the goemetry in this object in the given Rhino document.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com