---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelUnitSystem_Value.htm
scraped_at: 2025-09-08T16:22:43.917282
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelUnitSystem.Value
Structure](../html/T_Grasshopper_Rhinoceros_ModelUnitSystem_Value.htm
"ModelUnitSystem.Value Structure")

[Value Constructor
](../html/Overload_Grasshopper_Rhinoceros_ModelUnitSystem_Value__ctor.htm
"Value Constructor ")

[Value
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelUnitSystem_Value.htm
"Value Properties")

[Value
Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelUnitSystem_Value.htm
"Value Methods")

[Value
Operators](../html/Operators_T_Grasshopper_Rhinoceros_ModelUnitSystem_Value.htm
"Value Operators")

[Value
Fields](../html/Fields_T_Grasshopper_Rhinoceros_ModelUnitSystem_Value.htm
"Value Fields")

!Click or drag to
resize

# ModelUnitSystemValue Structure

---

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct Value : GH_ISerializable, IEquatable<ModelUnitSystemValue>,
    	IComparable<ModelUnitSystemValue>, IComparable

    Public Structure Value
    	Implements GH_ISerializable, IEquatable(Of ModelUnitSystemValue),
    	IComparable(Of ModelUnitSystemValue), IComparable

The ModelUnitSystemValue type exposes the following members.

Constructors

| Name| Description
---|---|---
| ModelUnitSystemValue(ActiveSpace,
String)|
Initializes a new instance of the ModelUnitSystemValue class
| ModelUnitSystemValue(UnitSystem,
String)|
Initializes a new instance of the ModelUnitSystemValue class
| ModelUnitSystemValue(UnitSystem,
String, Double)|
Initializes a new instance of the ModelUnitSystemValue class
|
ModelUnitSystemValue(ModelUnitSystemValue, String,
NullableDouble)|
Initializes a new instance of the ModelUnitSystemValue class
Top

Properties

| Name| Description
---|---|---
|
ActiveSpace|
|
BaseSystem|
|
Factor|
!Static
member|
Feet|
!Static
member|
Inches|
!Static
member|
Meters|
|
MetersPerUnit|
!Static
member|
Millimeters|
!Static
member|
ModelUnits|
|
Name|
!Static
member|
None|
!Static
member|
PageUnits|
|
Symbol|
!Static
member|
Unset|
Top

Methods

| Name| Description
---|---|---
|
AdjustDocumentUnitSystem|
|
CompareTo(Object)|
|
CompareTo(ModelUnitSystemValue)|
|
Equals(Object)|
(Overrides
[ValueTypeEquals(Object)](https://docs.microsoft.com/dotnet/api/system.valuetype.equals#system-
valuetype-equals\(system-object\)).)
|
Equals(ModelUnitSystemValue)|
|
GetHashCode|
(Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
|
ToNonCustomUnitSystem|
|
ToString|
(Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
|
ToUnitSystem|
Top

Operators

| Name| Description
---|---|---
!Static
member|
Equality|
!Static
member|
Inequality|
Top

Fields

| Name| Description
---|---|---
|
_MetersPerUnit|
Top

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com