---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Base_GH_SliderEventArgs.htm
scraped_at: 2025-09-08T16:13:50.618202
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Base](../html/N_Grasshopper_GUI_Base.htm
"Grasshopper.GUI.Base")

[GH_SliderEventArgs
Class](../html/T_Grasshopper_GUI_Base_GH_SliderEventArgs.htm
"GH_SliderEventArgs Class")

[GH_SliderEventArgs
Properties](../html/Properties_T_Grasshopper_GUI_Base_GH_SliderEventArgs.htm
"GH_SliderEventArgs Properties")

!Click or drag to
resize

# GH_SliderEventArgs Class

---

Arguments passed via GH_SliderBase.ValueChanged events.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.GUI.BaseGH_SliderEventArgs

**Namespace:** Grasshopper.GUI.Base
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_SliderEventArgs : EventArgs

    Public Class GH_SliderEventArgs
    	Inherits EventArgs

The GH_SliderEventArgs type exposes the following members.

Properties

| Name| Description
---|---|---
|
Intermediate|
Gets a value indicating whether the change was an intermediate one.
|
Slider|  Gets the
instance of the slider that raised the event.
|
Value|  Gets the new
value of the slider. This value is cached, so even if the slider subsequently
updates, this property remains constant.
Top

See Also

#### Reference

Grasshopper.GUI.Base Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com