---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Expressions_GH_ExpressionString.htm
scraped_at: 2025-09-08T16:19:35.128636
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Expressions](../html/N_Grasshopper_Kernel_Expressions.htm
"Grasshopper.Kernel.Expressions")

[GH_ExpressionString
Class](../html/T_Grasshopper_Kernel_Expressions_GH_ExpressionString.htm
"GH_ExpressionString Class")

[GH_ExpressionString Constructor
](../html/M_Grasshopper_Kernel_Expressions_GH_ExpressionString__ctor.htm
"GH_ExpressionString Constructor ")

[GH_ExpressionString
Properties](../html/Properties_T_Grasshopper_Kernel_Expressions_GH_ExpressionString.htm
"GH_ExpressionString Properties")

[GH_ExpressionString
Methods](../html/Methods_T_Grasshopper_Kernel_Expressions_GH_ExpressionString.htm
"GH_ExpressionString Methods")

[GH_ExpressionString
Fields](../html/Fields_T_Grasshopper_Kernel_Expressions_GH_ExpressionString.htm
"GH_ExpressionString Fields")

!Click or drag to
resize

# GH_ExpressionString Class

---

Inheritance Hierarchy

SystemObject
System.Collections.GenericListChar
Grasshopper.Kernel.ExpressionsGH_ExpressionString

**Namespace:**
Grasshopper.Kernel.Expressions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ExpressionString : List<char>

    Public Class GH_ExpressionString
    	Inherits List(Of Char)

The GH_ExpressionString type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ExpressionString|
Initializes a new instance of the GH_ExpressionString class
Top

Properties

| Name| Description
---|---|---
|
Char|
|
Next|
|
Prev|
Top

Methods

| Name| Description
---|---|---
|
BuildLUT|
|
IsWhiteSpace|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

Fields

| Name| Description
---|---|---
!Static
member|
bracket_closed|
!Static
member|
bracket_open|
!Static
member|
colon|
!Static
member|
comma|
!Static
member|
dot|
!Static
member|
dquote|
!Static
member|
invalid|
!Static
member|
linefeed|
|
m_t|
!Static
member|
paren_close|
!Static
member|
paren_open|
!Static
member|
quote|
!Static
member|
return|
!Static
member|
scolon|
!Static
member|
space|
!Static
member|
tab|
!Static
member|
underbar|
Top

See Also

#### Reference

Grasshopper.Kernel.Expressions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com