---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_CustomEventServer.htm
scraped_at: 2025-09-08T16:15:58.169266
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_CustomEventServer
Class](../html/T_Grasshopper_Kernel_GH_CustomEventServer.htm
"GH_CustomEventServer Class")

[GH_CustomEventServer Constructor
](../html/M_Grasshopper_Kernel_GH_CustomEventServer__ctor.htm
"GH_CustomEventServer Constructor ")

[GH_CustomEventServer
Properties](../html/Properties_T_Grasshopper_Kernel_GH_CustomEventServer.htm
"GH_CustomEventServer Properties")

!Click or drag to
resize

# GH_CustomEventServer Class

---

RhinoCommon only event server.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_CustomEventServer

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_CustomEventServer

    Public Class GH_CustomEventServer

The GH_CustomEventServer type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_CustomEventServer|
Create and register a new event server.
Top

Properties

| Name| Description
---|---|---
|
Enabled|  Gets or
sets the enabled state flag for this event watcher.
|
GuidTable|  Gets
direct access to the internal guid table. The table contains pairs of object
Ids and runtime serial numbers.
|
GuidTableCount|
Gets the number of stored ids in the Guid Table.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com