---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Plane_GH_PlaneProxy.htm
scraped_at: 2025-09-08T16:21:15.533663
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Plane.GH_PlaneProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Plane_GH_PlaneProxy.htm
"GH_Plane.GH_PlaneProxy Class")

[GH_Plane.GH_PlaneProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Plane_GH_PlaneProxy__ctor.htm
"GH_Plane.GH_PlaneProxy Constructor ")

[GH_PlaneProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Plane_GH_PlaneProxy.htm
"GH_PlaneProxy Properties")

[GH_PlaneProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Plane_GH_PlaneProxy.htm
"GH_PlaneProxy Methods")

!Click or drag to
resize

# GH_PlaneGH_PlaneProxy Class

---

Proxy description of GH_Plane class. This class is used by the Generic
Multivalue interfaces.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Plane
Grasshopper.Kernel.TypesGH_PlaneGH_PlaneProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PlaneProxy : GH_GooProxy<GH_Plane>

    Public Class GH_PlaneProxy
    	Inherits GH_GooProxy(Of GH_Plane)

The GH_PlaneGH_PlaneProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PlaneGH_PlaneProxy|
Initializes a new instance of the GH_PlaneGH_PlaneProxy class
Top

Properties

| Name| Description
---|---|---
|
Origin|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
|
XAxis|
|
YAxis|
|
ZAxis|
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com