---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_ColourPicker.htm
scraped_at: 2025-09-08T16:12:18.203414
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_ColourPicker Class](../html/T_Grasshopper_GUI_GH_ColourPicker.htm
"GH_ColourPicker Class")

[GH_ColourPicker Constructor
](../html/M_Grasshopper_GUI_GH_ColourPicker__ctor.htm "GH_ColourPicker
Constructor ")

[GH_ColourPicker
Properties](../html/Properties_T_Grasshopper_GUI_GH_ColourPicker.htm
"GH_ColourPicker Properties")

[GH_ColourPicker
Methods](../html/Methods_T_Grasshopper_GUI_GH_ColourPicker.htm
"GH_ColourPicker Methods")

[GH_ColourPicker Events](../html/Events_T_Grasshopper_GUI_GH_ColourPicker.htm
"GH_ColourPicker Events")

!Click or drag to
resize

# GH_ColourPicker Class

---

Provides the standard Grasshopper Colour picker as a winforms Control.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsUserControl
Grasshopper.GUIGH_ColourPicker

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ColourPicker : UserControl

    Public Class GH_ColourPicker
    	Inherits UserControl

The GH_ColourPicker type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ColourPicker| Initializes a
new instance of the GH_ColourPicker class
Top

Properties

| Name| Description
---|---|---
|
AllowNumericInput|
Gets or sets whether this colour picker pops up a textbox on channel slider
double clicks.
|
Colour|  Gets or sets the
colour currently specified in the picker.
|
DesiredHeight|  Gets
the ideal height for this control given the current width and UI settings.
|
ShowAlphaSlider|
Gets or sets whether the alpha channel slider is included.
|
ShowChannelSliders|
Gets or sets whether the channel sliders are included.
Top

Methods

| Name| Description
---|---|---
|
Dispose| Releases the
unmanaged resources used by the GH_ColourPicker and optionally releases the
managed resources (Overrides
[ContainerControlDispose(Boolean)](https://docs.microsoft.com/dotnet/api/system.windows.forms.containercontrol.dispose#system-
windows-forms-containercontrol-dispose\(system-boolean\)).)
|
OnPaint|  (Overrides
[ControlOnPaint(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.control.onpaint#system-
windows-forms-control-onpaint\(system-windows-forms-painteventargs\)).)
|
OnPaintBackground|
(Overrides
[ScrollableControlOnPaintBackground(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.scrollablecontrol.onpaintbackground#system-
windows-forms-scrollablecontrol-onpaintbackground\(system-windows-forms-
painteventargs\)).)
Top

Events

| Name| Description
---|---|---
|
ColourChanged|  Raised
whenever the value of the slider is changed via GUI interaction.
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com