---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Point_GH_PointProxy.htm
scraped_at: 2025-09-08T16:21:17.570607
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Point.GH_PointProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Point_GH_PointProxy.htm
"GH_Point.GH_PointProxy Class")

[GH_Point.GH_PointProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Point_GH_PointProxy__ctor.htm
"GH_Point.GH_PointProxy Constructor ")

[GH_PointProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Point_GH_PointProxy.htm
"GH_PointProxy Properties")

[GH_PointProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Point_GH_PointProxy.htm
"GH_PointProxy Methods")

!Click or drag to
resize

# GH_PointGH_PointProxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Point
Grasshopper.Kernel.TypesGH_PointGH_PointProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PointProxy : GH_GooProxy<GH_Point>

    Public Class GH_PointProxy
    	Inherits GH_GooProxy(Of GH_Point)

The GH_PointGH_PointProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PointGH_PointProxy|
Initializes a new instance of the GH_PointGH_PointProxy class
Top

Properties

| Name| Description
---|---|---
|
Distance|
|
Referenced|
|
ReferenceID|
|
ReferenceType|
|
TParameterRatio|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
UVParameterRatio|
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
|
X|
|
Y|
|
Z|
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
SrfRefChanged|
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com