---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_MenuTextBox_TextChangedEventHandler.htm
scraped_at: 2025-09-08T16:12:55.379832
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_AnimationPhase
Enumeration](../html/T_Grasshopper_GUI_GH_AnimationPhase.htm
"GH_AnimationPhase Enumeration")

[GH_Animator Class](../html/T_Grasshopper_GUI_GH_Animator.htm "GH_Animator
Class")

[GH_Animator(T) Class](../html/T_Grasshopper_GUI_GH_Animator_1.htm
"GH_Animator\(T\) Class")

[GH_Animator(T).Interpolate
Delegate](../html/T_Grasshopper_GUI_GH_Animator_1_Interpolate.htm
"GH_Animator\(T\).Interpolate Delegate")

[GH_AsynchFileData Class](../html/T_Grasshopper_GUI_GH_AsynchFileData.htm
"GH_AsynchFileData Class")

[GH_AsynchFileData.FileChangedDelegate
Delegate](../html/T_Grasshopper_GUI_GH_AsynchFileData_FileChangedDelegate.htm
"GH_AsynchFileData.FileChangedDelegate Delegate")

[GH_BezierSolver Class](../html/T_Grasshopper_GUI_GH_BezierSolver.htm
"GH_BezierSolver Class")

[GH_CanvasMouseEvent Class](../html/T_Grasshopper_GUI_GH_CanvasMouseEvent.htm
"GH_CanvasMouseEvent Class")

[GH_CanvasObjectMouseDownEventArgs
Class](../html/T_Grasshopper_GUI_GH_CanvasObjectMouseDownEventArgs.htm
"GH_CanvasObjectMouseDownEventArgs Class")

[GH_ColourPicker Class](../html/T_Grasshopper_GUI_GH_ColourPicker.htm
"GH_ColourPicker Class")

[GH_ColourPicker.ColourChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_ColourPicker_ColourChangedEventHandler.htm
"GH_ColourPicker.ColourChangedEventHandler Delegate")

[GH_ColourSwatchEventArgs
Class](../html/T_Grasshopper_GUI_GH_ColourSwatchEventArgs.htm
"GH_ColourSwatchEventArgs Class")

[GH_Constraint Enumeration](../html/T_Grasshopper_GUI_GH_Constraint.htm
"GH_Constraint Enumeration")

[GH_CursorServer Class](../html/T_Grasshopper_GUI_GH_CursorServer.htm
"GH_CursorServer Class")

[GH_DebugLogForm Class](../html/T_Grasshopper_GUI_GH_DebugLogForm.htm
"GH_DebugLogForm Class")

[GH_DigitScroller Class](../html/T_Grasshopper_GUI_GH_DigitScroller.htm
"GH_DigitScroller Class")

[GH_DigitScroller.ValueChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_DigitScroller_ValueChangedEventHandler.htm
"GH_DigitScroller.ValueChangedEventHandler Delegate")

[GH_DocumentEditor Class](../html/T_Grasshopper_GUI_GH_DocumentEditor.htm
"GH_DocumentEditor Class")

[GH_DocumentEditor.AggregateShortcutMenuItemsEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_DocumentEditor_AggregateShortcutMenuItemsEventHandler.htm
"GH_DocumentEditor.AggregateShortcutMenuItemsEventHandler Delegate")

[GH_DocumentEditor.EditorFoldStateChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_DocumentEditor_EditorFoldStateChangedEventHandler.htm
"GH_DocumentEditor.EditorFoldStateChangedEventHandler Delegate")

[GH_DoubleBufferedPanel
Class](../html/T_Grasshopper_GUI_GH_DoubleBufferedPanel.htm
"GH_DoubleBufferedPanel Class")

[GH_DragInfo Class](../html/T_Grasshopper_GUI_GH_DragInfo.htm "GH_DragInfo
Class")

[GH_EtoUtil Class](../html/T_Grasshopper_GUI_GH_EtoUtil.htm "GH_EtoUtil
Class")

[GH_ExternalFileConflictDialog
Class](../html/T_Grasshopper_GUI_GH_ExternalFileConflictDialog.htm
"GH_ExternalFileConflictDialog Class")

[GH_FadeAnimation Class](../html/T_Grasshopper_GUI_GH_FadeAnimation.htm
"GH_FadeAnimation Class")

[GH_FadePhase Enumeration](../html/T_Grasshopper_GUI_GH_FadePhase.htm
"GH_FadePhase Enumeration")

[GH_FontControl Class](../html/T_Grasshopper_GUI_GH_FontControl.htm
"GH_FontControl Class")

[GH_FontList Class](../html/T_Grasshopper_GUI_GH_FontList.htm "GH_FontList
Class")

[GH_FontPicker Class](../html/T_Grasshopper_GUI_GH_FontPicker.htm
"GH_FontPicker Class")

[GH_FontScroller Class](../html/T_Grasshopper_GUI_GH_FontScroller.htm
"GH_FontScroller Class")

[GH_FontScroller.PostPaint
Delegate](../html/T_Grasshopper_GUI_GH_FontScroller_PostPaint.htm
"GH_FontScroller.PostPaint Delegate")

[GH_FormShepard Class](../html/T_Grasshopper_GUI_GH_FormShepard.htm
"GH_FormShepard Class")

[GH_GDI_Util Class](../html/T_Grasshopper_GUI_GH_GDI_Util.htm "GH_GDI_Util
Class")

[GH_GeometricFont Class](../html/T_Grasshopper_GUI_GH_GeometricFont.htm
"GH_GeometricFont Class")

[GH_GraphicsUtil Class](../html/T_Grasshopper_GUI_GH_GraphicsUtil.htm
"GH_GraphicsUtil Class")

[GH_HorizontalSeparator
Class](../html/T_Grasshopper_GUI_GH_HorizontalSeparator.htm
"GH_HorizontalSeparator Class")

[GH_IconLabel Class](../html/T_Grasshopper_GUI_GH_IconLabel.htm "GH_IconLabel
Class")

[GH_IconPicker Class](../html/T_Grasshopper_GUI_GH_IconPicker.htm
"GH_IconPicker Class")

[GH_Interpolation Enumeration](../html/T_Grasshopper_GUI_GH_Interpolation.htm
"GH_Interpolation Enumeration")

[GH_LoadProtectDialog
Class](../html/T_Grasshopper_GUI_GH_LoadProtectDialog.htm
"GH_LoadProtectDialog Class")

[GH_MaterialPreviewControl
Class](../html/T_Grasshopper_GUI_GH_MaterialPreviewControl.htm
"GH_MaterialPreviewControl Class")

[GH_MaterialPreviewControl.ColourChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_MaterialPreviewControl_ColourChangedEventHandler.htm
"GH_MaterialPreviewControl.ColourChangedEventHandler Delegate")

[GH_MaterialPreviewControl.MaterialImagePostPaintEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_MaterialPreviewControl_MaterialImagePostPaintEventHandler.htm
"GH_MaterialPreviewControl.MaterialImagePostPaintEventHandler Delegate")

[GH_MaterialPreviewControl.SelectedChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_MaterialPreviewControl_SelectedChangedEventHandler.htm
"GH_MaterialPreviewControl.SelectedChangedEventHandler Delegate")

[GH_MenuTextBox Class](../html/T_Grasshopper_GUI_GH_MenuTextBox.htm
"GH_MenuTextBox Class")

[GH_MenuTextBox.KeyDownEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_MenuTextBox_KeyDownEventHandler.htm
"GH_MenuTextBox.KeyDownEventHandler Delegate")

[GH_MenuTextBox.TextChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_MenuTextBox_TextChangedEventHandler.htm
"GH_MenuTextBox.TextChangedEventHandler Delegate")

[GH_MouseTracker Class](../html/T_Grasshopper_GUI_GH_MouseTracker.htm
"GH_MouseTracker Class")

[GH_NumberSliderSnappingEditor
Class](../html/T_Grasshopper_GUI_GH_NumberSliderSnappingEditor.htm
"GH_NumberSliderSnappingEditor Class")

[GH_PanelEditorControl
Class](../html/T_Grasshopper_GUI_GH_PanelEditorControl.htm
"GH_PanelEditorControl Class")

[GH_QuickImageEditor Class](../html/T_Grasshopper_GUI_GH_QuickImageEditor.htm
"GH_QuickImageEditor Class")

[GH_RotationalFrame
Structure](../html/T_Grasshopper_GUI_GH_RotationalFrame.htm
"GH_RotationalFrame Structure")

[GH_RotationalTuningData(T)
Class](../html/T_Grasshopper_GUI_GH_RotationalTuningData_1.htm
"GH_RotationalTuningData\(T\) Class")

[GH_SamplingSphere Class](../html/T_Grasshopper_GUI_GH_SamplingSphere.htm
"GH_SamplingSphere Class")

[GH_SeparatorDisplay
Enumeration](../html/T_Grasshopper_GUI_GH_SeparatorDisplay.htm
"GH_SeparatorDisplay Enumeration")

[GH_SettingsCategory Class](../html/T_Grasshopper_GUI_GH_SettingsCategory.htm
"GH_SettingsCategory Class")

GH_Slider Class

[GH_Slider.ValueChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_Slider_ValueChangedEventHandler.htm
"GH_Slider.ValueChangedEventHandler Delegate")

[GH_Slider_Obsolete Class](../html/T_Grasshopper_GUI_GH_Slider_Obsolete.htm
"GH_Slider_Obsolete Class")

[GH_Slider_Obsolete.ValueChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_Slider_Obsolete_ValueChangedEventHandler.htm
"GH_Slider_Obsolete.ValueChangedEventHandler Delegate")

[GH_SliderInputMode
Enumeration](../html/T_Grasshopper_GUI_GH_SliderInputMode.htm
"GH_SliderInputMode Enumeration")

[GH_StandardIcons Class](../html/T_Grasshopper_GUI_GH_StandardIcons.htm
"GH_StandardIcons Class")

[GH_Tooltip Class](../html/T_Grasshopper_GUI_GH_Tooltip.htm "GH_Tooltip
Class")

[GH_TooltipComponent Class](../html/T_Grasshopper_GUI_GH_TooltipComponent.htm
"GH_TooltipComponent Class")

[GH_TooltipComponent.PopulateTooltipEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_TooltipComponent_PopulateTooltipEventHandler.htm
"GH_TooltipComponent.PopulateTooltipEventHandler Delegate")

[GH_TooltipDisplayEventArgs
Class](../html/T_Grasshopper_GUI_GH_TooltipDisplayEventArgs.htm
"GH_TooltipDisplayEventArgs Class")

[GH_TrackerFrame Structure](../html/T_Grasshopper_GUI_GH_TrackerFrame.htm
"GH_TrackerFrame Structure")

[GH_UnrecognizedObjectsForm
Class](../html/T_Grasshopper_GUI_GH_UnrecognizedObjectsForm.htm
"GH_UnrecognizedObjectsForm Class")

[GH_VerticalScrollBar
Class](../html/T_Grasshopper_GUI_GH_VerticalScrollBar.htm
"GH_VerticalScrollBar Class")

[GH_VerticalScrollBar.ScrollRatioChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_GH_VerticalScrollBar_ScrollRatioChangedEventHandler.htm
"GH_VerticalScrollBar.ScrollRatioChangedEventHandler Delegate")

[GH_VerticalSeparator
Class](../html/T_Grasshopper_GUI_GH_VerticalSeparator.htm
"GH_VerticalSeparator Class")

[GH_VoronoiWarningForm
Class](../html/T_Grasshopper_GUI_GH_VoronoiWarningForm.htm
"GH_VoronoiWarningForm Class")

[GH_WindowsControlUtil
Class](../html/T_Grasshopper_GUI_GH_WindowsControlUtil.htm
"GH_WindowsControlUtil Class")

[GH_WindowsFormUtil Class](../html/T_Grasshopper_GUI_GH_WindowsFormUtil.htm
"GH_WindowsFormUtil Class")

[GH_YakDownloadFormEto
Class](../html/T_Grasshopper_GUI_GH_YakDownloadFormEto.htm
"GH_YakDownloadFormEto Class")

[GH_YakDownloadFormEto.MissingObjectItem
Class](../html/T_Grasshopper_GUI_GH_YakDownloadFormEto_MissingObjectItem.htm
"GH_YakDownloadFormEto.MissingObjectItem Class")

[IGH_Embeddable Interface](../html/T_Grasshopper_GUI_IGH_Embeddable.htm
"IGH_Embeddable Interface")

[IGH_FileDropTarget
Interface](../html/T_Grasshopper_GUI_IGH_FileDropTarget.htm
"IGH_FileDropTarget Interface")

[IGH_SettingCategory
Interface](../html/T_Grasshopper_GUI_IGH_SettingCategory.htm
"IGH_SettingCategory Interface")

[IGH_SettingFrontend
Interface](../html/T_Grasshopper_GUI_IGH_SettingFrontend.htm
"IGH_SettingFrontend Interface")

[IGH_Tooltip Interface](../html/T_Grasshopper_GUI_IGH_Tooltip.htm "IGH_Tooltip
Interface")

!Click or drag to
resize

# GH_MenuTextBoxTextChangedEventHandler Delegate

---

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public delegate void TextChangedEventHandler(
    	GH_MenuTextBox sender,
    	string newText
    )

    Public Delegate Sub TextChangedEventHandler (
    	sender As GH_MenuTextBox,
    	newText As String
    )

#### Parameters

sender

    Type: Grasshopper.GUIGH_MenuTextBox

newText

    Type: SystemString

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com