---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_PreviewUtil.htm
scraped_at: 2025-09-08T16:17:39.609904
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_PreviewUtil Class](../html/T_Grasshopper_Kernel_GH_PreviewUtil.htm
"GH_PreviewUtil Class")

[GH_PreviewUtil Constructor
](../html/Overload_Grasshopper_Kernel_GH_PreviewUtil__ctor.htm "GH_PreviewUtil
Constructor ")

[GH_PreviewUtil
Properties](../html/Properties_T_Grasshopper_Kernel_GH_PreviewUtil.htm
"GH_PreviewUtil Properties")

[GH_PreviewUtil
Methods](../html/Methods_T_Grasshopper_Kernel_GH_PreviewUtil.htm
"GH_PreviewUtil Methods")

!Click or drag to
resize

# GH_PreviewUtil Class

---

This class exposes functionality that makes it easy to draw temporary geometry
in Rhino viewports.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_PreviewUtil

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_PreviewUtil : IDisposable

    Public NotInheritable Class GH_PreviewUtil
    	Implements IDisposable

The GH_PreviewUtil type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PreviewUtil| Initializes a
new instance of the GH_PreviewUtil class
|
GH_PreviewUtil(Boolean)|
Initializes a new instance of the GH_PreviewUtil class
Top

Properties

| Name| Description
---|---|---
|
Enabled|  Gets or sets the
enabled state of this Preview util.
|
WireColour|  Gets or
sets the colour to use for Preview geometry.
Top

Methods

| Name| Description
---|---|---
|
AddBox|  Add a box to the
temporary Preview lists.
|
AddBrep|  Add a brep to the
temporary Preview lists.
|
AddCurve|  Add a curve to
the temporary Preview lists.
|
AddLine|  Add a line to the
temporary Preview lists.
|
AddMesh|  Add a mesh to the
temporary Preview lists.
|
AddPlane|  Add a plane to
the temporary Preview lists.
|
AddPoint|  Add a point to
the temporary Preview lists.
|
AddVector|  Add a vector
to the temporary Preview lists.
|
Clear|  Clear all temporary
geometry.
|
Dispose| Releases all
resources used by the GH_PreviewUtil
|
Redraw|  Forces a redraw the
the viewports.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com