---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_CanvasMouseEvent.htm
scraped_at: 2025-09-08T16:12:16.196386
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_CanvasMouseEvent Class](../html/T_Grasshopper_GUI_GH_CanvasMouseEvent.htm
"GH_CanvasMouseEvent Class")

[GH_CanvasMouseEvent Constructor
](../html/Overload_Grasshopper_GUI_GH_CanvasMouseEvent__ctor.htm
"GH_CanvasMouseEvent Constructor ")

[GH_CanvasMouseEvent
Properties](../html/Properties_T_Grasshopper_GUI_GH_CanvasMouseEvent.htm
"GH_CanvasMouseEvent Properties")

!Click or drag to
resize

# GH_CanvasMouseEvent Class

---

Class used in Canvas UI events.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.GUIGH_CanvasMouseEvent

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_CanvasMouseEvent : EventArgs

    Public Class GH_CanvasMouseEvent
    	Inherits EventArgs

The GH_CanvasMouseEvent type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_CanvasMouseEvent|  Blank
constructor.
| GH_CanvasMouseEvent(GH_Viewport,
MouseEventArgs)|
Constructor.
| GH_CanvasMouseEvent(Point, PointF,
MouseButtons, Int32,
Int32)|  Constructor.
Top

Properties

| Name| Description
---|---|---
|
Button|  Gets which mouse
button was pressed.
|
CanvasLocation|
Gets the location of the cursor in canvas unit coordinates.
|
CanvasX|  Gets the
x-coordinate of the cursor location in canvas unit coordinates.
|
CanvasY|  Gets the
y-coordinate of the cursor location in canvas unit coordinates.
|
Clicks|  Gets the number
of times the mouse button was pressed and released.
|
ControlLocation|
Gets the location of the cursor in control pixel coordinates.
|
ControlX|  Gets the
x-coordinate of the cursor location in control pixel coordinates.
|
ControlY|  Gets the
y-coordinate of the cursor location in control pixel coordinates.
|
Delta|  Gets a signed count
of the number of detents the mouse wheel has rotated. A detent is one notch of
the mouse wheel.
|
WinFormsEventArgs|
Downcast this data into a Windows.Forms.MouseEventArgs instance.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com