---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DocUndoEventArgs.htm
scraped_at: 2025-09-08T16:16:38.340116
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocUndoEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DocUndoEventArgs.htm
"GH_DocUndoEventArgs Class")

[GH_DocUndoEventArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_DocUndoEventArgs.htm
"GH_DocUndoEventArgs Properties")

!Click or drag to
resize

# GH_DocUndoEventArgs Class

---

These arguments are passed along with UndoStateChanged events on GH_Document.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_DocUndoEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DocUndoEventArgs : EventArgs

    Public Class GH_DocUndoEventArgs
    	Inherits EventArgs

The GH_DocUndoEventArgs type exposes the following members.

Properties

| Name| Description
---|---|---
|
Document|  Gets the
document that raised the event.
|
Operation|  Gets the
type of undo operation that caused this event.
|
Record|  Gets the
UndoRecord pertaining to this event. Not every Event type has a single record
associated with it so be sure to test for null.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com