---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Base_GH_DigitScrollerBase_InvalidatedEventHandler.htm
scraped_at: 2025-09-08T16:13:41.581533
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Base](../html/N_Grasshopper_GUI_Base.htm
"Grasshopper.GUI.Base")

[GH_ColourCube Class](../html/T_Grasshopper_GUI_Base_GH_ColourCube.htm
"GH_ColourCube Class")

[GH_ColourPickerBase
Class](../html/T_Grasshopper_GUI_Base_GH_ColourPickerBase.htm
"GH_ColourPickerBase Class")

[GH_ColourPickerBase.ColorChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_Base_GH_ColourPickerBase_ColorChangedEventHandler.htm
"GH_ColourPickerBase.ColorChangedEventHandler Delegate")

[GH_ColourPickerBase.InvalidatedEventHandler
Delegate](../html/T_Grasshopper_GUI_Base_GH_ColourPickerBase_InvalidatedEventHandler.htm
"GH_ColourPickerBase.InvalidatedEventHandler Delegate")

[GH_ColourPickerEventArgs
Class](../html/T_Grasshopper_GUI_Base_GH_ColourPickerEventArgs.htm
"GH_ColourPickerEventArgs Class")

[GH_ColourSpace Enumeration](../html/T_Grasshopper_GUI_Base_GH_ColourSpace.htm
"GH_ColourSpace Enumeration")

[GH_DigitAlign Enumeration](../html/T_Grasshopper_GUI_Base_GH_DigitAlign.htm
"GH_DigitAlign Enumeration")

[GH_DigitNumber Class](../html/T_Grasshopper_GUI_Base_GH_DigitNumber.htm
"GH_DigitNumber Class")

[GH_DigitScrollerBase
Class](../html/T_Grasshopper_GUI_Base_GH_DigitScrollerBase.htm
"GH_DigitScrollerBase Class")

[GH_DigitScrollerBase.GH_MouseAction
Enumeration](../html/T_Grasshopper_GUI_Base_GH_DigitScrollerBase_GH_MouseAction.htm
"GH_DigitScrollerBase.GH_MouseAction Enumeration")

[GH_DigitScrollerBase.InvalidatedEventHandler
Delegate](../html/T_Grasshopper_GUI_Base_GH_DigitScrollerBase_InvalidatedEventHandler.htm
"GH_DigitScrollerBase.InvalidatedEventHandler Delegate")

[GH_DigitScrollerBase.ValueChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_Base_GH_DigitScrollerBase_ValueChangedEventHandler.htm
"GH_DigitScrollerBase.ValueChangedEventHandler Delegate")

[GH_DigitScrollerEventArgs
Class](../html/T_Grasshopper_GUI_Base_GH_DigitScrollerEventArgs.htm
"GH_DigitScrollerEventArgs Class")

[GH_ScrollBarVerticalBase
Class](../html/T_Grasshopper_GUI_Base_GH_ScrollBarVerticalBase.htm
"GH_ScrollBarVerticalBase Class")

[GH_SliderAccuracy
Enumeration](../html/T_Grasshopper_GUI_Base_GH_SliderAccuracy.htm
"GH_SliderAccuracy Enumeration")

[GH_SliderBase Class](../html/T_Grasshopper_GUI_Base_GH_SliderBase.htm
"GH_SliderBase Class")

[GH_SliderBase.DrawSliderChannel
Delegate](../html/T_Grasshopper_GUI_Base_GH_SliderBase_DrawSliderChannel.htm
"GH_SliderBase.DrawSliderChannel Delegate")

[GH_SliderBase.TextInputHandler
Delegate](../html/T_Grasshopper_GUI_Base_GH_SliderBase_TextInputHandler.htm
"GH_SliderBase.TextInputHandler Delegate")

[GH_SliderBase.ValueChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_Base_GH_SliderBase_ValueChangedEventHandler.htm
"GH_SliderBase.ValueChangedEventHandler Delegate")

[GH_SliderEventArgs
Class](../html/T_Grasshopper_GUI_Base_GH_SliderEventArgs.htm
"GH_SliderEventArgs Class")

[GH_SliderGripDisplay
Enumeration](../html/T_Grasshopper_GUI_Base_GH_SliderGripDisplay.htm
"GH_SliderGripDisplay Enumeration")

[GH_SliderRailDisplay
Enumeration](../html/T_Grasshopper_GUI_Base_GH_SliderRailDisplay.htm
"GH_SliderRailDisplay Enumeration")

[GH_SliderTickDisplay
Enumeration](../html/T_Grasshopper_GUI_Base_GH_SliderTickDisplay.htm
"GH_SliderTickDisplay Enumeration")

[GH_TextBoxInputBase
Class](../html/T_Grasshopper_GUI_Base_GH_TextBoxInputBase.htm
"GH_TextBoxInputBase Class")

[SliderSnapRange Structure](../html/T_Grasshopper_GUI_Base_SliderSnapRange.htm
"SliderSnapRange Structure")

!Click or drag to
resize

# GH_DigitScrollerBaseInvalidatedEventHandler Delegate

---

**Namespace:** Grasshopper.GUI.Base
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public delegate void InvalidatedEventHandler(
    	Object sender,
    	EventArgs e
    )

    Public Delegate Sub InvalidatedEventHandler (
    	sender As Object,
    	e As EventArgs
    )

#### Parameters

sender

    Type: SystemObject

e

    Type: SystemEventArgs

See Also

#### Reference

Grasshopper.GUI.Base Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com