---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_ColourSwatchEventArgs.htm
scraped_at: 2025-09-08T16:12:20.209978
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_ColourSwatchEventArgs
Class](../html/T_Grasshopper_GUI_GH_ColourSwatchEventArgs.htm
"GH_ColourSwatchEventArgs Class")

[GH_ColourSwatchEventArgs Constructor
](../html/M_Grasshopper_GUI_GH_ColourSwatchEventArgs__ctor.htm
"GH_ColourSwatchEventArgs Constructor ")

[GH_ColourSwatchEventArgs
Properties](../html/Properties_T_Grasshopper_GUI_GH_ColourSwatchEventArgs.htm
"GH_ColourSwatchEventArgs Properties")

!Click or drag to
resize

# GH_ColourSwatchEventArgs Class

---

Event arguments used in the GH_ColourSwatchControl.ColourChanged event.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.GUIGH_ColourSwatchEventArgs

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ColourSwatchEventArgs : EventArgs

    Public Class GH_ColourSwatchEventArgs
    	Inherits EventArgs

The GH_ColourSwatchEventArgs type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ColourSwatchEventArgs|
Initializes a new instance of the GH_ColourSwatchEventArgs class
Top

Properties

| Name| Description
---|---|---
|
Colour|
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com