---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_UpgradeObject.htm
scraped_at: 2025-09-08T16:18:45.893875
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_UpgradeObject
Interface](../html/T_Grasshopper_Kernel_IGH_UpgradeObject.htm
"IGH_UpgradeObject Interface")

[IGH_UpgradeObject
Properties](../html/Properties_T_Grasshopper_Kernel_IGH_UpgradeObject.htm
"IGH_UpgradeObject Properties")

[IGH_UpgradeObject
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_UpgradeObject.htm
"IGH_UpgradeObject Methods")

!Click or drag to
resize

# IGH_UpgradeObject Interface

---

Create a class with an empty constructor that implements this interface if you
want to provide an upgrade mechanism.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_UpgradeObject

    Public Interface IGH_UpgradeObject

The IGH_UpgradeObject type exposes the following members.

Properties

| Name| Description
---|---|---
|
UpgradeFrom|  Gets
the ComponentGuid of the old object (the object to be updated).
|
UpgradeTo|  Gets the
ComponentGuid of the new object (the object that will be inserted).
|
Version|  Return a
DateTime object that indicates when this upgrade mechanism was written, so
that it becomes possible to distinguish competing upgrade mechanisms.
Top

Methods

| Name| Description
---|---|---
|
Upgrade|  Upgrade an
existing object.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com