---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Render_ModelRenderSkylight.htm
scraped_at: 2025-09-08T16:24:41.502418
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Render](../html/N_Grasshopper_Rhinoceros_Render.htm
"Grasshopper.Rhinoceros.Render")

[ModelRenderSkylight
Class](../html/T_Grasshopper_Rhinoceros_Render_ModelRenderSkylight.htm
"ModelRenderSkylight Class")

[ModelRenderSkylight Constructor
](../html/M_Grasshopper_Rhinoceros_Render_ModelRenderSkylight__ctor.htm
"ModelRenderSkylight Constructor ")

[ModelRenderSkylight
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Render_ModelRenderSkylight.htm
"ModelRenderSkylight Properties")

[ModelRenderSkylight
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Render_ModelRenderSkylight.htm
"ModelRenderSkylight Methods")

[ModelRenderSkylight Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Render_ModelRenderSkylight.htm
"ModelRenderSkylight Type Conversions")

!Click or drag to
resize

# ModelRenderSkylight Class

---

Represents a Rhino skylight. Wraps the functionality of the Skylight type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.Rhinoceros.RenderModelRenderSkylight

**Namespace:**
Grasshopper.Rhinoceros.Render
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelRenderSkylight : ModelContent

    Public NotInheritable Class ModelRenderSkylight
    	Inherits ModelContent

The ModelRenderSkylight type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelRenderSkylight|
Initializes a new instance of the ModelRenderSkylight class
Top

Properties

| Name| Description
---|---|---
|
Enabled|
|
Environment|
|
EnvironmentOverride|
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
CastToT(T)|
(Overrides
ModelContentCastToT(T).)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelRenderSkylightAttributes to
ModelRenderSkylight)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Render Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com