---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_DisplayColorGradient.htm
scraped_at: 2025-09-08T16:23:16.054759
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[DisplayColorGradient
Class](../html/T_Grasshopper_Rhinoceros_Display_DisplayColorGradient.htm
"DisplayColorGradient Class")

[DisplayColorGradient Constructor
](../html/Overload_Grasshopper_Rhinoceros_Display_DisplayColorGradient__ctor.htm
"DisplayColorGradient Constructor ")

[DisplayColorGradient
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_DisplayColorGradient.htm
"DisplayColorGradient Properties")

[DisplayColorGradient
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_DisplayColorGradient.htm
"DisplayColorGradient Methods")

!Click or drag to
resize

# DisplayColorGradient Class

---

Represents a gradient colour stop. Wraps the functionality of the
ColorGradient type.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooColorGradient
Grasshopper.Rhinoceros.DisplayDisplayColorGradient

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class DisplayColorGradient : GH_Goo<ColorGradient>,
    	IGH_PreviewData

    Public NotInheritable Class DisplayColorGradient
    	Inherits GH_Goo(Of ColorGradient)
    	Implements IGH_PreviewData

The DisplayColorGradient type exposes the following members.

Constructors

| Name| Description
---|---|---
|
DisplayColorGradient|
Blank constructor
|
DisplayColorGradient(ColorGradient)|
Initializes a new instance of the DisplayColorGradient class
|
DisplayColorGradient(DisplayColorGradient)|
Initializes a new instance of the DisplayColorGradient class
Top

Properties

| Name| Description
---|---|---
|
ClippingBox|
|
IsValid|
Gets the validity of this instance.  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|
(Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|
(Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|
(Overrides
GH_GooTCastToQ(Q).)
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|
(Overrides
GH_GooTDuplicate.)
|
DuplicateColourGradient|
|
EmitProxy|  Create a new
proxy for this instance. Return Null if this class does not support proxies.
(Inherited from GH_GooT.)
|
Read|
(Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|
(Overrides
GH_GooTToString.)
|
Write|
(Overrides
GH_GooTWrite(GH_IWriter).)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com