---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_FontPicker.htm
scraped_at: 2025-09-08T16:12:37.303985
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_FontPicker Class](../html/T_Grasshopper_GUI_GH_FontPicker.htm
"GH_FontPicker Class")

[GH_FontPicker Constructor ](../html/M_Grasshopper_GUI_GH_FontPicker__ctor.htm
"GH_FontPicker Constructor ")

[GH_FontPicker
Properties](../html/Properties_T_Grasshopper_GUI_GH_FontPicker.htm
"GH_FontPicker Properties")

[GH_FontPicker Methods](../html/Methods_T_Grasshopper_GUI_GH_FontPicker.htm
"GH_FontPicker Methods")

!Click or drag to
resize

# GH_FontPicker Class

---

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsContainerControl
System.Windows.FormsUserControl
Grasshopper.GUIGH_FontPicker

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_FontPicker : UserControl

    Public Class GH_FontPicker
    	Inherits UserControl

The GH_FontPicker type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_FontPicker| Initializes a new
instance of the GH_FontPicker class
Top

Properties

| Name| Description
---|---|---
|
SelectedFont|
Top

Methods

| Name| Description
---|---|---
|
CreateFontPickerWindow|
Create a new window containing a Font Picker object and OK, Cancel buttons.
Picked fonts will be stored in the Tag field of the form.
|
Dispose| Releases the unmanaged
resources used by the GH_FontPicker and optionally releases the managed
resources (Overrides
[ContainerControlDispose(Boolean)](https://docs.microsoft.com/dotnet/api/system.windows.forms.containercontrol.dispose#system-
windows-forms-containercontrol-dispose\(system-boolean\)).)
|
ShowFontPickerWindow(Font)|
Display the fontpicker in a window.
|
ShowFontPickerWindow(Font,
Form)|  Display
the fontpicker in a window.
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com