---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_Lexer.htm
scraped_at: 2025-09-08T16:19:03.982136
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_Lexer Class](../html/T_Grasshopper_Kernel_Data_GH_Lexer.htm "GH_Lexer
Class")

[GH_Lexer Constructor
](../html/Overload_Grasshopper_Kernel_Data_GH_Lexer__ctor.htm "GH_Lexer
Constructor ")

[GH_Lexer
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_Lexer.htm
"GH_Lexer Properties")

[GH_Lexer Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_Lexer.htm
"GH_Lexer Methods")

!Click or drag to
resize

# GH_Lexer Class

---

Represents a lexical mask for path operations.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_Lexer

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Lexer

    Public Class GH_Lexer

The GH_Lexer type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Lexer|  Blank constructor.
|
GH_Lexer(String)|  Create a
new mask from a textual string.
Top

Properties

| Name| Description
---|---|---
|
IsItem|  Gets a value
indicating whether or not the item portion of the lexer has been set.
|
IsPath|  Gets a value
indicating whether or not the path portion of the lexer has been set.
|
Item|  Gets the item string
that was extracted from the mask. The default is "append"
|
Mask|  Gets the original string
that represents the user input for this lexer.
|
Path|  Gets the list of path
strings that was extracted from the mask. If the mask hasn't been parsed yet,
it will be parsed now. If the returned list is still nothing, parsing failed.
Top

Methods

| Name| Description
---|---|---
|
EvaluatePath|  Evaluate
the variables in this mask with the provided expression solver.
|
PerformLexicalReplaceT(GH_Lexer, GH_Lexer, DataTreeT,
DataTreeT)|
Lexical Find..Replace operations.
|
PerformLexicalReplaceT(GH_Lexer, GH_Lexer, IGH_Structure,
GH_StructureT)|
Lexical Find..Replace operations.
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com