---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_ComplexNumber.htm
scraped_at: 2025-09-08T16:20:27.369232
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_ComplexNumber
Class](../html/T_Grasshopper_Kernel_Types_GH_ComplexNumber.htm
"GH_ComplexNumber Class")

[GH_ComplexNumber Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_ComplexNumber__ctor.htm
"GH_ComplexNumber Constructor ")

[GH_ComplexNumber
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_ComplexNumber.htm
"GH_ComplexNumber Properties")

[GH_ComplexNumber
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_ComplexNumber.htm
"GH_ComplexNumber Methods")

[GH_ComplexNumber
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_ComplexNumber.htm
"GH_ComplexNumber Fields")

!Click or drag to
resize

# GH_ComplexNumber Class

---

Wraps up the Complex data type for IGH_Goo adherence.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooComplex
Grasshopper.Kernel.TypesGH_ComplexNumber

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ComplexNumber : GH_Goo<Complex>

    Public Class GH_ComplexNumber
    	Inherits GH_Goo(Of Complex)

The GH_ComplexNumber type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ComplexNumber|
Blank constructor
|
GH_ComplexNumber(Complex)|
Initializes a new instance of the GH_ComplexNumber class
|
GH_ComplexNumber(GH_ComplexNumber)|
Initializes a new instance of the GH_ComplexNumber class
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets the
validity of this instance. If either the real or the imaginary component are
NaN, then it is considered invalid  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|
(Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|
(Overrides
GH_GooTCastFrom(Object).)
|
CastToT(T)|
(Overrides
GH_GooTCastToQ(Q).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
Duplicate|
(Overrides
GH_GooTDuplicate.)
|
DuplicateComplex|
|
EmitProxy|
(Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|
(Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com