---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GDL_GH_GDLParser.htm
scraped_at: 2025-09-08T16:19:50.210203
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.GDL](../html/N_Grasshopper_Kernel_GDL.htm
"Grasshopper.Kernel.GDL")

[GH_GDLParser Class](../html/T_Grasshopper_Kernel_GDL_GH_GDLParser.htm
"GH_GDLParser Class")

[GH_GDLParser
Methods](../html/Methods_T_Grasshopper_Kernel_GDL_GH_GDLParser.htm
"GH_GDLParser Methods")

!Click or drag to
resize

# GH_GDLParser Class

---

Provided functionality for parsing and writing Grasshopper Descriptor Language
text.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.GDLGH_GDLParser

**Namespace:** Grasshopper.Kernel.GDL
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_GDLParser

    Public NotInheritable Class GH_GDLParser

The GH_GDLParser type exposes the following members.

Methods

| Name| Description
---|---|---
|
ParseGDL|  Convert a GDL
text into an actual document.
Top

See Also

#### Reference

Grasshopper.Kernel.GDL Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com