---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_SolutionSpan.htm
scraped_at: 2025-09-08T16:17:57.675615
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_SolutionSpan Structure](../html/T_Grasshopper_Kernel_GH_SolutionSpan.htm
"GH_SolutionSpan Structure")

[GH_SolutionSpan Constructor
](../html/M_Grasshopper_Kernel_GH_SolutionSpan__ctor.htm "GH_SolutionSpan
Constructor ")

[GH_SolutionSpan
Properties](../html/Properties_T_Grasshopper_Kernel_GH_SolutionSpan.htm
"GH_SolutionSpan Properties")

!Click or drag to
resize

# GH_SolutionSpan Structure

---

Represents the time interval for a GH_Document solution.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct GH_SolutionSpan

    Public Structure GH_SolutionSpan

The GH_SolutionSpan type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_SolutionSpan|  Creates a
new instance of the GH_SolutionSpan structure.
Top

Properties

| Name| Description
---|---|---
|
EndTime|  Gets the time at
which this solution was finished.
|
StartTime|  Gets the
time at which this solution was started.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com