---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Extrusion_GH_ExtrusionProxy.htm
scraped_at: 2025-09-08T16:20:36.371842
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Extrusion.GH_ExtrusionProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Extrusion_GH_ExtrusionProxy.htm
"GH_Extrusion.GH_ExtrusionProxy Class")

[GH_Extrusion.GH_ExtrusionProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Extrusion_GH_ExtrusionProxy__ctor.htm
"GH_Extrusion.GH_ExtrusionProxy Constructor ")

[GH_ExtrusionProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Extrusion_GH_ExtrusionProxy.htm
"GH_ExtrusionProxy Properties")

[GH_ExtrusionProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Extrusion_GH_ExtrusionProxy.htm
"GH_ExtrusionProxy Methods")

!Click or drag to
resize

# GH_ExtrusionGH_ExtrusionProxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Extrusion
Grasshopper.Kernel.TypesGH_ExtrusionGH_ExtrusionProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_ExtrusionProxy : GH_GooProxy<GH_Extrusion>

    Public Class GH_ExtrusionProxy
    	Inherits GH_GooProxy(Of GH_Extrusion)

The GH_ExtrusionGH_ExtrusionProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ExtrusionGH_ExtrusionProxy|
Initializes a new instance of the GH_ExtrusionGH_ExtrusionProxy class
Top

Properties

| Name| Description
---|---|---
|
Area|
|
CapCount|
|
ObjectID|
|
ProfileCount|
|
Solid|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
|
Volume|
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|
(Overrides
GH_GooProxyTFromString(String).)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com