---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_AssemblyInfo.htm
scraped_at: 2025-09-08T16:15:21.061267
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_AssemblyInfo Class](../html/T_Grasshopper_Kernel_GH_AssemblyInfo.htm
"GH_AssemblyInfo Class")

[GH_AssemblyInfo Constructor
](../html/M_Grasshopper_Kernel_GH_AssemblyInfo__ctor.htm "GH_AssemblyInfo
Constructor ")

[GH_AssemblyInfo
Properties](../html/Properties_T_Grasshopper_Kernel_GH_AssemblyInfo.htm
"GH_AssemblyInfo Properties")

!Click or drag to
resize

# GH_AssemblyInfo Class

---

Implement this interface once (and once only) in a GHA project if you wish to
add additional information about your library to Grasshopper. Note you must
supply an empty constructor.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_AssemblyInfo
Grasshopper.KernelGH_AssemblyInfoStub

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_AssemblyInfo

    Public MustInherit Class GH_AssemblyInfo

The GH_AssemblyInfo type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_AssemblyInfo| Initializes
a new instance of the GH_AssemblyInfo class
Top

Properties

| Name| Description
---|---|---
|
Assembly|  Gets the
actual assembly that this info object describes.
|
AuthorContact|  Gets
the contact information for the author. This can be email, phone, fax, address
or all of the above. Return null if you do not wish to associate contact
details with this assembly.
|
AuthorName|  Gets the
name of the individual/company/organisation that is responsible for this
assembly. Return null if you do not wish to associate an author with this
assembly.
|
Description|  Gets the
human readable description of this assembly. Return null if you do not wish to
associate a description with this assembly.
|
Icon|  Gets a 24x24 icon that
represents this assembly. Return null if you do not wish to associate an icon
with this assembly.
|
Id|  Gets the Id of this
assembly. By default the Id is a hash of the name.
|
IsCoreLibrary|  Gets
whether this library is a Grasshopper core library. Core libraries are
installed along with Grasshopper and thus should always be available anywhere.
|
License|  Gets the license
type for this assembly.
|
LoadingMechanism|
Gets the mechanism used to load this assembly.
|
Location|  Gets the
location this assembly was loaded from.
|
Name|  Gets the human
readable name of this assembly. Return null if you do not wish to associate a
name with this assembly.
|
Version|  Gets the version
code for this assembly.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com