---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Gradient_GH_Gradient.htm
scraped_at: 2025-09-08T16:15:00.920756
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Gradient](../html/N_Grasshopper_GUI_Gradient.htm
"Grasshopper.GUI.Gradient")

[GH_Gradient Class](../html/T_Grasshopper_GUI_Gradient_GH_Gradient.htm
"GH_Gradient Class")

[GH_Gradient Constructor
](../html/Overload_Grasshopper_GUI_Gradient_GH_Gradient__ctor.htm "GH_Gradient
Constructor ")

[GH_Gradient
Properties](../html/Properties_T_Grasshopper_GUI_Gradient_GH_Gradient.htm
"GH_Gradient Properties")

[GH_Gradient
Methods](../html/Methods_T_Grasshopper_GUI_Gradient_GH_Gradient.htm
"GH_Gradient Methods")

[GH_Gradient Events](../html/Events_T_Grasshopper_GUI_Gradient_GH_Gradient.htm
"GH_Gradient Events")

!Click or drag to
resize

# GH_Gradient Class

---

Represents a colour gradient defined by a succession of grips.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.GradientGH_Gradient

**Namespace:** Grasshopper.GUI.Gradient
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Gradient : GH_ISerializable,
    	IGradient

    Public Class GH_Gradient
    	Implements GH_ISerializable, IGradient

The GH_Gradient type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Gradient| Initializes a
new instance of the GH_Gradient class
|
GH_Gradient(GH_Gradient)|
Create a duplicate of another gradient.
| GH_Gradient(IEnumerableDouble,
IEnumerableColor)|
Create a new gradient from grips and colours.
Top

Properties

| Name| Description
---|---|---
|
Grip|  Gets or sets the
grip at the given index.
|
GripCount|  Gets the
number of grips in this gradient.
|
Linear|  Gets or sets
whether the colours are interpolated linearly between grips.
|
Locked|  Gets or sets
whether this gradient is locked. A locked gradient cannot be modified by the
user.
|
SelectedGrip|  Gets
or sets the selected grip.
Top

Methods

| Name| Description
---|---|---
|
AddGrip(Double)|  Add
a new grip to the gradient. The colour of the grip will be picked so that
there is no difference to the gradient, though this is not actually possible
when the interpolation mode is not linear.
|
AddGrip(GH_Grip)|  Add a
new grip to the gradient. This method does not raise the GradientChanged
event, so you need to do that yourself by calling OnGradientChanged().
| AddGrip(Double,
Color)|  Add a new
single-colour grip.
| AddGrip(Double, Color,
Color)|  Add a new bi-
colour grip.
|
ColourAt|  Evaluate the
colour at a specific parameter.
|
DeleteGripRegion|
Gets the Delete Grip region rectangle based on a gradient destination
rectangle.
|
DisplayGradientEditor|
|
DisplayGripColourPicker|
|
EarthlyBrown|
|
Forest|
|
GreyScale|
|
Heat|
|
MouseDown|  Begin grip
drag operation.
|
MouseDragAbort|
Abort grip drag.
|
MouseMove|  Continue
grip dragging operation.
|
MouseUp|  Terminate grip
drag.
|
NearestGrip(Double)|
Find the nearest grip to a parameter.
| NearestGrip(Double,
GH_GripSide)|  Find
the nearest grip to a parameter.
| NearestGrip(RectangleF, PointF,
Double)|  Find the
nearest grip in screen coordinates.
|
NewGripRegion|
Gets the new Grip region rectangle based on a gradient destination rectangle.
|
NormalizeGrips|
Normalize all grips. This will scale all grip parameters so that the full
gradient extend equals 0~1.
|
OnGradientChanged|
Raise the GradientChanged event.
|
OnGradientChangedIntermediate|
Raise the GradientChanged event.
|
OnSelectionChanged|
Raise the SelectionChanged event.
|
Read|
|
RemoveGrip(GH_Grip)|
Remove the specified grip.
|
RemoveGrip(Int32)|
Remove the grip at the specified index.
|
Render_Background|
|
Render_Gradient|
|
Render_Grips|
|
SoGay|
|
Spectrum|
|
Traffic|
|
Write|
|
Zebra|
Top

Events

| Name| Description
---|---|---
|
GradientChanged|
|
SelectionChanged|
Top

See Also

#### Reference

Grasshopper.GUI.Gradient Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com