---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelColor.htm
scraped_at: 2025-09-08T16:22:30.853831
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelColor Structure](../html/T_Grasshopper_Rhinoceros_ModelColor.htm
"ModelColor Structure")

[ModelColor Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelColor.htm
"ModelColor Methods")

[ModelColor Operators and Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_ModelColor.htm
"ModelColor Operators and Type Conversions")

!Click or drag to
resize

# ModelColor Structure

---

Represents a color stored on a model.

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct ModelColor : IGH_Goo,
    	IFormattable, IEquatable<ModelColor>, IComparable, IComparable<ModelColor>

    Public Structure ModelColor
    	Implements IGH_Goo, IFormattable, IEquatable(Of ModelColor),
    	IComparable, IComparable(Of ModelColor)

The ModelColor type exposes the following members.

Methods

| Name| Description
---|---|---
|
CompareTo|
|
Equals(ModelColor)|
|
Equals(Object)|
(Overrides
[ValueTypeEquals(Object)](https://docs.microsoft.com/dotnet/api/system.valuetype.equals#system-
valuetype-equals\(system-object\)).)
|
FromArgb(Int32)|
|
FromArgb(Byte, Byte,
Byte)|
|
FromArgb(Byte, Byte, Byte,
Byte)|
|
GetHashCode|
(Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
|
ToArgb|
|
ToString|  (Overrides
[ValueTypeToString](https://docs.microsoft.com/dotnet/api/system.valuetype.tostring#system-
valuetype-tostring).)
Top

Operators

| Name| Description
---|---|---
!Static
member| Equality(Color,
ModelColor)|
!Static
member| Equality(ModelColor,
ModelColor)|
!Static
member| Equality(ModelColor,
Color)|
!Static
member| (ModelColor to
ColorRGBA)|
!Static
member| (Color to
ModelColor)|
!Static
member| (ColorRGBA to
ModelColor)|
!Static
member| (ModelColor to
Color)|
!Static
member| Inequality(Color,
ModelColor)|
!Static
member| Inequality(ModelColor,
ModelColor)|
!Static
member| Inequality(ModelColor,
Color)|
Top

Remarks

This is an opaque representation of a color with conversion methods to and
from other color types.

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com