---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Attributes_GH_FloatingParamAttributes.htm
scraped_at: 2025-09-08T16:18:53.946447
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Attributes](../html/N_Grasshopper_Kernel_Attributes.htm
"Grasshopper.Kernel.Attributes")

[GH_FloatingParamAttributes
Class](../html/T_Grasshopper_Kernel_Attributes_GH_FloatingParamAttributes.htm
"GH_FloatingParamAttributes Class")

[GH_FloatingParamAttributes Constructor
](../html/M_Grasshopper_Kernel_Attributes_GH_FloatingParamAttributes__ctor.htm
"GH_FloatingParamAttributes Constructor ")

[GH_FloatingParamAttributes
Properties](../html/Properties_T_Grasshopper_Kernel_Attributes_GH_FloatingParamAttributes.htm
"GH_FloatingParamAttributes Properties")

[GH_FloatingParamAttributes
Methods](../html/Methods_T_Grasshopper_Kernel_Attributes_GH_FloatingParamAttributes.htm
"GH_FloatingParamAttributes Methods")

[GH_FloatingParamAttributes
Fields](../html/Fields_T_Grasshopper_Kernel_Attributes_GH_FloatingParamAttributes.htm
"GH_FloatingParamAttributes Fields")

!Click or drag to
resize

# GH_FloatingParamAttributes Class

---

These Attributes are the default for stand-alone Parameters.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_AttributesIGH_Param
Grasshopper.Kernel.AttributesGH_FloatingParamAttributes

**Namespace:**
Grasshopper.Kernel.Attributes
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_FloatingParamAttributes : GH_Attributes<IGH_Param>

    Public Class GH_FloatingParamAttributes
    	Inherits GH_Attributes(Of IGH_Param)

The GH_FloatingParamAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_FloatingParamAttributes|
Initializes a new instance of the GH_FloatingParamAttributes class
Top

Properties

| Name| Description
---|---|---
|
AllowMessageBalloon|
Gets a value indicating whether these attributes allow warning and error
balloons to be drawn on top of them.  (Inherited from
GH_AttributesT.)
|
Bounds|  Gets the rectangle
that contains the active content of the attributes. Typically the Contents
determine the active area for menus, tooltips etc. Attributes are not supposed
to draw objects beyond the Bounds.  (Inherited from
GH_AttributesT.)
|
DocObject|  Gets the
owner object of these attributes.  (Inherited from
GH_AttributesT.)
|
GetTopLevel|  Gets the
top-level attributes of the attribute stack these attributes belong to.
(Inherited from GH_AttributesT.)
|
HasInputGrip|  Gets a
value indicating whether or not these attributes have an input grip.
(Inherited from GH_AttributesT.)
|
HasOutputGrip|  Gets
a value indicating whether or not these attributes have an output grip.
(Inherited from GH_AttributesT.)
|
InputGrip|  Gets the
input grip location for these attributes. If HasInputGrip equals False, this
point is meaningless.  (Inherited from
GH_AttributesT.)
|
InstanceGuid|  Gets
the instance ID of the document object that owns these attributes.  (Inherited
from GH_AttributesT.)
|
IsTopLevel|  Gets
whether these attributes are top_level (i.e. no Parent attributes)  (Inherited
from GH_AttributesT.)
|
OutputGrip|  Gets the
output grip location for these attributes. If HasOutputGrip equals False, this
point is meaningless.  (Inherited from
GH_AttributesT.)
|
Owner|  Gets the type-safe
owner object of these attributes. This property is identical to the DocObject
property.  (Inherited from
GH_AttributesT.)
|
Parent|  Gets or sets the
parent attributes. Top level attributes do not have parents.  (Inherited from
GH_AttributesT.)
|
PathName|  Get a
description of the location of these attributes within the local attribute
stack.  (Inherited from
GH_AttributesT.)
|
Pivot|  Gets or sets the
pivot for these attributes. The pivot controls the general placement of the
attributes. If you want to move the attributes, change the pivot location.
(Inherited from GH_AttributesT.)
|
Selected|  Gets or sets
the selected state of the top-level attributes.  (Inherited from
GH_AttributesT.)
|
TooltipEnabled|
Gets the tooltip enabled value. If False, no further tooltip functions will be
called.  (Inherited from
GH_AttributesT.)
Top

Methods

| Name| Description
---|---|---
|
AppendToAttributeTree|
Recursively append these attributes and all child attributes to the attribute
list.  (Inherited from
GH_AttributesT.)
|
ExpireLayout|
Expires the entire layout of the attributes. When overridden, implementer
_must_ place a call to the base class ExpireLayout().  (Inherited from
GH_AttributesT.)
|
InvalidateCanvas|
If the mouse location should cause a canvas invalidation then return true. You
only need to override this function if you draw objects that are dependant on
cursor positions outside the bounds of the attributes.  (Inherited from
GH_AttributesT.)
|
IsMenuRegion|
Determines whether a point is available for context menu popups. By default,
IsMenuRegion calls IsPickRegion(PointF).  (Inherited from
GH_AttributesT.)
|
IsPickRegion(PointF)|
Determines whether a point is within the pickable region for this object. By
default, any point inside the Bounds is treated as pickable.  (Inherited from
GH_AttributesT.)
| IsPickRegion(RectangleF,
GH_PickBox)|
Determines whether a rectangle is a valid pick region for this object. By
default, the picking rectangle is intersected with the Bounds rectangle.
(Inherited from GH_AttributesT.)
|
IsTooltipRegion|
Determines whether a point is available for tooltip popups. By default,
IsMenuRegion calls IsTooltipRegion(PointF).  (Inherited from
GH_AttributesT.)
|
Layout|
(Overrides
GH_AttributesTLayout.)
|
NewInstanceGuid|
Generate a new instance GUID for the owner object.  (Inherited from
GH_AttributesT.)
|
NewInstanceGuid(Guid)|
Generate a new instance GUID for the owner object. Do not use this overload
unless you're > 1.95m and called David.  (Inherited from
GH_AttributesT.)
|
PerformLayout|
Recompute the layout for these attributes. This function is automatically
called during Drawing operations, so you typically don't have to.  (Inherited
from GH_AttributesT.)
|
PrepareForRender|
This method will always be called exactly once prior to Render(). This would
be a good place to make sure all the necessary GUI data is up and running.
(Inherited from GH_AttributesT.)
|
Read|  (Inherited from
GH_AttributesT.)
|
Render|
(Overrides GH_AttributesTRender(GH_Canvas, Graphics,
GH_CanvasChannel).)
| RenderIncomingWires(GH_Painter,
IEnumerableIGH_Param,
GH_ParamWireDisplay)|
Utility function for derived classes. This method draws all the wires going
into the left side of the attributes.  (Inherited from
GH_AttributesT.)
| RenderIncomingWires(GH_Painter,
IEnumerableIGH_Param,
IEnumerablePen)|
Utility function for derived classes. This method draws all the wires going
into the left side of the attributes.  (Inherited from
GH_AttributesT.)
|
RenderToCanvas|
Render these attributes into a Canvas control. This function places calls to
PrepareForRender() and Render(), you should override those.  (Inherited from
GH_AttributesT.)
|
RespondToKeyDown|
(Inherited from GH_AttributesT.)
|
RespondToKeyUp|
(Inherited from GH_AttributesT.)
|
RespondToMouseDoubleClick|
(Overrides GH_AttributesTRespondToMouseDoubleClick(GH_Canvas,
GH_CanvasMouseEvent).)
|
RespondToMouseDown|
(Inherited from GH_AttributesT.)
|
RespondToMouseMove|
(Inherited from GH_AttributesT.)
|
RespondToMouseUp|
(Inherited from GH_AttributesT.)
|
SetupTooltip|
(Overrides GH_AttributesTSetupTooltip(PointF,
GH_TooltipDisplayEventArgs).)
|
Write|  (Inherited from
GH_AttributesT.)
Top

Fields

| Name| Description
---|---|---
|
DefaultWidth|
Defines the default (and minimum) width of a floating parameter.
|
IconHeight|
Defines the default height of a floating parameter in Icon display mode.
|
TextHeight|
Defines the default height of a floating parameter in Text display mode.
Top

See Also

#### Reference

Grasshopper.Kernel.Attributes Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com