---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Render_ModelRenderEnvironment.htm
scraped_at: 2025-09-08T16:24:37.419845
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Render](../html/N_Grasshopper_Rhinoceros_Render.htm
"Grasshopper.Rhinoceros.Render")

[ModelRenderEnvironment
Class](../html/T_Grasshopper_Rhinoceros_Render_ModelRenderEnvironment.htm
"ModelRenderEnvironment Class")

[ModelRenderEnvironment Constructor
](../html/Overload_Grasshopper_Rhinoceros_Render_ModelRenderEnvironment__ctor.htm
"ModelRenderEnvironment Constructor ")

[ModelRenderEnvironment
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Render_ModelRenderEnvironment.htm
"ModelRenderEnvironment Properties")

[ModelRenderEnvironment
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Render_ModelRenderEnvironment.htm
"ModelRenderEnvironment Methods")

[ModelRenderEnvironment Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Render_ModelRenderEnvironment.htm
"ModelRenderEnvironment Type Conversions")

!Click or drag to
resize

# ModelRenderEnvironment Class

---

Represents a Rhino render environment. Wraps the functionality of the
RenderEnvironment type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.Rhinoceros.RenderModelRenderContent
Grasshopper.Rhinoceros.RenderModelRenderEnvironment

**Namespace:**
Grasshopper.Rhinoceros.Render
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelRenderEnvironment : ModelRenderContent,
    	IGH_BakeAwareData

    Public NotInheritable Class ModelRenderEnvironment
    	Inherits ModelRenderContent
    	Implements IGH_BakeAwareData

The ModelRenderEnvironment type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelRenderEnvironment|
Initializes a new instance of the ModelRenderEnvironment class
|
ModelRenderEnvironment(ModelRenderEnvironmentAttributes)|
Initializes a new instance of the ModelRenderEnvironment class
|
ModelRenderEnvironment(Guid)|
Initializes a new instance of the ModelRenderEnvironment class
|
ModelRenderEnvironment(RenderEnvironment)|
Initializes a new instance of the ModelRenderEnvironment class
Top

Properties

| Name| Description
---|---|---
|
Id|  (Inherited from
ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
|
TypeName|
(Overrides
ModelRenderContentTypeName.)
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
CastToT(T)|
(Overrides
ModelContentCastToT(T).)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ModelRenderEnvironmentAttributes to
ModelRenderEnvironment)|
!Static
member| (ColorRGBA to
ModelRenderEnvironment)|
!Static
member| (RenderEnvironment to
ModelRenderEnvironment)|
!Static
member| (String to
ModelRenderEnvironment)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Render Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com