---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_Transforms_Rotation.htm
scraped_at: 2025-09-08T16:21:55.707597
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types.Transforms](../html/N_Grasshopper_Kernel_Types_Transforms.htm
"Grasshopper.Kernel.Types.Transforms")

[Rotation Class](../html/T_Grasshopper_Kernel_Types_Transforms_Rotation.htm
"Rotation Class")

[Rotation Constructor
](../html/Overload_Grasshopper_Kernel_Types_Transforms_Rotation__ctor.htm
"Rotation Constructor ")

[Rotation
Properties](../html/Properties_T_Grasshopper_Kernel_Types_Transforms_Rotation.htm
"Rotation Properties")

[Rotation
Methods](../html/Methods_T_Grasshopper_Kernel_Types_Transforms_Rotation.htm
"Rotation Methods")

!Click or drag to
resize

# Rotation Class

---

Implements a rotation transformation.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.Types.TransformsRotation

**Namespace:**
Grasshopper.Kernel.Types.Transforms
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class Rotation : ITransform

    Public Class Rotation
    	Implements ITransform

The Rotation type exposes the following members.

Constructors

| Name| Description
---|---|---
|
Rotation|
Initializes a new instance of the Rotation class
| Rotation(Point3d, Vector3d,
Vector3d)|
Initializes a new instance of the Rotation class
| Rotation(Point3d, Vector3d,
Double)|
Initializes a new instance of the Rotation class
Top

Properties

| Name| Description
---|---|---
|
Name|
|
RotationAngle|
|
RotationAxis|
|
RotationCenter|
Top

Methods

| Name| Description
---|---|---
|
Duplicate|
|
Read|
|
Reverse|
|
ToMatrix|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types.Transforms
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com