---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Undo_GH_UndoAction.htm
scraped_at: 2025-09-08T16:22:01.727646
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Undo](../html/N_Grasshopper_Kernel_Undo.htm
"Grasshopper.Kernel.Undo")

[GH_UndoAction Class](../html/T_Grasshopper_Kernel_Undo_GH_UndoAction.htm
"GH_UndoAction Class")

[GH_UndoAction Constructor
](../html/M_Grasshopper_Kernel_Undo_GH_UndoAction__ctor.htm "GH_UndoAction
Constructor ")

[GH_UndoAction
Properties](../html/Properties_T_Grasshopper_Kernel_Undo_GH_UndoAction.htm
"GH_UndoAction Properties")

[GH_UndoAction
Methods](../html/Methods_T_Grasshopper_Kernel_Undo_GH_UndoAction.htm
"GH_UndoAction Methods")

!Click or drag to
resize

# GH_UndoAction Class

---

Base class implementation for undo actions.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.UndoGH_UndoAction
Grasshopper.Kernel.Undo.ActionsGH_AddObjectAction
Grasshopper.Kernel.Undo.ActionsGH_WireAction
Grasshopper.Kernel.UndoGH_ArchivedUndoAction
Grasshopper.Kernel.UndoGH_ObjectUndoAction

**Namespace:** Grasshopper.Kernel.Undo
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_UndoAction : IGH_UndoAction

    Public MustInherit Class GH_UndoAction
    	Implements IGH_UndoAction

The GH_UndoAction type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_UndoAction|
Initializes a new instance of the GH_UndoAction class
Top

Properties

| Name| Description
---|---|---
|
ExpiresDisplay|
Override this property if you want the Rhino viewport display to refresh upon
undo completion.
|
ExpiresSolution|
Override this property if you want the Grasshopper solution to refresh upon
undo completion.
|
State|
Top

Methods

| Name| Description
---|---|---
|
Internal_Redo|
|
Internal_Undo|
|
Read|
|
Redo|
|
Undo|
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Undo Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com