---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_Viewport.htm
scraped_at: 2025-09-08T16:14:48.892906
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_Viewport Class](../html/T_Grasshopper_GUI_Canvas_GH_Viewport.htm
"GH_Viewport Class")

[GH_Viewport Constructor
](../html/Overload_Grasshopper_GUI_Canvas_GH_Viewport__ctor.htm "GH_Viewport
Constructor ")

[GH_Viewport
Properties](../html/Properties_T_Grasshopper_GUI_Canvas_GH_Viewport.htm
"GH_Viewport Properties")

[GH_Viewport Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_Viewport.htm
"GH_Viewport Methods")

[GH_Viewport Fields](../html/Fields_T_Grasshopper_GUI_Canvas_GH_Viewport.htm
"GH_Viewport Fields")

!Click or drag to
resize

# GH_Viewport Class

---

Provides functionality for panning and zooming in a GH_Canvas environment.

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.CanvasGH_Viewport

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_Viewport

    Public NotInheritable Class GH_Viewport

The GH_Viewport type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Viewport| Initializes a
new instance of the GH_Viewport class
|
GH_Viewport(GH_Viewport)|
Initializes a new instance of the GH_Viewport class
|
GH_Viewport(Point)|
Initializes a new instance of the GH_Viewport class
| GH_Viewport(Point,
Single)| Initializes a new
instance of the GH_Viewport class
Top

Properties

| Name| Description
---|---|---
|
ControlMidPoint|
Gets the point in the exact center of the viewport in control coordinates.
|
Diagonal|  Gets the
length of the diagonal of the viewport in canvas coordinates.
|
Height|  Gets or sets the
height of the viewport. Typically this is tied to the dimensions of the
canvas. Height is not allowed to go below 5 pixels.
|
MidPoint|  Gets or sets
the canvas coordinate that is directly underneath the center of the viewport.
|
ScreenPort|  Gets the
dimensions of the viewport in control coordinates.
|
Size|  Gets or sets the size
of the viewport. The size is typically tied to the dimensions of the Canvas.
|
Target|  Gets or sets the
location of the target pixel. The target represents where the canvas origin is
drawn.
|
TargetRatio|  Gets or
sets the target ratio with respect to the viewport dimensions. This is a
useful tool to prevent weird view changes during a canvas resize.
|
Tx|  Gets or sets the
x-component of the target pixel. The target represents where the canvas origin
is drawn.
|
Ty|  Gets or sets the
y-component of the target pixel. The target represents where the canvas origin
is drawn.
|
VisibleRegion|  Gets
the rectangle in canvas coordinates that is visible in the control.
|
Width|  Gets or sets the
width of the viewport. Typically this is tied to the dimensions of the canvas.
Width is not allowed to go below 5 pixels.
|
Zoom|  Gets or sets the Zoom
factor of the viewport. Please assign only sensible values.
|
ZoomBoolean|  Sets the zoom
of the viewport with a view anchor.
|
ZoomInverse|  Gets the
inverse of the zoom.
Top

Methods

| Name| Description
---|---|---
|
ApplyProjection|
Apply the current display transformation to a Graphics object.
|
ComputeProjection|
Forces a recomputation of all cached data.
|
DollyZoom|  Advanced
interface function for mouse 'dolly' zooming.
|
Duplicate|
|
Focus(IGH_Attributes)|  Look
at a specific object.
|
Focus(ListIGH_Attributes)|
Look at a set of specific objects.
|
Focus(Point)|  Look at a
specific point.
|
Focus(PointF)|  Look at a
specific point.
| IsVisible(PointF,
Single)|  Test visibility
of a point.
| IsVisible(RectangleF,
Single)|  Test
visibility of a rectangle.
|
LimitUnit|  Utility
function for calculating pixel dimensions in a zoom-aware environment. The
desired value is put through the zoom projection and if the resulting size (as
displayed on the screen) exceeds the visual limits it is clipped. This
function can be used for example to make sure that a certain penwidth never
exceeds visual limits (i.e. it doesn't get too thin or too thick on the
screen).
|
Project|  Transform a
point from canvas into control coordinate space.
|
ProjectPoint|
Project a point from canvas coordinates into control coordinates.
|
ProjectRectangle|
Project a rectangle from canvas coordinates into control coordinates.
|
ProjectX|  Project a
value along constant X from canvas coordinates into control coordinates.
|
ProjectY|  Project a
value along constant Y from canvas coordinates into control coordinates.
|
Set|
|
SolveUnit|  Utility
function for calculating graphics dimensions in a zoom-aware environment. This
function can be used for example to compute the linewidth of a pen which
always needs to appear as 3 pixels thick on the screen regardless of zoom
values.
|
Unproject|  Transform a
point from control into canvas coordinate space.
|
UnprojectPoint|
Project a point from control coordinates into canvas coordinates.
|
UnprojectRectangle|
Project a rectangle from control coordinates into canvas coordinates.
|
UnprojectX|  Project a
value along constant X from control coordinates into canvas coordinates.
|
UnprojectY|  Project a
value along constant Y from control coordinates into canvas coordinates.
|
XFormMatrix|  Gets the
display transformation cached by this viewport.
Top

Fields

| Name| Description
---|---|---
|
ZoomDefault|
|
ZoomDefaultLower|
|
ZoomDefaultUpper|
|
ZoomMaximum|
|
ZoomMinimum|
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com