---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Rectangle.htm
scraped_at: 2025-09-08T16:21:26.626210
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Rectangle Class](../html/T_Grasshopper_Kernel_Types_GH_Rectangle.htm
"GH_Rectangle Class")

[GH_Rectangle Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Rectangle__ctor.htm
"GH_Rectangle Constructor ")

[GH_Rectangle
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Rectangle.htm
"GH_Rectangle Properties")

[GH_Rectangle
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Rectangle.htm
"GH_Rectangle Methods")

[GH_Rectangle
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Rectangle.htm
"GH_Rectangle Fields")

!Click or drag to
resize

# GH_Rectangle Class

---

Represents a 3D rectangle. GH_Rectangle re-implements the RhinoCommon
Rectangle3d.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooRectangle3d
Grasshopper.Kernel.TypesGH_GeometricGooRectangle3d
Grasshopper.Kernel.TypesGH_Rectangle

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Rectangle : GH_GeometricGoo<Rectangle3d>,
    	IGH_BakeAwareData, IGH_PreviewData

    Public Class GH_Rectangle
    	Inherits GH_GeometricGoo(Of Rectangle3d)
    	Implements IGH_BakeAwareData, IGH_PreviewData

The GH_Rectangle type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Rectangle|  Default
constructor
|
GH_Rectangle(GH_Rectangle)|
Create a duplicate of another circle.
|
GH_Rectangle(Rectangle3d)|
Create a duplicate of another rectangle.
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|  Gets
the boundingbox for this geometry.  (Overrides
GH_GeometricGooTBoundingbox.)
|
ClippingBox|
|
IsGeometryLoaded|
Gets a value indicating whether or not this geometry is currently loaded
(assuming it is referenced). Not all IGH_GeometricGoo implementations support
referenced geometry. The default is to always return True.  (Inherited from
GH_GeometricGooT.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  Gets the
validity of this instance.  (Overrides
GH_GeometricGooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
ReferenceID|
Gets or sets the Guid of the object that is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry. The default
implementation is to always return Guid.Empty.  (Inherited from
GH_GeometricGooT.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets
the value of this type. Note that if the type has a ReferenceID this value
might get destroyed in the future.  (Inherited from
GH_GeometricGooT.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
|
CastFrom|  Remote to
Local caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  Local to
Remote caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GeometricGooTCastToQ(Q).)
|
ClearCaches|
Clears all caches. Typically if the geometry is referenced, this will erase
the local copy. If your T is a value-type, you must override this function and
specifically unset the local value.  (Inherited from
GH_GeometricGooT.)
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|
(Overrides
GH_GeometricGooTDuplicate.)
|
DuplicateGeometry|
Create a duplicate of this rectangle.  (Overrides
GH_GeometricGooTDuplicateGeometry.)
|
DuplicateRectangle|
Create a duplicate of this rectangle.
|
EmitProxy|  Returns a
proxy that represents this rectangle. Do not call this function unless you're
(Overrides
GH_GeometricGooTEmitProxy.)
|
GetBoundingBox|
(Overrides
GH_GeometricGooTGetBoundingBox(Transform).)
|
LoadGeometry|
If the geometry is referenced and currently unloaded, forces loading of the
geometry. Not all IGH_GeometricGoo implementations support referenced
geometry.  (Inherited from
GH_GeometricGooT.)
|
LoadGeometry(RhinoDoc)|
If the geometry is referenced and currently unloaded, forces loading of the
geometry. Not all IGH_GeometricGoo implementations support referenced
geometry. The default is to always return True.  (Inherited from
GH_GeometricGooT.)
|
Morph|  (Overrides
GH_GeometricGooTMorph(SpaceMorph).)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
This function will be called when the local IGH_Goo instance disappears into a
user Script. This would be an excellent place to cast your IGH_Goo type to a
simple data type.  (Inherited from
GH_GooT.)
|
ToString|  Format the
circle using default grasshopper formatting logic.  (Overrides
GH_GooTToString.)
|
Transform|
(Overrides
GH_GeometricGooTTransform(Transform).)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com