---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_CanvasWidgetListEventArgs.htm
scraped_at: 2025-09-08T16:14:32.813459
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_CanvasWidgetListEventArgs
Class](../html/T_Grasshopper_GUI_Canvas_GH_CanvasWidgetListEventArgs.htm
"GH_CanvasWidgetListEventArgs Class")

[GH_CanvasWidgetListEventArgs
Methods](../html/Methods_T_Grasshopper_GUI_Canvas_GH_CanvasWidgetListEventArgs.htm
"GH_CanvasWidgetListEventArgs Methods")

!Click or drag to
resize

# GH_CanvasWidgetListEventArgs Class

---

The event arguments are used in the WidgetListCreated event.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.GUI.CanvasGH_CanvasWidgetListEventArgs

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_CanvasWidgetListEventArgs : EventArgs

    Public Class GH_CanvasWidgetListEventArgs
    	Inherits EventArgs

The GH_CanvasWidgetListEventArgs type exposes the following members.

Methods

| Name| Description
---|---|---
|
AddWidget|
Append a widget to the canvas.
Top

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com