---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Render_ObjectRender.htm
scraped_at: 2025-09-08T16:24:47.445026
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Render](../html/N_Grasshopper_Rhinoceros_Render.htm
"Grasshopper.Rhinoceros.Render")

[ObjectRender Class](../html/T_Grasshopper_Rhinoceros_Render_ObjectRender.htm
"ObjectRender Class")

[ObjectRender Constructor
](../html/Overload_Grasshopper_Rhinoceros_Render_ObjectRender__ctor.htm
"ObjectRender Constructor ")

[ObjectRender
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Render_ObjectRender.htm
"ObjectRender Properties")

[ObjectRender
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Render_ObjectRender.htm
"ObjectRender Methods")

[ObjectRender Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Render_ObjectRender.htm
"ObjectRender Type Conversions")

!Click or drag to
resize

# ObjectRender Class

---

Represents a Rhino object render attributes.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.Rhinoceros.RenderObjectRender

**Namespace:**
Grasshopper.Rhinoceros.Render
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ObjectRender : ModelValue

    Public NotInheritable Class ObjectRender
    	Inherits ModelValue

The ObjectRender type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectRender|
Initializes a new instance of the ObjectRender class
|
ObjectRender(ObjectRenderAttributes)|
Initializes a new instance of the ObjectRender class
Top

Properties

| Name| Description
---|---|---
|
CastsShadows|
|
Material|
|
ReceivesShadows|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|  (Inherited
from ModelValue.)
|
CastToT(T)|
(Overrides
ModelValueCastToT(T).)
|
Equals(ModelValue)|
(Inherited from ModelValue.)
|
Equals(Object)|
(Overrides
ModelValueEquals(Object).)
|
GetHashCode|
(Overrides
ModelValueGetHashCode.)
|
ToAttributes|
|
ToDetails|
|
TooltipString|
(Inherited from ModelValue.)
|
ToString|  (Inherited from
ModelValue.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ObjectRenderAttributes to
ObjectRender)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Render Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com