---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_CanvasObjectMouseDownEventArgs.htm
scraped_at: 2025-09-08T16:12:17.203889
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_CanvasObjectMouseDownEventArgs
Class](../html/T_Grasshopper_GUI_GH_CanvasObjectMouseDownEventArgs.htm
"GH_CanvasObjectMouseDownEventArgs Class")

[GH_CanvasObjectMouseDownEventArgs Constructor
](../html/M_Grasshopper_GUI_GH_CanvasObjectMouseDownEventArgs__ctor.htm
"GH_CanvasObjectMouseDownEventArgs Constructor ")

[GH_CanvasObjectMouseDownEventArgs
Properties](../html/Properties_T_Grasshopper_GUI_GH_CanvasObjectMouseDownEventArgs.htm
"GH_CanvasObjectMouseDownEventArgs Properties")

!Click or drag to
resize

# GH_CanvasObjectMouseDownEventArgs Class

---

Event arguments for the CanvasObjectMouseDown events.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.GUIGH_CanvasObjectMouseDownEventArgs

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_CanvasObjectMouseDownEventArgs : EventArgs

    Public Class GH_CanvasObjectMouseDownEventArgs
    	Inherits EventArgs

The GH_CanvasObjectMouseDownEventArgs type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_CanvasObjectMouseDownEventArgs|
Initializes a new instance of the GH_CanvasObjectMouseDownEventArgs class
Top

Properties

| Name| Description
---|---|---
|
Canvas|
|
Document|
|
Object|
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com