---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Surface_GH_SurfaceProxy.htm
scraped_at: 2025-09-08T16:21:34.664934
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Surface.GH_SurfaceProxy
Class](../html/T_Grasshopper_Kernel_Types_GH_Surface_GH_SurfaceProxy.htm
"GH_Surface.GH_SurfaceProxy Class")

[GH_Surface.GH_SurfaceProxy Constructor
](../html/M_Grasshopper_Kernel_Types_GH_Surface_GH_SurfaceProxy__ctor.htm
"GH_Surface.GH_SurfaceProxy Constructor ")

[GH_SurfaceProxy
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Surface_GH_SurfaceProxy.htm
"GH_SurfaceProxy Properties")

[GH_SurfaceProxy
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Surface_GH_SurfaceProxy.htm
"GH_SurfaceProxy Methods")

!Click or drag to
resize

# GH_SurfaceGH_SurfaceProxy Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyGH_Surface
Grasshopper.Kernel.TypesGH_SurfaceGH_SurfaceProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_SurfaceProxy : GH_GooProxy<GH_Surface>

    Public Class GH_SurfaceProxy
    	Inherits GH_GooProxy(Of GH_Surface)

The GH_SurfaceGH_SurfaceProxy type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_SurfaceGH_SurfaceProxy|
Initializes a new instance of the GH_SurfaceGH_SurfaceProxy class
Top

Properties

| Name| Description
---|---|---
|
Area|
|
Closed|
|
Deformable|
|
EdgeCount|
|
LoopCount|
|
ObjectID|
|
Periodic|
|
Planar|
|
Singular|
|
Solid|
|
Trimmed|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
|
VertexCount|
|
Volume|
Top

Methods

| Name| Description
---|---|---
|
Construct|
(Overrides
GH_GooProxyTConstruct.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|
(Overrides
GH_GooProxyTFromString(String).)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com