---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Render_ObjectRenderMaterial.htm
scraped_at: 2025-09-08T16:24:49.456387
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Render](../html/N_Grasshopper_Rhinoceros_Render.htm
"Grasshopper.Rhinoceros.Render")

[ObjectRenderMaterial
Class](../html/T_Grasshopper_Rhinoceros_Render_ObjectRenderMaterial.htm
"ObjectRenderMaterial Class")

[ObjectRenderMaterial Constructor
](../html/Overload_Grasshopper_Rhinoceros_Render_ObjectRenderMaterial__ctor.htm
"ObjectRenderMaterial Constructor ")

[ObjectRenderMaterial
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Render_ObjectRenderMaterial.htm
"ObjectRenderMaterial Properties")

[ObjectRenderMaterial
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Render_ObjectRenderMaterial.htm
"ObjectRenderMaterial Methods")

[ObjectRenderMaterial Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Render_ObjectRenderMaterial.htm
"ObjectRenderMaterial Type Conversions")

!Click or drag to
resize

# ObjectRenderMaterial Class

---

Represents a Rhino object material.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.Rhinoceros.RenderObjectRenderMaterial

**Namespace:**
Grasshopper.Rhinoceros.Render
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ObjectRenderMaterial : ModelValue

    Public NotInheritable Class ObjectRenderMaterial
    	Inherits ModelValue

The ObjectRenderMaterial type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectRenderMaterial|
Initializes a new instance of the ObjectRenderMaterial class
|
ObjectRenderMaterial(ObjectRenderMaterialValue)|
Initializes a new instance of the ObjectRenderMaterial class
Top

Properties

| Name| Description
---|---|---
|
Material|
|
Source|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|  (Inherited
from ModelValue.)
|
CastToT(T)|
(Overrides
ModelValueCastToT(T).)
|
Equals(ModelValue)|
(Inherited from ModelValue.)
|
Equals(Object)|
(Overrides
ModelValueEquals(Object).)
|
GetHashCode|
(Overrides
ModelValueGetHashCode.)
|
TooltipString|
(Inherited from ModelValue.)
|
ToString|  (Inherited from
ModelValue.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ObjectRenderMaterial to
ObjectRenderMaterialValue)|
!Static
member| (ObjectRenderMaterialValue to
ObjectRenderMaterial)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Render Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com