---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Theme_GH_PageSettings.htm
scraped_at: 2025-09-08T16:15:11.963580
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Theme](../html/N_Grasshopper_GUI_Theme.htm
"Grasshopper.GUI.Theme")

[GH_PageSettings Class](../html/T_Grasshopper_GUI_Theme_GH_PageSettings.htm
"GH_PageSettings Class")

[GH_PageSettings
Properties](../html/Properties_T_Grasshopper_GUI_Theme_GH_PageSettings.htm
"GH_PageSettings Properties")

!Click or drag to
resize

# GH_PageSettings Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.GUI.ThemeGH_PageSettings

**Namespace:** Grasshopper.GUI.Theme
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PageSettings

    Public Class GH_PageSettings

The GH_PageSettings type exposes the following members.

Properties

| Name| Description
---|---|---
|
DrawGrid|  Gets or
sets whether the grid ought to be drawn.
|
DrawPage|  Gets or
sets whether the page ought to be drawn.
|
DrawShadow|  Gets or
sets whether the page shadow ought to be drawn. If the page is not drawn,
neither is the page shadow, irregardless of this property.
|
EdgeColour|  Gets or
sets the page edge colour to be used.
|
FillColour|  Gets or
sets the page fill colour to be used.
|
GridColour|  Gets or
sets the page grid colour to be used.
|
GridHeight|  Gets or
sets the height of a page grid cell.
|
GridPattern|  Gets
or sets the dash pattern to apply to grid lines. Leave null or empty for a
solid line.
|
GridWidth|  Gets or
sets the width of a page grid cell.
|
ShadowColour|
Gets or set the page shadow colour to be used.
|
ShadowSize|  Gets or
sets the size of the page shadow.
Top

See Also

#### Reference

Grasshopper.GUI.Theme Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com