---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelUserText.htm
scraped_at: 2025-09-08T16:22:44.936336
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelUserText Structure](../html/T_Grasshopper_Rhinoceros_ModelUserText.htm
"ModelUserText Structure")

[ModelUserText Constructor
](../html/M_Grasshopper_Rhinoceros_ModelUserText__ctor.htm "ModelUserText
Constructor ")

[ModelUserText
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelUserText.htm
"ModelUserText Properties")

[ModelUserText
Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelUserText.htm
"ModelUserText Methods")

[ModelUserText
Operators](../html/Operators_T_Grasshopper_Rhinoceros_ModelUserText.htm
"ModelUserText Operators")

[ModelUserText
Fields](../html/Fields_T_Grasshopper_Rhinoceros_ModelUserText.htm
"ModelUserText Fields")

!Click or drag to
resize

# ModelUserText Structure

---

Represents an immutable collection of string/string pairs.

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct ModelUserText : GH_ISerializable,
    	IReadOnlyList<KeyValuePair<string, string>>, IReadOnlyDictionary<string, string>,
    	IEquatable<ModelUserText>, IStructuralEquatable

    Public Structure ModelUserText
    	Implements GH_ISerializable, IReadOnlyList(Of KeyValuePair(Of String, String)),
    	IReadOnlyDictionary(Of String, String), IEquatable(Of ModelUserText),
    	IStructuralEquatable

The ModelUserText type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelUserText| Initializes
a new instance of the ModelUserText class
Top

Properties

| Name| Description
---|---|---
|
Count|
|
IsDefault|
|
IsDefaultOrEmpty|
|
IsEmpty|
|
ItemInt32|
|
ItemString|
|
Keys|
|
Values|
Top

Methods

| Name| Description
---|---|---
|
ContainsKey|
|
EnsureRange(IEnumerableKeyValuePairString,
String)|
|
EnsureRange(IEnumerableString)|
|
Equals(ModelUserText)|
|
Equals(Object)|
(Overrides
[ValueTypeEquals(Object)](https://docs.microsoft.com/dotnet/api/system.valuetype.equals#system-
valuetype-equals\(system-object\)).)
|
GetEnumerator|
|
GetHashCode|
(Overrides
[ValueTypeGetHashCode](https://docs.microsoft.com/dotnet/api/system.valuetype.gethashcode#system-
valuetype-gethashcode).)
|
MergeRange(IEnumerableKeyValuePairString,
String)|
|
MergeRange(IEnumerableString)|
|
RemoveRange(IEnumerableKeyValuePairString,
String)|
|
RemoveRange(IEnumerableString)|
|
TryGetValue|
|
UpdateRange(IEnumerableKeyValuePairString,
String)|
|
UpdateRange(IEnumerableString)|
Top

Operators

| Name| Description
---|---|---
!Static
member| Addition(ModelUserText,
IEnumerableKeyValuePairString,
String)|
!Static
member| Addition(ModelUserText,
IEnumerableString)|
!Static
member| BitwiseAnd(ModelUserText,
IEnumerableKeyValuePairString,
String)|
!Static
member| BitwiseAnd(ModelUserText,
IEnumerableString)|
!Static
member| BitwiseOr(ModelUserText,
IEnumerableKeyValuePairString,
String)|
!Static
member| BitwiseOr(ModelUserText,
IEnumerableString)|
!Static
member|
Equality|
!Static
member|
Inequality|
!Static
member| Subtraction(ModelUserText,
IEnumerableKeyValuePairString,
String)|
!Static
member| Subtraction(ModelUserText,
IEnumerableString)|
Top

Fields

| Name| Description
---|---|---
|
Empty|
Top

Remarks

Key comparison is not case sensitive.

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com