---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Render_ModelRenderContent.htm
scraped_at: 2025-09-08T16:24:35.389632
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Render](../html/N_Grasshopper_Rhinoceros_Render.htm
"Grasshopper.Rhinoceros.Render")

[ModelRenderContent
Class](../html/T_Grasshopper_Rhinoceros_Render_ModelRenderContent.htm
"ModelRenderContent Class")

[ModelRenderContent
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Render_ModelRenderContent.htm
"ModelRenderContent Properties")

[ModelRenderContent
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Render_ModelRenderContent.htm
"ModelRenderContent Methods")

[ModelRenderContent
Fields](../html/Fields_T_Grasshopper_Rhinoceros_Render_ModelRenderContent.htm
"ModelRenderContent Fields")

!Click or drag to
resize

# ModelRenderContent Class

---

Represents a Rhino render content. Wraps the functionality of the
RenderContent type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.RhinocerosModelContent
Grasshopper.Rhinoceros.RenderModelRenderContent
Grasshopper.Rhinoceros.RenderModelRenderEnvironment
Grasshopper.Rhinoceros.RenderModelRenderMaterial
Grasshopper.Rhinoceros.RenderModelRenderTexture

**Namespace:**
Grasshopper.Rhinoceros.Render
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class ModelRenderContent : ModelContent

    Public MustInherit Class ModelRenderContent
    	Inherits ModelContent

The ModelRenderContent type exposes the following members.

Properties

| Name| Description
---|---|---
|
Attribs|
|
DefaultAttributes|
(Inherited from ModelData.)
|
Id|  (Inherited from
ModelContent.)
|
IsReferencedData|
(Inherited from ModelContent.)
|
IsReferencedDataLoaded|
(Inherited from ModelContent.)
|
IsValid|  (Inherited from
ModelContent.)
|
IsValidWhyNot|
(Inherited from ModelContent.)
|
Name|  (Inherited from
ModelContent.)
|
Notes|  (Inherited from
ModelContent.)
|
Parent|  (Inherited from
ModelContent.)
|
Path|  (Inherited from
ModelContent.)
|
Tags|  (Inherited from
ModelContent.)
|
TypeDescription|
(Inherited from ModelData.)
|
TypeName|
(Overrides ModelData.TypeName.)
Top

Methods

| Name| Description
---|---|---
|
AsFrozen|  Try to obtain
a dereferenced snapshot of itself.  (Inherited from
ModelContent.)
|
CastToT(T)|  (Inherited
from ModelContent.)
|
CastToT(T)|  (Inherited
from ModelData.)
|
Equals(ModelContent)|
(Inherited from ModelContent.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|
(Inherited from ModelContent.)
|
GetHashCode|
(Inherited from ModelContent.)
|
InternaliseData|
(Inherited from ModelContent.)
|
LoadReferencedData|
(Inherited from ModelContent.)
|
Read|  (Inherited from
ModelContent.)
|
RuntimeId|  (Inherited
from ModelContent.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelContent.)
|
ToString|  (Inherited
from ModelContent.)
|
UnloadReferencedData|
(Inherited from ModelContent.)
|
Write|  (Inherited from
ModelContent.)
Top

Fields

| Name| Description
---|---|---
|
Serial|  (Inherited from
ModelData.)
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Render Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com