---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Annotations_AnnotationLeaderSettings.htm
scraped_at: 2025-09-08T16:22:54.974090
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Annotations](../html/N_Grasshopper_Rhinoceros_Annotations.htm
"Grasshopper.Rhinoceros.Annotations")

[AnnotationLeaderSettings
Class](../html/T_Grasshopper_Rhinoceros_Annotations_AnnotationLeaderSettings.htm
"AnnotationLeaderSettings Class")

[AnnotationLeaderSettings Constructor
](../html/Overload_Grasshopper_Rhinoceros_Annotations_AnnotationLeaderSettings__ctor.htm
"AnnotationLeaderSettings Constructor ")

[AnnotationLeaderSettings
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Annotations_AnnotationLeaderSettings.htm
"AnnotationLeaderSettings Properties")

[AnnotationLeaderSettings
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Annotations_AnnotationLeaderSettings.htm
"AnnotationLeaderSettings Methods")

[AnnotationLeaderSettings Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Annotations_AnnotationLeaderSettings.htm
"AnnotationLeaderSettings Type Conversions")

!Click or drag to
resize

# AnnotationLeaderSettings Class

---

Represents annotation leader settings.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelData
Grasshopper.Rhinoceros.AnnotationsAnnotationLeaderSettings

**Namespace:**
Grasshopper.Rhinoceros.Annotations
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class AnnotationLeaderSettings : ModelData

    Public NotInheritable Class AnnotationLeaderSettings
    	Inherits ModelData

The AnnotationLeaderSettings type exposes the following members.

Constructors

| Name| Description
---|---|---
|
AnnotationLeaderSettings|
Initializes a new instance of the AnnotationLeaderSettings class
|
AnnotationLeaderSettings(AnnotationLeaderSettingsAttributes)|
Initializes a new instance of the AnnotationLeaderSettings class
|
AnnotationLeaderSettings(DimensionStyle)|
Initializes a new instance of the AnnotationLeaderSettings class
Top

Properties

| Name| Description
---|---|---
|
ContentAngleType|
|
CurveType|
|
HasLanding|
|
LandingLength|
|
TextHorizontalAlignment|
|
TextOrientation|
|
TextVerticalAlignment|
Top

Methods

| Name| Description
---|---|---
|
CastToT|  (Inherited from
ModelData.)
|
Equals(ModelData)|
(Inherited from ModelData.)
|
Equals(Object)|  (Inherited
from ModelData.)
|
GetDimensionStyle|
|
GetHashCode|  (Inherited
from ModelData.)
|
ToAttributes|
|
ToDetails|  (Inherited
from ModelData.)
|
TooltipString|
(Inherited from ModelData.)
|
ToString|  (Inherited from
ModelData.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (AnnotationLeaderSettings to
DimensionStyle)|
!Static
member| (AnnotationLeaderSettingsAttributes to
AnnotationLeaderSettings)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Annotations
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com