---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_ValueProxy_1.htm
scraped_at: 2025-09-08T16:18:10.758068
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_ValueProxy(T) Class](../html/T_Grasshopper_Kernel_GH_ValueProxy_1.htm
"GH_ValueProxy\(T\) Class")

[GH_ValueProxy(T) Constructor
](../html/M_Grasshopper_Kernel_GH_ValueProxy_1__ctor.htm "GH_ValueProxy\(T\)
Constructor ")

[GH_ValueProxy(T)
Properties](../html/Properties_T_Grasshopper_Kernel_GH_ValueProxy_1.htm
"GH_ValueProxy\(T\) Properties")

[GH_ValueProxy(T)
Methods](../html/Methods_T_Grasshopper_Kernel_GH_ValueProxy_1.htm
"GH_ValueProxy\(T\) Methods")

[GH_ValueProxy(T)
Fields](../html/Fields_T_Grasshopper_Kernel_GH_ValueProxy_1.htm
"GH_ValueProxy\(T\) Fields")

!Click or drag to
resize

# GH_ValueProxyT Class

---

Represents the abstract base implementation of the IGH_ValueProxy interface.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_ValueProxyT

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class GH_ValueProxy<T> : IGH_ValueProxy

    Public MustInherit Class GH_ValueProxy(Of T)
    	Implements IGH_ValueProxy

#### Type Parameters

T

    The type of this implementation

The GH_ValueProxyT type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_ValueProxyT|  Default
constructor for the base class. All derived classes must call this
constructor.
Top

Properties

| Name| Description
---|---|---
|
IsValid|
Top

Methods

| Name| Description
---|---|---
|
Duplicate|
|
Duplicate_T|
|
FromString|  Performs
the String->Value parsing. The default implementation always returns False.
|
MutateString|
|
ToString|  Performs a
default ToString operation on the local value. If the value is Nothing, an
empty String is returned.  (Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
Top

Fields

| Name| Description
---|---|---
|
m_IsStringProxy|
|
m_Name|
|
m_UserString|
|
m_Valid|
|
m_Value|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com