---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelMeshingParameters.htm
scraped_at: 2025-09-08T16:22:40.917794
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelMeshingParameters
Class](../html/T_Grasshopper_Rhinoceros_ModelMeshingParameters.htm
"ModelMeshingParameters Class")

[ModelMeshingParameters Constructor
](../html/M_Grasshopper_Rhinoceros_ModelMeshingParameters__ctor.htm
"ModelMeshingParameters Constructor ")

[ModelMeshingParameters
Properties](../html/Properties_T_Grasshopper_Rhinoceros_ModelMeshingParameters.htm
"ModelMeshingParameters Properties")

[ModelMeshingParameters
Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelMeshingParameters.htm
"ModelMeshingParameters Methods")

[ModelMeshingParameters Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_ModelMeshingParameters.htm
"ModelMeshingParameters Type Conversions")

!Click or drag to
resize

# ModelMeshingParameters Class

---

Represents some meshing parameters. Wraps the functionality of the
MeshingParameters type.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.RhinocerosModelMeshingParameters

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ModelMeshingParameters : ModelValue

    Public NotInheritable Class ModelMeshingParameters
    	Inherits ModelValue

The ModelMeshingParameters type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelMeshingParameters|
Initializes a new instance of the ModelMeshingParameters class
Top

Properties

| Name| Description
---|---|---
!Static
member|
DefaultAnalysis|
!Static
member|
DefaultRender|
!Static
member|
FastRender|
!Static
member|
QualityRender|
!Static
member|
Unset|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelValueCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelValue.)
|
Equals(ModelValue)|
(Inherited from ModelValue.)
|
Equals(Object)|
(Overrides
ModelValueEquals(Object).)
|
GetHashCode|
(Overrides
ModelValueGetHashCode.)
|
ToMeshingParameters|
|
TooltipString|
(Inherited from ModelValue.)
|
ToString|  (Inherited from
ModelValue.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (MeshingParameters to
ModelMeshingParameters)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com