---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DocEnabledEventArgs.htm
scraped_at: 2025-09-08T16:16:04.180993
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocEnabledEventArgs
Class](../html/T_Grasshopper_Kernel_GH_DocEnabledEventArgs.htm
"GH_DocEnabledEventArgs Class")

[GH_DocEnabledEventArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_DocEnabledEventArgs.htm
"GH_DocEnabledEventArgs Properties")

!Click or drag to
resize

# GH_DocEnabledEventArgs Class

---

These arguments are passed along with SettingsChanged events on GH_Document.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_DocEnabledEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_DocEnabledEventArgs : EventArgs

    Public Class GH_DocEnabledEventArgs
    	Inherits EventArgs

The GH_DocEnabledEventArgs type exposes the following members.

Properties

| Name| Description
---|---|---
|
Document|  Gets
the document that raised the event.
|
Enabled|  Gets the
value of the document Enabled flag at the time the event was raised, it _may_
have been changed in between by other event handlers.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com