---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_TooltipComponent.htm
scraped_at: 2025-09-08T16:13:12.451528
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_TooltipComponent Class](../html/T_Grasshopper_GUI_GH_TooltipComponent.htm
"GH_TooltipComponent Class")

[GH_TooltipComponent Constructor
](../html/M_Grasshopper_GUI_GH_TooltipComponent__ctor.htm "GH_TooltipComponent
Constructor ")

[GH_TooltipComponent
Properties](../html/Properties_T_Grasshopper_GUI_GH_TooltipComponent.htm
"GH_TooltipComponent Properties")

[GH_TooltipComponent
Methods](../html/Methods_T_Grasshopper_GUI_GH_TooltipComponent.htm
"GH_TooltipComponent Methods")

[GH_TooltipComponent
Events](../html/Events_T_Grasshopper_GUI_GH_TooltipComponent.htm
"GH_TooltipComponent Events")

!Click or drag to
resize

# GH_TooltipComponent Class

---

This component provides Grasshopper tooltip functionality through a winforms
Component.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
Grasshopper.GUIGH_TooltipComponent

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_TooltipComponent : Component

    Public NotInheritable Class GH_TooltipComponent
    	Inherits Component

The GH_TooltipComponent type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_TooltipComponent|
Initializes a new instance of the GH_TooltipComponent class
Top

Properties

| Name| Description
---|---|---
|
Delay|  Gets or sets the
delay (in milliseconds) for this tooltip to appear.
|
Enabled|  Gets or sets
the Enabled flag.
|
Tag|  Provides an easy way to
store information on this Tooltip.
|
Target|  Gets or sets the
control this tooltip is tied to.
Top

Methods

| Name| Description
---|---|---
|
Hide|
|
IsTag|  Test whether the
current Tooltip tag matches the object.
Top

Events

| Name| Description
---|---|---
|
PopulateTooltip|
This event is raised just prior to the tooltip display.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com