---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_Animator_1.htm
scraped_at: 2025-09-08T16:12:11.190256
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_Animator(T) Class](../html/T_Grasshopper_GUI_GH_Animator_1.htm
"GH_Animator\(T\) Class")

[GH_Animator(T) Constructor
](../html/Overload_Grasshopper_GUI_GH_Animator_1__ctor.htm "GH_Animator\(T\)
Constructor ")

[GH_Animator(T)
Properties](../html/Properties_T_Grasshopper_GUI_GH_Animator_1.htm
"GH_Animator\(T\) Properties")

[GH_Animator(T) Methods](../html/Methods_T_Grasshopper_GUI_GH_Animator_1.htm
"GH_Animator\(T\) Methods")

!Click or drag to
resize

# GH_AnimatorT Class

---

Provides methods for animating values.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_AnimatorT

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Animator<T>

    Public Class GH_Animator(Of T)

#### Type Parameters

T

    Data type to animate.

The GH_AnimatorT type exposes the following members.

Constructors

| Name| Description
---|---|---
| GH_AnimatorT(T, T, TimeSpan,
GH_AnimatorTInterpolate)|
Create a new instance of the generic animator.
| GH_AnimatorT(T, T, DateTime,
DateTime,
GH_AnimatorTInterpolate)|  Create
a new instance of the generic animator.
Top

Properties

| Name| Description
---|---|---
|
Interpolation|  Gets or
sets the interpolation mode. Changing the mode during an animation will result
in discontinuous motion.
|
Phase|  Gets the current
animation phase.
|
ValueA|  Gets or sets the start
value of the animation. This value is set from within the constructor though
you can change it at any time.
|
ValueB|  Gets or sets the end
value of the animation. This value is set from within the constructor though
you can change it at any time.
Top

Methods

| Name| Description
---|---|---
|
AdjustAnimation(T)|
Adjust the animation.
| AdjustAnimation(T,
Int32)|  Adjust the
animation.
| AdjustAnimation(T, DateTime,
DateTime)|  Adjust the
animation.
|
CurrentValue|  Gets the
current animated value.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com