---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_State.htm
scraped_at: 2025-09-08T16:17:58.721696
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

GH_State Class

[GH_State Constructor ](../html/Overload_Grasshopper_Kernel_GH_State__ctor.htm
"GH_State Constructor ")

[GH_State Properties](../html/Properties_T_Grasshopper_Kernel_GH_State.htm
"GH_State Properties")

[GH_State Methods](../html/Methods_T_Grasshopper_Kernel_GH_State.htm "GH_State
Methods")

!Click or drag to
resize

# GH_State Class

---

Represents a single recorded document state. A state contains values for an
arbitrary set of objects inside the document.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_State

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_State : GH_ISerializable

    Public Class GH_State
    	Implements GH_ISerializable

The GH_State type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_State| Initializes a new
instance of the GH_State class
|
GH_State(GH_State)| Initializes a
new instance of the GH_State class
Top

Properties

| Name| Description
---|---|---
|
DataGuid|  Gets the state data
stored under the specified ID
|
DataInt32|  Gets the state data
stored under the specified index
|
LastModified|  Gets the date
at which this state was last modified.
|
Name|  Gets or sets the name of this
state.
|
StateCount|  Gets the number
of items stored in the state database.
|
StateData|  Gets a pointer to
the internal database of states.
Top

Methods

| Name| Description
---|---|---
|
AddStateObject|  Append a
new object to the database.
|
ClearStates|  Removes all
items from the state database.
|
CreateStateFromDocument|
Creates a state database from a document.
|
Read|
|
RemoveStateObject|
Remove an object from the database.
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com