---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Tracing.htm
scraped_at: 2025-09-08T16:11:49.105622
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper

Tracing Class

Tracing Methods

!Click or drag to
resize

# Tracing Class

---

Class that provides useful static methods for debugging, tracing and
messaging.

Inheritance Hierarchy

SystemObject
GrasshopperTracing

**Namespace:** Grasshopper
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class Tracing

    Public NotInheritable Class Tracing

The Tracing type exposes the following members.

Methods

| Name| Description
---|---|---
|
Assert(Guid)|  Display a typical ASSERT
dialog with stack information.
|
Assert(Guid, Exception)|  Display a
typical assert dialog with stack information.
|
Assert(Guid, String)|  Display a typical
assert dialog with stack information.
|
Assert(Guid, String, Exception)|
Display a typical assert dialog with stack information.
|
DebugLogAddEntry|  Add a message
to the debug log. If the debug log doesn't exist yet, it will be created. This
function will only work if the Grasshopper window exists. This method is
threadsafe.
|
DebugLogBeginBlock|  Start a
new block in the debug data. You _must_ end all your own blocks. This function
will only work if the Grasshopper window exists. This method is threadsafe.
|
DebugLogEndBlock|  Start a new
block in the debug data. You _must_ end all your own blocks. This function
will only work if the Grasshopper window exists. This method is threadsafe.
Top

See Also

#### Reference

Grasshopper Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com