---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_IGH_Goo.htm
scraped_at: 2025-09-08T16:21:45.674215
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[IGH_Goo Interface](../html/T_Grasshopper_Kernel_Types_IGH_Goo.htm "IGH_Goo
Interface")

[IGH_Goo Properties](../html/Properties_T_Grasshopper_Kernel_Types_IGH_Goo.htm
"IGH_Goo Properties")

[IGH_Goo Methods](../html/Methods_T_Grasshopper_Kernel_Types_IGH_Goo.htm
"IGH_Goo Methods")

!Click or drag to
resize

# IGH_Goo Interface

---

Base interface for all Data inside Grasshopper. Every parameter must implement
a type of Goo.

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_Goo : GH_ISerializable

    Public Interface IGH_Goo
    	Inherits GH_ISerializable

The IGH_Goo type exposes the following members.

Properties

| Name| Description
---|---|---
|
IsValid|  Gets a value
indicating whether or not the current value is valid.
|
IsValidWhyNot|  Gets a
string describing the state of "invalidness". If the instance _is_ valid, then
this property should return Nothing or String.Empty.
|
TypeDescription|
Gets a description of the type of the implementation.
|
TypeName|  Gets the name of
the type of the implementation.
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  Attempt a cast
from generic object
|
CastToT|  Attempt a cast
to type T
|
Duplicate|  Make a
complete duplicate of this instance. No shallow copies.
|
EmitProxy|  Create a new
proxy for this instance. Return Null if this class does not support proxies.
|
Read|  This method is called whenever the
instance is required to deserialize itself.  (Inherited from
GH_ISerializable.)
|
ScriptVariable|  This
function will be called when the local IGH_Goo instance disapears into a user
Script. This would be an excellent place to cast your IGH_Goo type to a simple
data type.
|
ToString|  Creates a string
description of the current instance value
|
Write|  This method is called whenever
the instance is required to serialize itself.  (Inherited from
GH_ISerializable.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com