---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_TreeIndex.htm
scraped_at: 2025-09-08T16:19:23.079437
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_TreeIndex Structure](../html/T_Grasshopper_Kernel_Data_GH_TreeIndex.htm
"GH_TreeIndex Structure")

[GH_TreeIndex Constructor
](../html/M_Grasshopper_Kernel_Data_GH_TreeIndex__ctor.htm "GH_TreeIndex
Constructor ")

[GH_TreeIndex
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_TreeIndex.htm
"GH_TreeIndex Properties")

!Click or drag to
resize

# GH_TreeIndex Structure

---

Represents a single unique location in a DataTree.

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public struct GH_TreeIndex

    Public Structure GH_TreeIndex

The GH_TreeIndex type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_TreeIndex|  Create a
new instance of the GH_TreeIndex structure with preset path and item index.
Top

Properties

| Name| Description
---|---|---
|
Item|  Gets or sets the
item index.
|
Path|  Gets or sets the
Path identifier.
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com