---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_PointUtil.htm
scraped_at: 2025-09-08T16:21:23.577885
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_PointUtil Class](../html/T_Grasshopper_Kernel_Types_GH_PointUtil.htm
"GH_PointUtil Class")

[GH_PointUtil
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_PointUtil.htm
"GH_PointUtil Methods")

!Click or drag to
resize

# GH_PointUtil Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_PointUtil

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_PointUtil

    Public NotInheritable Class GH_PointUtil

The GH_PointUtil type exposes the following members.

Methods

| Name| Description
---|---|---
|
FitPlaneThroughPoints|
Fit a least-squares plane through a collection of points.
|
ProjectPointsToPlane|
Project a list of points onto the plane. The result will be points in plane-uv
coordinates.
|
PullPointsToPlane|
Pull a list of points onto the plane. The result will be points in 3D world
coordinates which are coincident with the given plane.
|
RemapPointsToPlane|
Remap a list of points onto the plane. This operation equals a
ChangeBasisXForm for each point.
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com