---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Culture.htm
scraped_at: 2025-09-08T16:20:28.378914
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Culture Class](../html/T_Grasshopper_Kernel_Types_GH_Culture.htm
"GH_Culture Class")

[GH_Culture Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Culture__ctor.htm "GH_Culture
Constructor ")

[GH_Culture
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Culture.htm
"GH_Culture Properties")

[GH_Culture Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Culture.htm
"GH_Culture Methods")

[GH_Culture Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Culture.htm
"GH_Culture Fields")

!Click or drag to
resize

# GH_Culture Class

---

Represents a globally unique identifier. GH_Guid re-implements the framework
System.Guid type.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooCultureInfo
Grasshopper.Kernel.TypesGH_Culture

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Culture : GH_Goo<CultureInfo>

    Public Class GH_Culture
    	Inherits GH_Goo(Of CultureInfo)

The GH_Culture type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Culture|  Blank
constructor
|
GH_Culture(CultureInfo)|
Initializes a new instance of the GH_Culture class
|
GH_Culture(GH_Culture)|
Initializes a new instance of the GH_Culture class
Top

Properties

| Name| Description
---|---|---
|
IsValid|  Gets the
validity of this instance. Guids are always valid.  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|  Gets
a string describing the state of "invalidness". If the instance _is_ valid,
then this property should return Nothing or String.Empty.  (Inherited from
GH_GooT.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  (Overrides
GH_GooTCastFrom(Object).)
|
CastToT(T)|  (Overrides
GH_GooTCastToQ(Q).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
Duplicate|  (Overrides
GH_GooTDuplicate.)
|
DuplicateCulture|
|
EmitProxy|  (Overrides
GH_GooTEmitProxy.)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com