---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Undo_Actions_GH_RemoveObjectAction.htm
scraped_at: 2025-09-08T16:22:21.825048
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Undo.Actions](../html/N_Grasshopper_Kernel_Undo_Actions.htm
"Grasshopper.Kernel.Undo.Actions")

[GH_RemoveObjectAction
Class](../html/T_Grasshopper_Kernel_Undo_Actions_GH_RemoveObjectAction.htm
"GH_RemoveObjectAction Class")

[GH_RemoveObjectAction Constructor
](../html/M_Grasshopper_Kernel_Undo_Actions_GH_RemoveObjectAction__ctor.htm
"GH_RemoveObjectAction Constructor ")

[GH_RemoveObjectAction
Properties](../html/Properties_T_Grasshopper_Kernel_Undo_Actions_GH_RemoveObjectAction.htm
"GH_RemoveObjectAction Properties")

[GH_RemoveObjectAction
Methods](../html/Methods_T_Grasshopper_Kernel_Undo_Actions_GH_RemoveObjectAction.htm
"GH_RemoveObjectAction Methods")

[GH_RemoveObjectAction
Fields](../html/Fields_T_Grasshopper_Kernel_Undo_Actions_GH_RemoveObjectAction.htm
"GH_RemoveObjectAction Fields")

!Click or drag to
resize

# GH_RemoveObjectAction Class

---

Records a single object removal.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.UndoGH_UndoAction
Grasshopper.Kernel.UndoGH_ArchivedUndoAction
Grasshopper.Kernel.Undo.ActionsGH_RemoveObjectAction

**Namespace:**
Grasshopper.Kernel.Undo.Actions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RemoveObjectAction : GH_ArchivedUndoAction

    Public Class GH_RemoveObjectAction
    	Inherits GH_ArchivedUndoAction

The GH_RemoveObjectAction type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_RemoveObjectAction|
Initializes a new instance of the GH_RemoveObjectAction class
Top

Properties

| Name| Description
---|---|---
|
ExpiresDisplay|
Override this property if you want the Rhino viewport display to refresh upon
undo completion.  (Inherited from
GH_UndoAction.)
|
ExpiresSolution|
(Overrides
GH_UndoActionExpiresSolution.)
|
State|  (Inherited from
GH_UndoAction.)
Top

Methods

| Name| Description
---|---|---
|
Deserialize|
Deserializes the obj from the local archive.  (Inherited from
GH_ArchivedUndoAction.)
|
Internal_Redo|
(Overrides
GH_UndoActionInternal_Redo(GH_Document).)
|
Internal_Undo|
(Overrides
GH_UndoActionInternal_Undo(GH_Document).)
|
Read|  (Inherited
from
GH_ArchivedUndoAction.)
|
Redo|  (Inherited from
GH_UndoAction.)
|
Serialize|
Serializes the obj into the local archive.  (Inherited from
GH_ArchivedUndoAction.)
|
SerializeToByteArray|
Serializes the obj into the local archive.  (Inherited from
GH_ArchivedUndoAction.)
|
Undo|  (Inherited from
GH_UndoAction.)
|
Write|
(Inherited from
GH_ArchivedUndoAction.)
Top

Fields

| Name| Description
---|---|---
|
m_data|
Internal data storage for serialized archives.  (Inherited from
GH_ArchivedUndoAction.)
Top

See Also

#### Reference

Grasshopper.Kernel.Undo.Actions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com