---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Expressions_GH_SyntaxException.htm
scraped_at: 2025-09-08T16:19:46.172693
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Expressions](../html/N_Grasshopper_Kernel_Expressions.htm
"Grasshopper.Kernel.Expressions")

[GH_SyntaxException
Class](../html/T_Grasshopper_Kernel_Expressions_GH_SyntaxException.htm
"GH_SyntaxException Class")

[GH_SyntaxException Constructor
](../html/M_Grasshopper_Kernel_Expressions_GH_SyntaxException__ctor.htm
"GH_SyntaxException Constructor ")

!Click or drag to
resize

# GH_SyntaxException Class

---

Inheritance Hierarchy

SystemObject
SystemException
Grasshopper.Kernel.ExpressionsGH_SyntaxException

**Namespace:**
Grasshopper.Kernel.Expressions
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_SyntaxException : Exception

    Public Class GH_SyntaxException
    	Inherits Exception

The GH_SyntaxException type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_SyntaxException|
Initializes a new instance of the GH_SyntaxException class
Top

See Also

#### Reference

Grasshopper.Kernel.Expressions
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com