---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_ModelData_Attributes.htm
scraped_at: 2025-09-08T16:22:38.890152
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros](../html/N_Grasshopper_Rhinoceros.htm
"Grasshopper.Rhinoceros")

[ModelData.Attributes
Class](../html/T_Grasshopper_Rhinoceros_ModelData_Attributes.htm
"ModelData.Attributes Class")

[ModelData.Attributes Constructor
](../html/M_Grasshopper_Rhinoceros_ModelData_Attributes__ctor.htm
"ModelData.Attributes Constructor ")

[Attributes
Methods](../html/Methods_T_Grasshopper_Rhinoceros_ModelData_Attributes.htm
"Attributes Methods")

!Click or drag to
resize

# ModelDataAttributes Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
More...

**Namespace:** Grasshopper.Rhinoceros
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public abstract class Attributes : ICloneable

    Public MustInherit Class Attributes
    	Implements ICloneable

The ModelDataAttributes type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ModelDataAttributes|
Initializes a new instance of the ModelDataAttributes class
Top

Methods

| Name| Description
---|---|---
|
Clone|
|
Read|
|
SubClone|
|
ToDetails|
|
ToModelData|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|
Top

See Also

#### Reference

Grasshopper.Rhinoceros Namespace

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelDataAttributes
Grasshopper.Rhinoceros.AnnotationsAnnotationArrowAttributes
Grasshopper.Rhinoceros.AnnotationsAnnotationArrowSettingsAttributes
Grasshopper.Rhinoceros.AnnotationsAnnotationDimensionSettingsAttributes
Grasshopper.Rhinoceros.AnnotationsAnnotationLeaderSettingsAttributes
Grasshopper.Rhinoceros.AnnotationsAnnotationTextSettingsAttributes
Grasshopper.Rhinoceros.AnnotationsAnnotationToleranceSettingsAttributes
Grasshopper.Rhinoceros.AnnotationsAnnotationUnitsSettingsAttributes
Grasshopper.RhinocerosModelContentAttributes

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com