---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_FileWatcher.htm
scraped_at: 2025-09-08T16:16:44.360502
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_FileWatcher Class](../html/T_Grasshopper_Kernel_GH_FileWatcher.htm
"GH_FileWatcher Class")

[GH_FileWatcher
Properties](../html/Properties_T_Grasshopper_Kernel_GH_FileWatcher.htm
"GH_FileWatcher Properties")

[GH_FileWatcher
Methods](../html/Methods_T_Grasshopper_Kernel_GH_FileWatcher.htm
"GH_FileWatcher Methods")

!Click or drag to
resize

# GH_FileWatcher Class

---

Provides easy mechanisms to monitor changes to the local File System.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_FileWatcher

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_FileWatcher : IDisposable

    Public Class GH_FileWatcher
    	Implements IDisposable

The GH_FileWatcher type exposes the following members.

Properties

| Name| Description
---|---|---
|
Active|  Gets or sets the
active flag on this watcher.
|
Buffer|  Gets or sets the
time during which events are buffered. If multiple events for the same file
occur within the buffered timespan, they will be merged into one event.
|
InvokeOnDefaultThread|
Gets or sets invoke behaviour for events. If true, then the event delegate is
called via the Grasshopper main UI thread. This is almost always what you
need.
|
IsDisposed|
|
Path|  Gets the file or folder
path currently being watched.
Top

Methods

| Name| Description
---|---|---
|
CreateDirectoryWatcher(String, String, GH_FileWatcherEvents,
GH_FileWatcherFileChanged)|
Create a new FileSystem Watcher object aimed at a specific file.
|
CreateDirectoryWatcher(String, String, GH_FileWatcherEvents,
GH_FileWatcherFileChangedSimple)|
Create a new FileSystem Watcher object aimed at a specific file.
|
CreateFileWatcher(String, GH_FileWatcherEvents,
GH_FileWatcherFileChanged)|
Create a new FileSystem Watcher object aimed at a specific file.
|
CreateFileWatcher(String, GH_FileWatcherEvents,
GH_FileWatcherFileChangedSimple)|
Create a new FileSystem Watcher object aimed at a specific file.
|
Dispose| Releases all
resources used by the GH_FileWatcher
|
Dispose(Boolean)|
Releases the unmanaged resources used by the GH_FileWatcher and optionally
releases the managed resources
|
SetCustomUIThread(Control)|
If you want to override the default Invoke behaviour, you must set
InvokeOnDefaultThread to False and supply either a custom Control or a Form.
|
SetCustomUIThread(Form)|
If you want to override the default Invoke behaviour, you must set
InvokeOnDefaultThread to False and supply either a custom Control or a Form.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com