---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_EtoUtil.htm
scraped_at: 2025-09-08T16:12:31.264310
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_EtoUtil Class](../html/T_Grasshopper_GUI_GH_EtoUtil.htm "GH_EtoUtil
Class")

[GH_EtoUtil Methods](../html/Methods_T_Grasshopper_GUI_GH_EtoUtil.htm
"GH_EtoUtil Methods")

!Click or drag to
resize

# GH_EtoUtil Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_EtoUtil

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_EtoUtil

    <ExtensionAttribute>
    Public NotInheritable Class GH_EtoUtil

The GH_EtoUtil type exposes the following members.

Methods

| Name| Description
---|---|---
|
CenterFormOnCursor|
Positions a Form so that it is centered around the cursor
|
CenterFormOnEditor|
Positions a Form so that it is centered on the active editor. If the editor
doesn't exist or is hidden, the form will be centered on the screen instead.
|
CenterFormOnScreen|
Positions a Form so that it is centered on the current screen. The current
screen being defined as the screen containing the cursor.
|
CenterFormOnWindow|
Positions a Form so that it is centered on the supplied window. If the window
doesn't exist or is hidden, the form will be centered on the screen instead.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com