---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_FontScroller.htm
scraped_at: 2025-09-08T16:12:38.307556
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_FontScroller Class](../html/T_Grasshopper_GUI_GH_FontScroller.htm
"GH_FontScroller Class")

[GH_FontScroller Constructor
](../html/M_Grasshopper_GUI_GH_FontScroller__ctor.htm "GH_FontScroller
Constructor ")

[GH_FontScroller
Properties](../html/Properties_T_Grasshopper_GUI_GH_FontScroller.htm
"GH_FontScroller Properties")

[GH_FontScroller
Methods](../html/Methods_T_Grasshopper_GUI_GH_FontScroller.htm
"GH_FontScroller Methods")

!Click or drag to
resize

# GH_FontScroller Class

---

Represents a panel with a scrolling collection of pangrams.

Inheritance Hierarchy

SystemObject
SystemMarshalByRefObject
System.ComponentModelComponent
System.Windows.FormsControl
System.Windows.FormsScrollableControl
System.Windows.FormsPanel
Grasshopper.GUIGH_DoubleBufferedPanel
Grasshopper.GUIGH_FontScroller

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_FontScroller : GH_DoubleBufferedPanel

    Public Class GH_FontScroller
    	Inherits GH_DoubleBufferedPanel

The GH_FontScroller type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_FontScroller| Initializes a
new instance of the GH_FontScroller class
Top

Properties

| Name| Description
---|---|---
|
PostPaintDelegate|
Top

Methods

| Name| Description
---|---|---
|
OnPaint|  (Overrides
[ControlOnPaint(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.control.onpaint#system-
windows-forms-control-onpaint\(system-windows-forms-painteventargs\)).)
|
OnPaintBackground|
(Overrides
[ScrollableControlOnPaintBackground(PaintEventArgs)](https://docs.microsoft.com/dotnet/api/system.windows.forms.scrollablecontrol.onpaintbackground#system-
windows-forms-scrollablecontrol-onpaintbackground\(system-windows-forms-
painteventargs\)).)
Top

Extension Methods

| Name| Description
---|---|---
|
ToEto|  (Defined by
EtoExtensions.)
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com