---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_SolutionExpiredEventArgs.htm
scraped_at: 2025-09-08T16:17:54.670957
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_SolutionExpiredEventArgs
Class](../html/T_Grasshopper_Kernel_GH_SolutionExpiredEventArgs.htm
"GH_SolutionExpiredEventArgs Class")

[GH_SolutionExpiredEventArgs Constructor
](../html/M_Grasshopper_Kernel_GH_SolutionExpiredEventArgs__ctor.htm
"GH_SolutionExpiredEventArgs Constructor ")

[GH_SolutionExpiredEventArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_SolutionExpiredEventArgs.htm
"GH_SolutionExpiredEventArgs Properties")

!Click or drag to
resize

# GH_SolutionExpiredEventArgs Class

---

Arguments for solution events.

Inheritance Hierarchy

SystemObject
SystemEventArgs
Grasshopper.KernelGH_SolutionExpiredEventArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_SolutionExpiredEventArgs : EventArgs

    Public Class GH_SolutionExpiredEventArgs
    	Inherits EventArgs

The GH_SolutionExpiredEventArgs type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_SolutionExpiredEventArgs|
Initializes a new instance of the GH_SolutionExpiredEventArgs class
Top

Properties

| Name| Description
---|---|---
|
Recompute|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com