---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Rhinoceros_Display_ObjectVisibility.htm
scraped_at: 2025-09-08T16:23:33.120593
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Rhinoceros.Display](../html/N_Grasshopper_Rhinoceros_Display.htm
"Grasshopper.Rhinoceros.Display")

[ObjectVisibility
Class](../html/T_Grasshopper_Rhinoceros_Display_ObjectVisibility.htm
"ObjectVisibility Class")

[ObjectVisibility Constructor
](../html/Overload_Grasshopper_Rhinoceros_Display_ObjectVisibility__ctor.htm
"ObjectVisibility Constructor ")

[ObjectVisibility
Properties](../html/Properties_T_Grasshopper_Rhinoceros_Display_ObjectVisibility.htm
"ObjectVisibility Properties")

[ObjectVisibility
Methods](../html/Methods_T_Grasshopper_Rhinoceros_Display_ObjectVisibility.htm
"ObjectVisibility Methods")

[ObjectVisibility Type
Conversions](../html/Operators_T_Grasshopper_Rhinoceros_Display_ObjectVisibility.htm
"ObjectVisibility Type Conversions")

!Click or drag to
resize

# ObjectVisibility Class

---

Represents a Rhino object visibility attributes.

Inheritance Hierarchy

SystemObject
Grasshopper.RhinocerosModelValue
Grasshopper.Rhinoceros.DisplayObjectVisibility

**Namespace:**
Grasshopper.Rhinoceros.Display
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class ObjectVisibility : ModelValue

    Public NotInheritable Class ObjectVisibility
    	Inherits ModelValue

The ObjectVisibility type exposes the following members.

Constructors

| Name| Description
---|---|---
|
ObjectVisibility|
Initializes a new instance of the ObjectVisibility class
|
ObjectVisibility(ObjectVisibilityAttributes)|
Initializes a new instance of the ObjectVisibility class
Top

Properties

| Name| Description
---|---|---
|
Hidden|
|
Locked|
|
Viewport|
Top

Methods

| Name| Description
---|---|---
|
Cast|
|
CastToT(T)|
(Overrides
ModelValueCastToT(T).)
|
CastToT(T)|  (Inherited
from ModelValue.)
|
Equals(ModelValue)|
(Inherited from ModelValue.)
|
Equals(Object)|
(Overrides
ModelValueEquals(Object).)
|
GetHashCode|
(Overrides
ModelValueGetHashCode.)
|
ToAttributes|
|
ToDetails|
|
TooltipString|
(Inherited from ModelValue.)
|
ToString|  (Inherited from
ModelValue.)
Top

Operators

| Name| Description
---|---|---
!Static
member| (ObjectVisibilityAttributes to
ObjectVisibility)|
Top

See Also

#### Reference

Grasshopper.Rhinoceros.Display
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com