---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_Transforms_Projection.htm
scraped_at: 2025-09-08T16:21:54.722908
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types.Transforms](../html/N_Grasshopper_Kernel_Types_Transforms.htm
"Grasshopper.Kernel.Types.Transforms")

[Projection
Class](../html/T_Grasshopper_Kernel_Types_Transforms_Projection.htm
"Projection Class")

[Projection Constructor
](../html/Overload_Grasshopper_Kernel_Types_Transforms_Projection__ctor.htm
"Projection Constructor ")

[Projection
Properties](../html/Properties_T_Grasshopper_Kernel_Types_Transforms_Projection.htm
"Projection Properties")

[Projection
Methods](../html/Methods_T_Grasshopper_Kernel_Types_Transforms_Projection.htm
"Projection Methods")

!Click or drag to
resize

# Projection Class

---

Implements a projection transformation.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.Types.TransformsProjection

**Namespace:**
Grasshopper.Kernel.Types.Transforms
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class Projection : ITransform

    Public Class Projection
    	Implements ITransform

The Projection type exposes the following members.

Constructors

| Name| Description
---|---|---
|
Projection|
Initializes a new instance of the Projection class
|
Projection(Plane)|
Initializes a new instance of the Projection class
Top

Properties

| Name| Description
---|---|---
|
Name|
|
ProjectionPlane|
Top

Methods

| Name| Description
---|---|---
|
Duplicate|
|
Read|
|
Reverse|
|
ToMatrix|
|
ToString|
(Overrides
[ObjectToString](https://docs.microsoft.com/dotnet/api/system.object.tostring#system-
object-tostring).)
|
Write|
Top

See Also

#### Reference

Grasshopper.Kernel.Types.Transforms
Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com