---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_TextDot.htm
scraped_at: 2025-09-08T16:21:35.637802
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_TextDot Class](../html/T_Grasshopper_Kernel_Types_GH_TextDot.htm
"GH_TextDot Class")

[GH_TextDot Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_TextDot__ctor.htm "GH_TextDot
Constructor ")

[GH_TextDot
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_TextDot.htm
"GH_TextDot Properties")

[GH_TextDot Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_TextDot.htm
"GH_TextDot Methods")

[GH_TextDot Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_TextDot.htm
"GH_TextDot Fields")

!Click or drag to
resize

# GH_TextDot Class

---

Represents an implementation of a Rhino text dot.

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooTextDot
Grasshopper.Kernel.TypesGH_GeometricGooTextDot
Grasshopper.Kernel.TypesGH_TextDot

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_TextDot : GH_GeometricGoo<TextDot>,
    	IGH_BakeAwareData, IGH_PreviewData

    Public Class GH_TextDot
    	Inherits GH_GeometricGoo(Of TextDot)
    	Implements IGH_BakeAwareData, IGH_PreviewData

The GH_TextDot type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_TextDot|  Default
constructor, creates an invalid text dot.
|
GH_TextDot(GH_TextDot)|
Create a duplicate of another GH_TextDot. This constructor also copies
reference data.
|
GH_TextDot(Guid)|  Create
a new referenced text dot that references a Rhino text dot with the specified
ID.
|
GH_TextDot(TextDot)|
Create a duplicate of an existing text dot.
Top

Properties

| Name| Description
---|---|---
|
Boundingbox|
(Overrides
GH_GeometricGooTBoundingbox.)
|
ClippingBox|
|
IsGeometryLoaded|
Gets the load state of this text dot object. The text dot is considered to be
loaded when the local text dot instance is not null.  (Overrides
GH_GeometricGooTIsGeometryLoaded.)
|
IsReferencedGeometry|
Gets a value indicating whether or not this geometry is referenced. Not all
IGH_GeometricGoo implementations support referenced geometry.  (Inherited from
GH_GeometricGooT.)
|
IsValid|  Gets the
validity of this text dot. If the text dot is referenced but cannot be loaded,
the text dot is not valid.  (Overrides
GH_GeometricGooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
ReferenceID|
(Overrides
GH_GeometricGooTReferenceID.)
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  (Overrides
GH_GeometricGooTValue.)
Top

Methods

| Name| Description
---|---|---
|
BakeGeometry|
|
CastFrom|  Remote to
Local caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GeometricGooTCastFrom(Object).)
|
CastToQ(Q)|
Attempt a cast to type T.  (Inherited from
GH_GeometricGooT.)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|  Local to
Remote caster function. This stuff is complex, don't concern yourself with
casting logic.  (Overrides
GH_GeometricGooTCastToQ(Q).)
|
ClearCaches|  Clears
all volatile caches for this instance. The boundingbox is cleared, and if the
text dot is referenced, the local instance of the text dot is erased.
(Overrides
GH_GeometricGooTClearCaches.)
|
DrawViewportMeshes|
|
DrawViewportWires|
|
Duplicate|  (Overrides
GH_GeometricGooTDuplicate.)
|
DuplicateGeometry|
Create a duplicate of this text dot.  (Overrides
GH_GeometricGooTDuplicateGeometry.)
|
DuplicateTextDot|
Create a duplicate of this text dot.
|
EmitProxy|  (Overrides
GH_GeometricGooTEmitProxy.)
|
GetBoundingBox|
(Overrides
GH_GeometricGooTGetBoundingBox(Transform).)
|
LoadGeometry|  If
the geometry is referenced and not yet loaded, attempts to load the geometry.
(Overrides
GH_GeometricGooTLoadGeometry.)
|
LoadGeometry(RhinoDoc)|
If the text dot is referenced and not yet loaded, attempts to load the text
dot.  (Overrides
GH_GeometricGooTLoadGeometry(RhinoDoc).)
|
Morph|  (Overrides
GH_GeometricGooTMorph(SpaceMorph).)
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|  Format the
text dot using default grasshopper formatting logic.  (Overrides
GH_GooTToString.)
|
Transform|  (Overrides
GH_GeometricGooTTransform(Transform).)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com