---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_PreviewMeshArgs.htm
scraped_at: 2025-09-08T16:17:37.612168
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_PreviewMeshArgs Class](../html/T_Grasshopper_Kernel_GH_PreviewMeshArgs.htm
"GH_PreviewMeshArgs Class")

[GH_PreviewMeshArgs Constructor
](../html/M_Grasshopper_Kernel_GH_PreviewMeshArgs__ctor.htm
"GH_PreviewMeshArgs Constructor ")

[GH_PreviewMeshArgs
Properties](../html/Properties_T_Grasshopper_Kernel_GH_PreviewMeshArgs.htm
"GH_PreviewMeshArgs Properties")

!Click or drag to
resize

# GH_PreviewMeshArgs Class

---

This class is passed to objects that implement IGH_PreviewData during mesh
drawing operations.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_PreviewMeshArgs

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PreviewMeshArgs

    Public Class GH_PreviewMeshArgs

The GH_PreviewMeshArgs type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PreviewMeshArgs|
Initializes a new instance of the GH_PreviewMeshArgs class
Top

Properties

| Name| Description
---|---|---
|
Material|  Gets the
material in which meshes ought to be drawn.
|
MeshingParameters|
Gets the meshing parameters which ought to be used for meshing breps and
surfaces. If this property returns a null reference, meshes are supposed to be
omitted.
|
Pipeline|  Gets the
Display Pipeline we're currently drawing with.
|
Viewport|  Gets the
Viewport in which we're currently drawing.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com