---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPostPaintGroupsEventHandler.htm
scraped_at: 2025-09-08T16:14:03.727267
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.GUI.Canvas](../html/N_Grasshopper_GUI_Canvas.htm
"Grasshopper.GUI.Canvas")

[GH_Border Class](../html/T_Grasshopper_GUI_Canvas_GH_Border.htm "GH_Border
Class")

[GH_BorderTopology
Enumeration](../html/T_Grasshopper_GUI_Canvas_GH_BorderTopology.htm
"GH_BorderTopology Enumeration")

[GH_Canvas Class](../html/T_Grasshopper_GUI_Canvas_GH_Canvas.htm "GH_Canvas
Class")

[GH_Canvas.CanvasPaintBackgroundEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPaintBackgroundEventHandler.htm
"GH_Canvas.CanvasPaintBackgroundEventHandler Delegate")

[GH_Canvas.CanvasPaintBeginEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPaintBeginEventHandler.htm
"GH_Canvas.CanvasPaintBeginEventHandler Delegate")

[GH_Canvas.CanvasPaintEndEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPaintEndEventHandler.htm
"GH_Canvas.CanvasPaintEndEventHandler Delegate")

[GH_Canvas.CanvasPostPaintGroupsEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPostPaintGroupsEventHandler.htm
"GH_Canvas.CanvasPostPaintGroupsEventHandler Delegate")

[GH_Canvas.CanvasPostPaintObjectsEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPostPaintObjectsEventHandler.htm
"GH_Canvas.CanvasPostPaintObjectsEventHandler Delegate")

[GH_Canvas.CanvasPostPaintOverlayEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPostPaintOverlayEventHandler.htm
"GH_Canvas.CanvasPostPaintOverlayEventHandler Delegate")

[GH_Canvas.CanvasPostPaintWidgetsEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPostPaintWidgetsEventHandler.htm
"GH_Canvas.CanvasPostPaintWidgetsEventHandler Delegate")

[GH_Canvas.CanvasPostPaintWiresEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPostPaintWiresEventHandler.htm
"GH_Canvas.CanvasPostPaintWiresEventHandler Delegate")

[GH_Canvas.CanvasPrePaintGroupsEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPrePaintGroupsEventHandler.htm
"GH_Canvas.CanvasPrePaintGroupsEventHandler Delegate")

[GH_Canvas.CanvasPrePaintObjectsEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPrePaintObjectsEventHandler.htm
"GH_Canvas.CanvasPrePaintObjectsEventHandler Delegate")

[GH_Canvas.CanvasPrePaintOverlayEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPrePaintOverlayEventHandler.htm
"GH_Canvas.CanvasPrePaintOverlayEventHandler Delegate")

[GH_Canvas.CanvasPrePaintWidgetsEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPrePaintWidgetsEventHandler.htm
"GH_Canvas.CanvasPrePaintWidgetsEventHandler Delegate")

[GH_Canvas.CanvasPrePaintWiresEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_CanvasPrePaintWiresEventHandler.htm
"GH_Canvas.CanvasPrePaintWiresEventHandler Delegate")

[GH_Canvas.Document_ModifiedChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_Document_ModifiedChangedEventHandler.htm
"GH_Canvas.Document_ModifiedChangedEventHandler Delegate")

[GH_Canvas.Document_ObjectsAddedEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_Document_ObjectsAddedEventHandler.htm
"GH_Canvas.Document_ObjectsAddedEventHandler Delegate")

[GH_Canvas.Document_ObjectsDeletedEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_Document_ObjectsDeletedEventHandler.htm
"GH_Canvas.Document_ObjectsDeletedEventHandler Delegate")

[GH_Canvas.Document_SettingsChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_Document_SettingsChangedEventHandler.htm
"GH_Canvas.Document_SettingsChangedEventHandler Delegate")

[GH_Canvas.DocumentChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_DocumentChangedEventHandler.htm
"GH_Canvas.DocumentChangedEventHandler Delegate")

[GH_Canvas.DocumentObjectMouseDownEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_DocumentObjectMouseDownEventHandler.htm
"GH_Canvas.DocumentObjectMouseDownEventHandler Delegate")

[GH_Canvas.DocumentObjectsDeletedEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_DocumentObjectsDeletedEventHandler.htm
"GH_Canvas.DocumentObjectsDeletedEventHandler Delegate")

[GH_Canvas.GH_ImageSettings
Class](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_GH_ImageSettings.htm
"GH_Canvas.GH_ImageSettings Class")

[GH_Canvas.ModifiersChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_ModifiersChangedEventHandler.htm
"GH_Canvas.ModifiersChangedEventHandler Delegate")

[GH_Canvas.NavigationSettingsChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_NavigationSettingsChangedEventHandler.htm
"GH_Canvas.NavigationSettingsChangedEventHandler Delegate")

[GH_Canvas.ViewportChangedEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_ViewportChangedEventHandler.htm
"GH_Canvas.ViewportChangedEventHandler Delegate")

[GH_Canvas.WidgetListCreatedEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_Canvas_WidgetListCreatedEventHandler.htm
"GH_Canvas.WidgetListCreatedEventHandler Delegate")

[GH_CanvasChannel
Enumeration](../html/T_Grasshopper_GUI_Canvas_GH_CanvasChannel.htm
"GH_CanvasChannel Enumeration")

[GH_CanvasDocumentChangedEventArgs
Class](../html/T_Grasshopper_GUI_Canvas_GH_CanvasDocumentChangedEventArgs.htm
"GH_CanvasDocumentChangedEventArgs Class")

[GH_CanvasDropTargetValidator
Class](../html/T_Grasshopper_GUI_Canvas_GH_CanvasDropTargetValidator.htm
"GH_CanvasDropTargetValidator Class")

[GH_CanvasMode Enumeration](../html/T_Grasshopper_GUI_Canvas_GH_CanvasMode.htm
"GH_CanvasMode Enumeration")

[GH_CanvasNavigation
Enumeration](../html/T_Grasshopper_GUI_Canvas_GH_CanvasNavigation.htm
"GH_CanvasNavigation Enumeration")

[GH_CanvasValidator
Class](../html/T_Grasshopper_GUI_Canvas_GH_CanvasValidator.htm
"GH_CanvasValidator Class")

[GH_CanvasViewportChangedEventArgs
Class](../html/T_Grasshopper_GUI_Canvas_GH_CanvasViewportChangedEventArgs.htm
"GH_CanvasViewportChangedEventArgs Class")

[GH_CanvasWidgetListEventArgs
Class](../html/T_Grasshopper_GUI_Canvas_GH_CanvasWidgetListEventArgs.htm
"GH_CanvasWidgetListEventArgs Class")

[GH_CanvasWireValidator
Class](../html/T_Grasshopper_GUI_Canvas_GH_CanvasWireValidator.htm
"GH_CanvasWireValidator Class")

[GH_Capsule Class](../html/T_Grasshopper_GUI_Canvas_GH_Capsule.htm "GH_Capsule
Class")

[GH_CapsuleRenderEngine
Class](../html/T_Grasshopper_GUI_Canvas_GH_CapsuleRenderEngine.htm
"GH_CapsuleRenderEngine Class")

[GH_DocDiagramPainter
Class](../html/T_Grasshopper_GUI_Canvas_GH_DocDiagramPainter.htm
"GH_DocDiagramPainter Class")

[GH_DragDropFileAction
Enumeration](../html/T_Grasshopper_GUI_Canvas_GH_DragDropFileAction.htm
"GH_DragDropFileAction Enumeration")

[GH_NamedView Class](../html/T_Grasshopper_GUI_Canvas_GH_NamedView.htm
"GH_NamedView Class")

[GH_NamedView.SmoothFrameEventHandler
Delegate](../html/T_Grasshopper_GUI_Canvas_GH_NamedView_SmoothFrameEventHandler.htm
"GH_NamedView.SmoothFrameEventHandler Delegate")

[GH_NamedViewType
Enumeration](../html/T_Grasshopper_GUI_Canvas_GH_NamedViewType.htm
"GH_NamedViewType Enumeration")

[GH_ObjectResponse
Enumeration](../html/T_Grasshopper_GUI_Canvas_GH_ObjectResponse.htm
"GH_ObjectResponse Enumeration")

[GH_Orientation
Enumeration](../html/T_Grasshopper_GUI_Canvas_GH_Orientation.htm
"GH_Orientation Enumeration")

[GH_Painter Class](../html/T_Grasshopper_GUI_Canvas_GH_Painter.htm "GH_Painter
Class")

[GH_Palette Enumeration](../html/T_Grasshopper_GUI_Canvas_GH_Palette.htm
"GH_Palette Enumeration")

[GH_PaletteStyle Class](../html/T_Grasshopper_GUI_Canvas_GH_PaletteStyle.htm
"GH_PaletteStyle Class")

[GH_ResizeBorder Class](../html/T_Grasshopper_GUI_Canvas_GH_ResizeBorder.htm
"GH_ResizeBorder Class")

GH_Skin Class

[GH_Viewport Class](../html/T_Grasshopper_GUI_Canvas_GH_Viewport.htm
"GH_Viewport Class")

[GH_Viewport.GH_DisplayMatrix
Enumeration](../html/T_Grasshopper_GUI_Canvas_GH_Viewport_GH_DisplayMatrix.htm
"GH_Viewport.GH_DisplayMatrix Enumeration")

[GH_WireDirection
Enumeration](../html/T_Grasshopper_GUI_Canvas_GH_WireDirection.htm
"GH_WireDirection Enumeration")

[GH_WireType Enumeration](../html/T_Grasshopper_GUI_Canvas_GH_WireType.htm
"GH_WireType Enumeration")

[IGH_CanvasValidator
Interface](../html/T_Grasshopper_GUI_Canvas_IGH_CanvasValidator.htm
"IGH_CanvasValidator Interface")

[IGH_ResponsiveObject
Interface](../html/T_Grasshopper_GUI_Canvas_IGH_ResponsiveObject.htm
"IGH_ResponsiveObject Interface")

[IGH_TooltipAwareObject
Interface](../html/T_Grasshopper_GUI_Canvas_IGH_TooltipAwareObject.htm
"IGH_TooltipAwareObject Interface")

!Click or drag to
resize

# GH_CanvasCanvasPostPaintGroupsEventHandler Delegate

---

**Namespace:** Grasshopper.GUI.Canvas
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public delegate void CanvasPostPaintGroupsEventHandler(
    	GH_Canvas sender
    )

    Public Delegate Sub CanvasPostPaintGroupsEventHandler (
    	sender As GH_Canvas
    )

#### Parameters

sender

    Type: Grasshopper.GUI.CanvasGH_Canvas

See Also

#### Reference

Grasshopper.GUI.Canvas Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com