---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Data_GH_RuleRange.htm
scraped_at: 2025-09-08T16:19:16.049462
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Data](../html/N_Grasshopper_Kernel_Data.htm
"Grasshopper.Kernel.Data")

[GH_RuleRange Class](../html/T_Grasshopper_Kernel_Data_GH_RuleRange.htm
"GH_RuleRange Class")

[GH_RuleRange Constructor
](../html/M_Grasshopper_Kernel_Data_GH_RuleRange__ctor.htm "GH_RuleRange
Constructor ")

[GH_RuleRange
Properties](../html/Properties_T_Grasshopper_Kernel_Data_GH_RuleRange.htm
"GH_RuleRange Properties")

[GH_RuleRange
Methods](../html/Methods_T_Grasshopper_Kernel_Data_GH_RuleRange.htm
"GH_RuleRange Methods")

!Click or drag to
resize

# GH_RuleRange Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.DataGH_RuleRange

**Namespace:** Grasshopper.Kernel.Data
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_RuleRange : IGH_Rule

    Public Class GH_RuleRange
    	Implements IGH_Rule

The GH_RuleRange type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_RuleRange| Initializes
a new instance of the GH_RuleRange class
Top

Properties

| Name| Description
---|---|---
|
Kind|
|
Notation|
Top

Methods

| Name| Description
---|---|---
|
Apply|
Top

See Also

#### Reference

Grasshopper.Kernel.Data Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com