---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_AnnotationBase_GH_AnnotationBaseProxy_1.htm
scraped_at: 2025-09-08T16:20:16.296366
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_AnnotationBase.GH_AnnotationBaseProxy(T)
Class](../html/T_Grasshopper_Kernel_Types_GH_AnnotationBase_GH_AnnotationBaseProxy_1.htm
"GH_AnnotationBase.GH_AnnotationBaseProxy\(T\) Class")

[GH_AnnotationBase.GH_AnnotationBaseProxy(T) Constructor
](../html/M_Grasshopper_Kernel_Types_GH_AnnotationBase_GH_AnnotationBaseProxy_1__ctor.htm
"GH_AnnotationBase.GH_AnnotationBaseProxy\(T\) Constructor ")

[GH_AnnotationBaseProxy(T)
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_AnnotationBase_GH_AnnotationBaseProxy_1.htm
"GH_AnnotationBaseProxy\(T\) Properties")

[GH_AnnotationBaseProxy(T)
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_AnnotationBase_GH_AnnotationBaseProxy_1.htm
"GH_AnnotationBaseProxy\(T\) Methods")

!Click or drag to
resize

# GH_AnnotationBaseGH_AnnotationBaseProxyT Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooProxyT
Grasshopper.Kernel.TypesGH_AnnotationBaseGH_AnnotationBaseProxyT
Grasshopper.Kernel.TypesGH_DimensionGH_DimensionProxy

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_AnnotationBaseProxy<T> : GH_GooProxy<T>
    where T : GH_AnnotationBase

    Public Class GH_AnnotationBaseProxy(Of T As GH_AnnotationBase)
    	Inherits GH_GooProxy(Of T)

#### Type Parameters

T

The GH_AnnotationBaseGH_AnnotationBaseProxyT type exposes the following
members.

Constructors

| Name| Description
---|---|---
|
GH_AnnotationBaseGH_AnnotationBaseProxyT|
Initializes a new instance of the GH_AnnotationBaseGH_AnnotationBaseProxyT
class
Top

Properties

| Name| Description
---|---|---
|
AnnotationType|
|
ObjectID|
|
PlainText|
|
Style|
|
TypeDescription|
(Inherited from GH_GooProxyT.)
|
TypeName|  (Inherited
from GH_GooProxyT.)
|
Valid|  Gets a value
indicating whether this proxy represents valid data.  (Inherited from
GH_GooProxyT.)
Top

Methods

| Name| Description
---|---|---
|
Construct|  Override
this method to supply a custom UI during proxy construction.  (Inherited from
GH_GooProxyT.)
|
FormatInstance|
Returns a String description of the current value.  (Inherited from
GH_GooProxyT.)
|
FromString|  If
IsParsable(), then attempts to convert the string to a generic type value
(Inherited from GH_GooProxyT.)
|
MutateString|
Munge a string to remove obvious errors on account of the user.  (Inherited
from GH_GooProxyT.)
|
NumberToString|
(Inherited from GH_GooProxyT.)
|
StringToNumber|
(Inherited from GH_GooProxyT.)
|
ToString|  (Inherited
from GH_GooProxyT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com