---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_PointRefData.htm
scraped_at: 2025-09-08T16:21:21.565227
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_PointRefData Class](../html/T_Grasshopper_Kernel_Types_GH_PointRefData.htm
"GH_PointRefData Class")

[GH_PointRefData Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_PointRefData__ctor.htm
"GH_PointRefData Constructor ")

[GH_PointRefData
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_PointRefData.htm
"GH_PointRefData Methods")

[GH_PointRefData
Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_PointRefData.htm
"GH_PointRefData Fields")

!Click or drag to
resize

# GH_PointRefData Class

---

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_PointRefData

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_PointRefData

    Public Class GH_PointRefData

The GH_PointRefData type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_PointRefData|
Initializes a new instance of the GH_PointRefData class
|
GH_PointRefData(GH_PointRefData)|
Initializes a new instance of the GH_PointRefData class
Top

Methods

| Name| Description
---|---|---
|
EvCurve|  Evaluate
this reference structure when applied to a curve
|
EvCurveParam|
Evaluate this reference structure when applied to a curve
|
EvSurface|
Evaluate this reference structure when applied to the surface
|
SetCurveDistFromEndParam|
|
SetCurveDistFromStartParam|
|
SetCurveParam|
Set the curve reference parameter based on the value of m_RefType and the
curve parameter
|
SetCurveRatioParam|
|
SetSurfaceParam|
Set the surface reference parameters
Top

Fields

| Name| Description
---|---|---
|
m_RefID|
|
m_RefIndex|
|
m_RefParam|
|
m_RefType|
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com