---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_IGH_SettingFrontend.htm
scraped_at: 2025-09-08T16:13:28.517120
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[IGH_SettingFrontend
Interface](../html/T_Grasshopper_GUI_IGH_SettingFrontend.htm
"IGH_SettingFrontend Interface")

[IGH_SettingFrontend
Properties](../html/Properties_T_Grasshopper_GUI_IGH_SettingFrontend.htm
"IGH_SettingFrontend Properties")

[IGH_SettingFrontend
Methods](../html/Methods_T_Grasshopper_GUI_IGH_SettingFrontend.htm
"IGH_SettingFrontend Methods")

!Click or drag to
resize

# IGH_SettingFrontend Interface

---

Represents a single setting in the Settings UI. Implement this interface to
participate in the Grasshopper Settings interface.

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_SettingFrontend

    Public Interface IGH_SettingFrontend

The IGH_SettingFrontend type exposes the following members.

Properties

| Name| Description
---|---|---
|
Category|  Category of
this setting.
|
Keywords|  Optional
keywords for this setting.
|
Name|  Name of this setting.
Top

Methods

| Name| Description
---|---|---
|
SettingsUI|  Create
the winforms UI portion for this setting.
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com