---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_GUI_GH_Tooltip.htm
scraped_at: 2025-09-08T16:13:11.443532
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.GUI

[GH_Tooltip Class](../html/T_Grasshopper_GUI_GH_Tooltip.htm "GH_Tooltip
Class")

[GH_Tooltip Properties](../html/Properties_T_Grasshopper_GUI_GH_Tooltip.htm
"GH_Tooltip Properties")

[GH_Tooltip Methods](../html/Methods_T_Grasshopper_GUI_GH_Tooltip.htm
"GH_Tooltip Methods")

!Click or drag to
resize

# GH_Tooltip Class

---

Implements a custom Tooltip class with advanced functionality. All methods and
fields are Shared. There can never be more than one GH_Tooltip.

Inheritance Hierarchy

SystemObject
Grasshopper.GUIGH_Tooltip

**Namespace:** Grasshopper.GUI
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_Tooltip

    Public NotInheritable Class GH_Tooltip

The GH_Tooltip type exposes the following members.

Properties

| Name| Description
---|---|---
!Static
member| Tag|
Gets or sets the tag object for the tooltip
!Static
member|
TooltipForm|  Gets the
internal instance of GH_TooltipForm.
Top

Methods

| Name| Description
---|---|---
|
Adjust|  Repositions the tooltip to
match with new cursor positions.
|
AssignTooltipFields|
Set all fields of the Tooltip. You'll still need to call Show() to display the
tooltip.
|
Clear|  Hides the tooltip and clears
all references and caches.
|
IsOwner|  Returns true if the test
control matches the internal Owner control. Use this method to make sure you
actually own this tooltip prior to clearing it.
|
IsTag|  Returns True if the test
object matches the internal Tag object
|
Layout|  Layout the tooltip fields.
Layout happens automatically if you use the AssigTooltipField method, if
however you poke values directly in the tooltip form you must place a call to
Layout() before showing the tooltip.
|
Show|  Display the tooltip on screen.
|
TooltipDetailedInformation|
Top

See Also

#### Reference

Grasshopper.GUI Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com