---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_GH_DocumentServer.htm
scraped_at: 2025-09-08T16:16:32.315988
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[GH_DocumentServer Class](../html/T_Grasshopper_Kernel_GH_DocumentServer.htm
"GH_DocumentServer Class")

[GH_DocumentServer Constructor
](../html/M_Grasshopper_Kernel_GH_DocumentServer__ctor.htm "GH_DocumentServer
Constructor ")

[GH_DocumentServer
Properties](../html/Properties_T_Grasshopper_Kernel_GH_DocumentServer.htm
"GH_DocumentServer Properties")

[GH_DocumentServer
Methods](../html/Methods_T_Grasshopper_Kernel_GH_DocumentServer.htm
"GH_DocumentServer Methods")

[GH_DocumentServer
Events](../html/Events_T_Grasshopper_Kernel_GH_DocumentServer.htm
"GH_DocumentServer Events")

!Click or drag to
resize

# GH_DocumentServer Class

---

Manages and maintains a collection of GH_Documents.

Inheritance Hierarchy

SystemObject
Grasshopper.KernelGH_DocumentServer

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public sealed class GH_DocumentServer : IEnumerable<GH_Document>

    Public NotInheritable Class GH_DocumentServer
    	Implements IEnumerable(Of GH_Document)

The GH_DocumentServer type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_DocumentServer|
Initializes a new instance of the GH_DocumentServer class
Top

Properties

| Name| Description
---|---|---
|
Document|  Gets the
document at the given index.
|
DocumentCount|
Gets the number of documents stored in the global list.
|
DocumentNames|
Gets a string collection containing all the names of the documents in the
global list.
|
ModifiedDocumentCount|
Gets the total number of modified (unsaved) documents.
Top

Methods

| Name| Description
---|---|---
|
AddDocument(GH_Document)|
Add a new document to the global list. If the document is already registered
nothing will happen. This also applies to a different document which points to
the same file path
| AddDocument(GH_Document,
Boolean)|  Add a
new document to the global list. If the document is already registered nothing
will happen. This also applies to a different document which points to the
same file path
| AddDocument(String,
Boolean)|  Add a
new document to the global list. If there already is a document with the given
path, it will be made active.
|
AddNewDocument|
Adds a new document to the global list. If a template file has been set, this
document will be based on the template.
|
Contains|  Gets a value
indicating whether or not the given document is inside the list.
|
GetEnumerator|
|
GetEnumerator_Generic|
|
IndexOf(GH_Document)|
Gets the index of the given document.
|
IndexOf(String)|  Gets
the index of the document that matches the filepath.
|
IndexOfAutoSave|
Gets the document index that is associated with the specified autosave
location.
|
NextAvailableDocument|
Gets the most important, non-active document.
|
PromoteDocument|
Push a document to the top of the list, meaning it will be first in line when
a new default document needs to be selected.
|
RemoveAllDocuments|
Remove all documents in the global list.
|
RemoveDocument|
Removes a specific document from the global list. If the document isn't
registered nothing will happen. If the document is owned by an
IGH_DocumentOwner, the owner will be informed of the removal.
|
SafeRemoveDocument|
Remove a document correctly from the server. This method shows user-interface
prompts if there is unsaved data and will also save if needed.
Top

Events

| Name| Description
---|---|---
|
DocumentAdded|
|
DocumentRemoved|
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com