---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_IGH_ObjectProxy.htm
scraped_at: 2025-09-08T16:18:35.842207
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

Grasshopper.Kernel

[IGH_ObjectProxy Interface](../html/T_Grasshopper_Kernel_IGH_ObjectProxy.htm
"IGH_ObjectProxy Interface")

[IGH_ObjectProxy
Properties](../html/Properties_T_Grasshopper_Kernel_IGH_ObjectProxy.htm
"IGH_ObjectProxy Properties")

[IGH_ObjectProxy
Methods](../html/Methods_T_Grasshopper_Kernel_IGH_ObjectProxy.htm
"IGH_ObjectProxy Methods")

!Click or drag to
resize

# IGH_ObjectProxy Interface

---

Provides proxy data for all Grasshopper components and parameters.

**Namespace:** Grasshopper.Kernel
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public interface IGH_ObjectProxy

    Public Interface IGH_ObjectProxy

The IGH_ObjectProxy type exposes the following members.

Properties

| Name| Description
---|---|---
|
Desc|  Gets the Instance
Description associated with this proxy.
|
Exposure|  Gets or sets
the Exposure of the target object. Only set the exposure if you know what you
are doing.
|
Guid|  Gets the Guid of the
target object. In the case of Compiled Objects, the Guid represents the
ComponentID, in the case of User Objects, the Guid is a hash of the file path.
|
Icon|  Gets the icon for this
object.
|
Kind|  Gets the kind of the
Proxy target object.
|
LibraryGuid|  Gets the
ID of the library (GHA file) that defines this object.
|
Location|  Gets the
location of the target object. If the proxy represents a Compiled Object, the
location refers to the file path of the assembly, in the case of User Objects,
the location refers to the object file.
|
Obsolete|  Gets whether
this proxy represents an obsolete object.
|
SDKCompliant|  Gets
whether this object is compliant with the current Rhino version.
|
Type|  Gets the Type for the
target object. If the proxy references a User Object, the Type member will be
null.
Top

Methods

| Name| Description
---|---|---
|
CreateInstance|
Create a new instance from the target object.
|
DuplicateProxy|
Create a duplicate of this proxy.
Top

See Also

#### Reference

Grasshopper.Kernel Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com