---
url: https://developer.rhino3d.com/api/grasshopper/html/T_Grasshopper_Kernel_Types_GH_Material.htm
scraped_at: 2025-09-08T16:21:01.483294
title: Untitled
---

Grasshopper API

[Grasshopper API](../html/723c01da-9986-4db2-8f53-6f3a7494df75.htm
"Grasshopper API")

[Grasshopper.Kernel.Types](../html/N_Grasshopper_Kernel_Types.htm
"Grasshopper.Kernel.Types")

[GH_Material Class](../html/T_Grasshopper_Kernel_Types_GH_Material.htm
"GH_Material Class")

[GH_Material Constructor
](../html/Overload_Grasshopper_Kernel_Types_GH_Material__ctor.htm "GH_Material
Constructor ")

[GH_Material
Properties](../html/Properties_T_Grasshopper_Kernel_Types_GH_Material.htm
"GH_Material Properties")

[GH_Material
Methods](../html/Methods_T_Grasshopper_Kernel_Types_GH_Material.htm
"GH_Material Methods")

[GH_Material Fields](../html/Fields_T_Grasshopper_Kernel_Types_GH_Material.htm
"GH_Material Fields")

!Click or drag to
resize

# GH_Material Class

---

Represents a implementation of the Rhino material

Inheritance Hierarchy

SystemObject
Grasshopper.Kernel.TypesGH_GooDisplayMaterial
Grasshopper.Kernel.TypesGH_Material

**Namespace:** Grasshopper.Kernel.Types
**Assembly:** Grasshopper (in Grasshopper.dll)

Syntax

C#

VB

Copy

    public class GH_Material : GH_Goo<DisplayMaterial>

    Public Class GH_Material
    	Inherits GH_Goo(Of DisplayMaterial)

The GH_Material type exposes the following members.

Constructors

| Name| Description
---|---|---
|
GH_Material| Initializes a
new instance of the GH_Material class
|
GH_Material(Color)|
Create a new material based on a colour. The colour is used to control
Diffuse, Emission and Transparency. Ambient, Specular and Shine are always
default.
|
GH_Material(DisplayMaterial)|
Create a new Material.
|
GH_Material(GH_Material)|
Copy another GH_Material instance.
|
GH_Material(Guid)|
Create a new Material from an RDK material ID.
|
GH_Material(RenderMaterial)|
Create a new Material.
|
GH_Material(String)|
Create a new Material from an RDK xml string.
Top

Properties

| Name| Description
---|---|---
|
IsValid|  (Overrides
GH_GooTIsValid.)
|
IsValidWhyNot|
Gets a string describing the state of "invalidness". If the instance _is_
valid, then this property should return Nothing or String.Empty.  (Overrides
GH_GooTIsValidWhyNot.)
|
RdkMaterialId|
Gets or sets the RDK material ID this material is associated with.
|
RdkMaterialRmtl|
Gets or sets the RDK material RMTL file path.
|
RdkMaterialXml|
Gets or sets the RDK material Xml string.
|
Type|  Gets the implied
type based on what fields have been assigned.
|
TypeDescription|
(Overrides
GH_GooTTypeDescription.)
|
TypeName|  (Overrides
GH_GooTTypeName.)
|
Value|  Gets or sets the
internal data.  (Inherited from
GH_GooT.)
Top

Methods

| Name| Description
---|---|---
|
CastFrom|  (Overrides
GH_GooTCastFrom(Object).)
|
CastToQ(Q)|  Attempt a
cast to type Q.  (Inherited from
GH_GooT.)
|
CastToT(T)|
(Overrides
GH_GooTCastToQ(Q).)
|
CreateRhinoMaterial|
Creates a standard Rhino material from a colour.
|
CreateStandardMaterial|
Creates a standard Grasshopper material from a colour.
|
Duplicate|  Duplicate
this material.  (Overrides
GH_GooTDuplicate.)
|
DuplicateMaterial|
Duplicate this material.
|
EmitProxy|  (Overrides
GH_GooTEmitProxy.)
|
MaterialBestGuess|
Gets the best guess RenderMaterial for this shader.
|
Read|  (Overrides
GH_GooTRead(GH_IReader).)
|
ScriptVariable|
(Overrides
GH_GooTScriptVariable.)
|
ToString|  (Overrides
GH_GooTToString.)
|
Write|  (Overrides
GH_GooTWrite(GH_IWriter).)
Top

Fields

| Name| Description
---|---|---
|
m_value|  (Inherited from
GH_GooT.)
Top

See Also

#### Reference

Grasshopper.Kernel.Types Namespace

Grasshopper for Rhino 8.22.25217.12450 (2025-08-05)
Copyright © 2009-2025 Robert McNeel & Associates

Report wishes and bugs at
discourse.mcneel.com