---
url: https://developer.rhino3d.com/api/rhinocommon/rhino.rhinodoc
scraped_at: 2025-09-08T16:05:16.562358
title: Untitled
---

_home_

/

Rhino

/

RhinoDoc

# RhinoDoc class

Represents an active model.

_Derived Classes:_

_Namespace:Rhino_
 _RhinoDoc:references_

 _keyboard_arrow_down_

Constructors (1)

**RhinoDoc**() Initializes a new instance of the RhinoDoc
class

* * *

 _keyboard_arrow_down_

Properties (82)

**ActiveCommandId** Get the ID of the active
command.

* * *

**ActiveDoc** WARNING!! Do not use the ActiveDoc if you don't have to. Under
Mac Rhino the ActiveDoc can change while a command is running. Use the doc
that is passed to you in your RunCommand function or continue to use the same
doc after the first call to
ActiveDoc.

* * *

**ActiveSpace** Get the space associated with the active viewport for this
document

* * *

**AnimationProperties**

* * *

**Bitmaps** bitmaps used in textures, backgrounds, wallpapers,
...

* * *

**CurrentEnvironment** __ Access to the current environment for various
uses

* * *

**CurrentUndoRecordSerialNumber** >0: undo recording is active and being
saved on the undo record with the specified serial number. 0: undo recording
is not active. (Disabled or nothing is being
recorded.)

* * *

**CustomRenderSizes**

* * *

**DateCreated**

* * *

**DateLastEdited** Returns the date the document was created in Coordinated
Universal Time (UTC). Use DateTime.ToLocalTime to convert to local
time.

* * *

**DimStyles**

* * *

**DistanceDisplayPrecision**

* * *

**DocumentId** __ Gets the Document
Id.

* * *

**EarthAnchorPoint**

* * *

**Fonts** __

* * *

**GroundPlane** __ Gets the ground plane of this
document.

* * *

**Groups**

* * *

**HatchPatterns**

* * *

**InGetPoint** Returns True if currently in a
GetPoint.Get().

* * *

**InstanceDefinitions**

* * *

**IsAvailable**

* * *

**IsClosing**

* * *

**IsCommandRunning** Returns True if Rhino is currently running a
command.

* * *

**IsCreating**

* * *

**IsHeadless**

* * *

**IsInitializing**

* * *

**IsLocked** Check to see if the file associated with this document is
locked. If it is locked then this is the only document that will be able to
write the file. Other instances of Rhino will fail to write this
document.

* * *

**IsOpening**

* * *

**IsReadOnly** Current read-only mode for this document. True if the document
can be viewed but NOT saved. False if document can be viewed and
saved.

* * *

**IsSendingMail** True if Rhino is in the process of sending this document as
an email attachment.

* * *

**Layers** Layers in the document.

* * *

**LayoutSpaceAnnotationScalingEnabled** If LayoutSpaceAnnotationScaling is
on, sizes in dimstyles are multiplied by dimscale when the annotation is
displayed in a detail viewport not in a
detail

* * *

**Lights**

* * *

**Linetypes** Linetypes in the
document.

* * *

**Manifest**

* * *

**Materials** Materials in the
document.

* * *

**MeshingParameterStyle** Type of MeshingParameters currently used by the
document to mesh
objects

* * *

**ModelAbsoluteTolerance** Model space absolute
tolerance.

* * *

**ModelAngleToleranceDegrees** Model space angle
tolerance.

* * *

**ModelAngleToleranceRadians** Model space angle
tolerance.

* * *

**ModelBasepoint** The base point in the model that is used when inserting
the model into another as a block definition. By default the base point in any
model is 0,0,0.

* * *

**ModelDistanceDisplayPrecision**

* * *

**ModelRelativeTolerance** Model space relative
tolerance.

* * *

**ModelSpaceAnnotationScalingEnabled** If ModelSpaceAnnotationScaling is on,
sizes in dimstyles are multiplied by dimscale when the annotation is displayed
in a model space viewport not in a
detail

* * *

**ModelSpaceHatchScale** The scale factor for hatches in model space when
Hatch Scaling is
enabled

* * *

**ModelSpaceHatchScalingEnabled** True if hatch scaling is enabled, False if
not.

* * *

**ModelSpaceTextScale** The scale factor for text in model space when
Annotation Scaling is
enabled

* * *

**ModelUnitSystem**

* * *

**Modified** Returns or sets the document's modified
flag.

* * *

**Name** Returns the name of the currently loaded Rhino document (3DM
file).

* * *

**NamedConstructionPlanes** Collection of named construction
planes.

* * *

**NamedLayerStates** Collection of named layer
states.

* * *

**NamedPositions** Collection of named
positions.

* * *

**NamedViews** Collection of named
views.

* * *

**NextUndoRecordSerialNumber** The serial number that will be assigned to the
next undo record that is
constructed.

* * *

**Notes** Returns or sets the document's
notes.

* * *

**NotesLocked**

* * *

**Objects**

* * *

**PageAbsoluteTolerance** Page space absolute
tolerance.

* * *

**PageAngleToleranceDegrees** Page space angle
tolerance.

* * *

**PageAngleToleranceRadians** Page space angle
tolerance.

* * *

**PageDistanceDisplayPrecision**

* * *

**PageRelativeTolerance** Page space relative
tolerance.

* * *

**PageUnitSystem**

* * *

**Path** Returns the path of the currently loaded Rhino document (3DM
file).

* * *

**PostEffects** __ Access to the post
effects

* * *

**RedoActive** Returns True if Redo is currently
active.

* * *

**RenderEnvironments**

* * *

**RenderMaterials**

* * *

**RenderSettings**

* * *

**RenderTextures**

* * *

**RuntimeData** Collection of document runtime data. This is a good place to
put non-serializable, per document data, such as panel view models. Note well:
This data will be dispose with the document and does not get
serialized.

* * *

**RuntimeSerialNumber** Unique serialNumber for the document while the
application is running. This is not a persistent
value.

* * *

**Snapshots** Collection of
snapshots.

* * *

**Strings** Collection of document user data strings in this
document

* * *

**SubDAppearance** Returns or sets the appearance of all SubD objects in the
document.

* * *

**TemplateFileUsed** name of the template file used to create this document.
This is a runtime value only present if the document was newly
created.

* * *

**UndoActive** Returns True if Undo is currently
active.

* * *

**UndoRecordingEnabled**

* * *

**UndoRecordingIsActive** True if undo recording is actually happening
now.

* * *

**Views**

* * *

**Worksession** Provides access to the document's
worksession.

* * *

_keyboard_arrow_down_

Methods (70)

**AddCustomUndoEvent**(String description, EventHandler<CustomUndoEventArgs>
handler,Object tag) Add a custom undo event so you can undo private plug-in
data when the user performs an undo or
redo

* * *

**AddCustomUndoEvent**(String description, EventHandler<CustomUndoEventArgs>
handler)

* * *

**AdjustModelUnitSystem**(UnitSystem newUnitSystem,Boolean scale)

* * *

**AdjustPageUnitSystem**(UnitSystem newUnitSystem,Boolean scale)

* * *

**Audit**(TextLog textLog,Boolean attemptRepair) Audits the contents of the
document.

* * *

**BeginUndoRecord**(String description) Instructs Rhino to begin recording
undo information when the document is changed outside of a command. We use
this, e.g., to save changes caused by the modeless layer or object properties
dialogs when commands are not
running.

* * *

**ClearRedoRecords**()

* * *

**ClearUndoRecords**(Boolean purgeDeletedObjects)

* * *

**ClearUndoRecords**(UInt32 undoSerialNumber,Boolean purgeDeletedObjects)

* * *

**Create**(String modelTemplateFileName) Creates a new
RhinoDoc

* * *

**CreateDefaultAttributes**() Gets the default object attributes for this
document. The attributes will be linked to the currently active layer and they
will inherit the Document WireDensity
setting.

* * *

**CreateHeadless**(String file3dmTemplatePath) Create a new headless RhinoDoc
from a template
file

* * *

**CustomRenderMeshesBoundingBox**(MeshType mt, ViewportInfo vp,Flags
flags,PlugIn plugin,DisplayPipelineAttributes attrs, out BoundingBox
boundingBox) Returns the bounding box of custom render primitives for this
object
.

* * *

**Dispose**()

* * *

**EndUndoRecord**(UInt32 undoRecordSerialNumber) Ends the undo
record.

* * *

**Equals**(Object obj)

* * *

**Export**(String filePath, ArchivableDictionary options) Export the entire
document to a file. All file formats that Rhino can export to are supported by
this
function.

* * *

**Export**(String filePath) Export the entire document to a file. All file
formats that Rhino can export to are supported by this
function.

* * *

**ExportSelected**(String filePath, ArchivableDictionary options) Export
selected geometry to a file. All file formats that Rhino can export to are
supported by this
function.

* * *

**ExportSelected**(String filePath) Export selected geometry to a file. All
file formats that Rhino can export to are supported by this
function.

* * *

**ExtractPreviewImage**(String path) Extracts the bitmap preview image from
the specified .3dm
file.

* * *

**FindFile**(String filename) Search for a file using Rhino's search path.
Rhino will look in the following places: 1. Current model folder 2. Path
specified in options dialog/File tab 3. Rhino system folders 4. Rhino
executable folder

* * *

**FormatNumber**(Double value,Boolean appendUnitSystemName,Boolean
abbreviate) Call this method to get string representing the specified value
using the documents display coordinate system and display
precision.

* * *

**FormatNumber**(Double value) Call this method to get string representing
the specified value using the documents display coordinate system and display
precision.

* * *

**FromFilePath**(String filePath) Search the open document list for a
document with a Path equal to the specified file
path.

* * *

**FromId**(Int32 docId) __

* * *

**FromRuntimeSerialNumber**(UInt32 serialNumber)

* * *

**GetAnalysisMeshingParameters**() Get analysis meshing parameters currently
used by the
document

* * *

**GetCurrentMeshingParameters**() Get the custom meshing parameters that this
document will
use.

* * *

**GetCustomUnitSystem**(Boolean modelUnits,String customUnitName,Double
metersPerCustomUnit) Get the custom unit system name and custom unit
scale.

* * *

**GetEmbeddedFilesList**(Boolean missingOnly)

* * *

**GetGridDefaults**()

* * *

**GetGumballPlane**(out Plane plane) Returns the active plane of Rhino's
auto-gumball widget. Note, when calling from a Rhino command, make sure the
command class has the Rhino.Commands.Style.Transparent command style
attribute.

* * *

**GetHashCode**()

* * *

**GetMeshingParameters**(MeshingParameterStyle style) Get MeshingParameters
currently used by the
document

* * *

**GetRenderPrimitiveList**(ViewportInfo viewport,DisplayPipelineAttributes
attrs) __ Build custom render mesh(es) for this document (i.e. - GH
meshes).

* * *

**GetRenderPrimitives**(ViewportInfo viewport,Boolean
forceTriangleMeshes,Boolean quietly) __ Get a enumerable list of custom mesh
primitives

* * *

**GetRenderPrimitives**(Boolean forceTriangleMeshes,Boolean quietly) __ Get a
enumerable list of custom mesh
primitives

* * *

**GetRenderPrimitives**(Guid plugInId,ViewportInfo viewport,Boolean
forceTriangleMeshes,Boolean quietly) __ Get a enumerable list of custom mesh
primitives

* * *

**GetUnitSystemName**(Boolean modelUnits,Boolean capitalize,Boolean
singular,Boolean abbreviate)

* * *

**HasCustomRenderMeshes**(MeshType mt, ViewportInfo vp,Flags flags,PlugIn
plugin,DisplayPipelineAttributes attrs) Returns True if the document has a set
of custom render primitives - ie, CustomRenderMeshes will return non-
null.

* * *

**Import**(String filePath, ArchivableDictionary options) Import geometry
into a RhinoDoc from a file. This can be any file format that Rhino can
import

* * *

**Import**(String filePath) Import geometry into a RhinoDoc from a file. This
can be any file format that Rhino can
import

* * *

**InCommand**(Boolean bIgnoreScriptRunnerCommands) This is a low level tool
to determine if Rhino is currently running a
command.

* * *

**IsMetricUnitSystem**(Boolean modelUnits) Determines if a document unit
system is a metric unit
system.

* * *

**Open**(String filePath,Boolean wasAlreadyOpen) Opens a 3dm file and makes
it the active document. If called on windows the active document will be saved
and closed and the new document will be opened and become the active document.
If called on the Mac the file will be opened in a new document
window.

* * *

**OpenDocuments**() Returns a list of currently open Rhino
documents

* * *

**OpenDocuments**(Boolean includeHeadless) Returns a list of currently open
Rhino documents

* * *

**OpenFile**(String path)
__

* * *

**OpenHeadless**(String file3dmPath) Opens a 3DM file into a new headless
RhinoDoc.

* * *

**OpenHeadless**(String filePath, ArchivableDictionary options) Opens a file
into a new headless
RhinoDoc.

* * *

**ReadFile**(String path, FileReadOptions options)

* * *

**ReadFileVersion**() Returns the file version of the current document. Use
this function to determine which version of Rhino last saved the
document.

* * *

**Redo**() Redo the last action that was
"undone"

* * *

**RenderMeshes**(MeshType mt, ViewportInfo vp,Flags flags,PlugIn
plugin,DisplayPipelineAttributes attrs) Returns a set of non-object custom
render primitives for this
document.

* * *

**Save**() Save doc to disk using the document's
Path

* * *

**SaveAs**(String file3dmPath,Int32 version,Boolean saveSmall,Boolean
saveTextures,Boolean saveGeometryOnly,Boolean savePluginData) Save doc as a
3dm to a specified
path

* * *

**SaveAs**(String file3dmPath,Int32 version) Save doc as a 3dm to a specified
path

* * *

**SaveAs**(String file3dmPath) Save doc as a 3dm to a specified path using
the current Rhino file
version

* * *

**SaveAsTemplate**(String file3dmTemplatePath,Int32 version) Save this
document as a template to a specific Rhino file
version

* * *

**SaveAsTemplate**(String file3dmTemplatePath) Save this document as a
template

* * *

**SelectRenderContentInEditor**(RenderContentCollection collection,Boolean
append) Selects a collection of contents in any editors they appear
in.

* * *

**SetCustomMeshingParameters**(MeshingParameters mp) Set the custom meshing
parameters that this document will use. You must also modify the
MeshingParameterStyle property on the document to Custom if you want these
meshing parameters to be
used

* * *

**SetCustomUnitSystem**(Boolean modelUnits,String customUnitName,Double
metersPerCustomUnit,Boolean scale) Changes the unit system to custom units and
sets the custom unit
scale.

* * *

**SetGridDefaults**(ConstructionPlaneGridDefaults defaults)

* * *

**SupportsRenderPrimitiveList**(ViewportInfo
viewport,DisplayPipelineAttributes attrs) __ Determines if custom render
meshes will be built for this document (i.e. - GH
meshes).

* * *

**TryGetRenderPrimitiveBoundingBox**(ViewportInfo
viewport,DisplayPipelineAttributes attrs, out BoundingBox boundingBox) __ Get
the bounding box for the custom render meshes associated with this document
(i.e. - GH
meshes).

* * *

**Undo**() Undo the last action

* * *

**Write3dmFile**(String path, FileWriteOptions options) Write information in
this document to a .3dm file. Note, the active document's name will not be
changed.

* * *

**WriteFile**(String path, FileWriteOptions options) Write information in
this document to a file. Note, the active document's name will be changed to
that of the path
provided.

* * *

_keyboard_arrow_down_

Events (35)

**ActiveDocumentChanged** This event is raised when the active document used
by modeless user interface changes. On Mac Rhino this will get raised before
the <b>NewDocument</b> , <b>BeginOpenDocument</b> and <b>EndOpenDocument</b>
events. Mac Rhino will also raise this event with 0 for the document Id and a
None document pointer when the last document is closed. Windows Rhino will
raise this event after the <b>NewDocument</b> , <b>BeginOpenDocument</b> and
<b>EndOpenDocument</b> events when a new or existing model is
opened.

* * *

**AddRhinoObject** Called if a new object is added to the
document.

* * *

**AfterTransformObjects** Called after objects are being
transformed

* * *

**BeforeTransformObjects** Called before objects are being
transformed

* * *

**BeginOpenDocument** This event is raised when the document open operation
begins. NOTE: On Windows, this event will be fired when a clipboard paste
operation occurs, as Rhino opens a .tmp file in the User's Local folder with
the contents of the pasted
document.

* * *

**BeginSaveDocument**

* * *

**CloseDocument**

* * *

**DeleteRhinoObject** Called if an object is deleted. At some later point the
object can be un-deleted.

* * *

**DeselectAllObjects** Called when all objects are
deselected.

* * *

**DeselectObjects** Called when object(s) are
deselected.

* * *

**DimensionStyleTableEvent** Called when any modification happens to a
document's dimension style
table.

* * *

**DocumentPropertiesChanged**

* * *

**EndOpenDocument**

* * *

**EndOpenDocumentInitialiViewUpdate** __ This event is raised after
<b>EndOpenDocument</b> when the documents initial views have been created and
initialized.

* * *

**EndOpenDocumentInitialViewUpdate** This event is raised after
<b>EndOpenDocument</b> when the documents initial views have been created and
initialized.

* * *

**EndSaveDocument**

* * *

**GroupTableEvent** Called when any modification happens to a document's
group table.

* * *

**HatchPatternTableEvent** Called when any modification happens to a
document's hatch pattern
table.

* * *

**InstanceDefinitionTableEvent** Called when any modification happens to a
document's instance definition
table.

* * *

**LayerTableEvent** Called when any modification happens to a document's
layer table.

* * *

**LightTableEvent** Called when any modification happens to a document's
light table.

* * *

**LinetypeTableEvent** Called when any modification happens to a document's
linetype table.

* * *

**MaterialTableEvent** Called when any modification happens to a document's
material table.

* * *

**ModifyObjectAttributes** Called when all object attributes are
changed.

* * *

**NewDocument**

* * *

**PurgeRhinoObject** Called if an object is being purged from a document. The
object will cease to exist
forever.

* * *

**RenderEnvironmentTableEvent**

* * *

**RenderMaterialsTableEvent**

* * *

**RenderTextureTableEvent** Called when the <b>RenderTextureTable</b> has
been loaded, is about to be cleared or has been cleared. See
<b>RenderContentTableEventType</b> for more
information.

* * *

**ReplaceRhinoObject** Called if an object is about to be replaced. If both
RhinoDoc.UndoActive() and RhinoDoc.RedoActive() return false, then immediately
after the ReplaceObject event, there will be a DeleteObject event followed by
an AddObject event. If either RhinoDoc.UndoActive() or RhinoDoc::RedoActive()
return true, then immediately after the ReplaceObject event, there will be a
DeleteObject event followed by an UndeleteObject
event.

* * *

**SelectObjects** Called when object(s) are
selected.

* * *

**TextureMappingEvent** Called when any modification happens to a document
objects texture
mapping.

* * *

**UndeleteRhinoObject** Called if an object is un-
deleted.

* * *

**UnitsChangedWithScaling** Called when a change in the model units results
in a scaling operation on all of the objects in the document. This call is
made before any of the objects are scaled. A call to
RhinoDoc.DocumentPropertiesChanged
follows.

* * *

**UserStringChanged** This event is raised when document user text strings
are changed

* * *