---
url: https://developer.rhino3d.com/api/rhinocommon/rhino.display.displaypipeline
scraped_at: 2025-09-08T16:03:18.835495
title: Untitled
---

_home_

/

Rhino.Display

/

DisplayPipeline

# DisplayPipeline class

The display pipeline calls events during specific phases of drawing During the
drawing of a single frame the events are called in the following order. [Begin
Drawing of a Frame]

  * CalculateBoundingBox
  * CalculateClippingPanes
  * SetupFrustum
  * SetupLighting
  * InitializeFrameBuffer
  * DrawBackground
  * If this is a layout and detail objects exist the channels are called in the same order for each detail object (drawn as a nested viewport)
  * PreDrawObjects
  * For Each Visible Non Highlighted Object
    * SetupObjectDisplayAttributes
    * PreDrawObject
    * DrawObject
    * PostDrawObject
  * PostDrawObjects - depth writing/testing on
  * DrawForeGround - depth writing/testing off
  * For Each Visible Highlighted Object
    * SetupObjectDisplayAttributes
    * PreDrawObject
    * DrawObject
    * PostDrawObject
  * PostProcessFrameBuffer (If a delegate exists that requires this)
  * DrawOverlay (if Rhino is in a feedback mode)

[End of Drawing of a Frame] NOTE: There may be multiple DrawObject calls for a
single object. An example of when this could happen would be with a shaded
sphere. The shaded mesh is first drawn and these channels would be processed;
then at a later time the isocurves for the sphere would be drawn.

_Derived Classes:_

_Namespace:Rhino.Display_
_DisplayPipeline:references_

 _keyboard_arrow_down_

Properties (28)

**ActiveObject**

* * *

**ActiveObjectNestingLevel**

* * *

**ActiveObjectNestingStack**

* * *

**ActiveTopLevelObject**

* * *

**DefaultCurveThickness** Gets the curve thickness as defined by the current
display mode. Note: this only applies to curve objects, Brep and Mesh wires
may have different
settings.

* * *

**DepthMode**

* * *

**DisplayPipelineAttributes**

* * *

**DpiScale** Scale factor used for high resolution displays. When a monitor
that this pipeline is drawing to is at a DPI of 96, this value is one. On high
DPI monitors, this value will commonly be greater than
one.

* * *

**DrawingGrips** Gets a value that indicates whether the pipeline is
currently in a grip drawing
operation.

* * *

**DrawingSurfaces** Gets a value that indicates whether the pipeline is
currently in a surface drawing operation. Surface drawing means draw the
shaded triangles of a mesh representing the surface (mesh, extrusion, or
brep). This is useful when inside of a draw event or display conduit to check
and see if the geometry is about to be drawn as a shaded set of triangles
representing the geometry. See DrawingWires to check and see if the wireframe
representation of the geometry is going to be
drawn.

* * *

**DrawingWires** Gets a value that indicates whether the pipeline is
currently in a curve drawing operation. This is useful when inside of a draw
event or display conduit to check and see if the geometry is about to be drawn
is going to be drawing the wire representation of the geometry (mesh,
extrusion, or brep). See DrawingSurfaces to check and see if the shaded mesh
representation of the geometry is going to be
drawn.

* * *

**FrameBuffer** Gets the contents of the frame buffer that this pipeline is
drawing to.

* * *

**FrameSize** Gets the size of the frame buffer that this pipeline is drawing
to.

* * *

**IsDynamicDisplay** Gets a value that indicates whether the viewport is in
Dynamic Display state. Dynamic display is the state a viewport is in when it
is rapidly redrawing because of an operation like panning or rotating. The
pipeline will drop some level of detail while inside a dynamic display state
to keep the frame rate as high as
possible.

* * *

**IsInViewCapture** Gets a value that indicates whether this pipeline is
currently drawing for ViewCaptureToFile or
ViewCaptureToClipboard

* * *

**IsOpen** Is True of the pipeline is open, False
otherwise.

* * *

**IsOpenGL** Gets a value indicating whether or not this pipeline is drawing
into an OpenGL
context.

* * *

**IsPrinting** Gets a value that indicates whether this pipeline is currently
drawing for printing
purposes.

* * *

**IsStereoMode** Gets a value that indicates whether this pipeline is
currently using an engine that is performing stereo style drawing. Stereo
drawing is for providing an "enhanced 3-D" effect through stereo viewing
devices.

* * *

**ModelTransform** Gets or sets the current model transformation that is
applied to vertices when
drawing.

* * *

**ModelTransformIsIdentity** Gets a value that indicates whether the Model
Transform is an Identity
transformation.

* * *

**NestLevel** Gets the current nested viewport drawing level. This is used to
know if you are currently inside the drawing of a nested viewport (detail
object in Rhino).
Nest level = 0 Drawing is occurring in a standard Rhino viewport or on the
page viewport.
Nest level = 1 Drawing is occurring inside a detail view
object.

* * *

**RenderPass** Gets the current pass that the pipeline is in for drawing a
frame. Typically drawing a frame requires a single pass through the
DrawFrameBuffer function, but some special display effects can be achieved
through drawing with multiple
passes.

* * *

**ShadingRequired** Gets or sets the "ShadingRequired" flag. This flag gets
set inside the pipeline when a request is made to draw a shaded mesh but the
current render engine doesn't support shaded mesh drawing...at this point the
redraw mechanism will make sure everything will work the next time
around.

* * *

**StereoProjection** Gets the current stereo projection if stereo mode is on.
0 = left
1 = right If stereo mode is not enables, this property always returns
0.

* * *

**SupportsShading** Gets whether or not this pipeline supports shaded
meshes.

* * *

**Viewport**

* * *

**ZBiasMode**

* * *

_keyboard_arrow_down_

Methods (185)

**AddClippingPlane**(Point3d point, Vector3d normal) Add a clipping plane to
be used during the drawing of this
frame

* * *

**AvailableOpenGLVersion**(Boolean coreProfile) If Rhino is using OpenGL for
display, this function will return major.minor version of OpenGL available for
this instance of
Rhino

* * *

**ClearFrameBuffer**(Color color) Fill the frame buffer with a single color.
This function also clears the depth buffer for engines that support depth
buffered
drawing.

* * *

**Clone**(RhinoViewport viewport) Clones the pipeline. Creates an identical
copy of "this" pipeline. Copies all conduits from "this" pipeline to the new
pipeline.

* * *

**Close**() Closes the
pipeline.

* * *

**CullControlPolygon**() Returns a value indicating if only points on the
side of the surface that face the camera are
displayed.

* * *

**Draw2dLine**(Point from,Point to,Color color,Single thickness)

* * *

**Draw2dLine**(PointF from,PointF to,Color color,Single thickness)

* * *

**Draw2dRectangle**(Rectangle rectangle,Color strokeColor,Int32
thickness,Color fillColor)

* * *

**Draw2dText**(String text,Color color, Point2d screenCoordinate,Boolean
middleJustified,Int32 height,String fontface) Draws 2D text on the
viewport.

* * *

**Draw2dText**(String text,Color color, Point2d screenCoordinate,Boolean
middleJustified,Int32 height) Draws 2D text on the
viewport.

* * *

**Draw2dText**(String text,Color color, Point2d screenCoordinate,Boolean
middleJustified) Draws 2D text on the
viewport.

* * *

**Draw2dText**(String text,Color color, Point3d worldCoordinate,Boolean
middleJustified,Int32 height,String fontface) Draws 2D text on the
viewport.

* * *

**Draw2dText**(String text,Color color, Point3d worldCoordinate,Boolean
middleJustified,Int32 height) Draws 2D text on the
viewport.

* * *

**Draw2dText**(String text,Color color, Point3d worldCoordinate,Boolean
middleJustified) Draws 2D text on the
viewport.

* * *

**Draw3dText**(String text,Color color, Plane textPlane,Double height,String
fontface,Boolean bold,Boolean italic,TextHorizontalAlignment
horizontalAlignment,TextVerticalAlignment verticalAlignment)

* * *

**Draw3dText**(String text,Color color, Plane textPlane,Double height,String
fontface,Boolean bold,Boolean italic)

* * *

**Draw3dText**(String text,Color color, Plane textPlane,Double height,String
fontface)

* * *

**Draw3dText**(Text3d text,Color color, Plane textPlane) Draws 3d text with a
different plane than what is defined in the Text3d
class.

* * *

**Draw3dText**(Text3d text,Color color, Point3d textPlaneOrigin) Draws 3d
text using the Text3d plane with an adjusted
origin.

* * *

**Draw3dText**(Text3d text,Color color)

* * *

**DrawActivePoint**(Point3d point) Draws a point in style used during
"GetPoint"
operations

* * *

**DrawAnnotation**(AnnotationBase annotation,Color color)

* * *

**DrawAnnotationArrowhead**(Arrowhead arrowhead, Transform xform,Color color)

* * *

**DrawArc**(Arc arc,Color color,Int32 thickness) Draw a single arc
object.

* * *

**DrawArc**(Arc arc,Color color) Draw a single arc
object.

* * *

**DrawArrow**(Line line,Color color,Double screenSize,Double relativeSize)
Draws a single arrow object. An arrow consists of a Shaft and an Arrow head at
the end of the
shaft.

* * *

**DrawArrow**(Line line,Color color) Draws a single arrow object. An arrow
consists of a Shaft and an Arrow head at the end of the
shaft.

* * *

**DrawArrowHead**(Point3d tip, Vector3d direction,Color color,Double
screenSize,Double worldSize) Draws a single arrow
head.

* * *

**DrawArrows**(IEnumerable<Line> lines,Color color) Draws a collection of
arrow objects. An arrow consists of a Shaft and an Arrow head at the end of
the
shaft.

* * *

[**DrawArrows**(Line[] lines,Color color) Draws a collection of arrow objects.
An arrow consists of a Shaft and an Arrow head at the end of the
shaft.](/api/rhinocommon/rhino.display.displaypipeline/drawarrows#\(line\[\],color\))

* * *

**DrawBitmap**(DisplayBitmap bitmap,Int32 left,Int32 top) Draws a bitmap in
screen
coordinates

* * *

**DrawBox**(BoundingBox box,Color color,Int32 thickness) Draws the edges of a
BoundingBox.

* * *

**DrawBox**(BoundingBox box,Color color) Draws the edges of a
BoundingBox.

* * *

**DrawBox**(Box box,Color color,Int32 thickness) Draws the edges of a Box
object.

* * *

**DrawBox**(Box box,Color color) Draws the edges of a Box
object.

* * *

**DrawBoxCorners**(BoundingBox box,Color color,Double size,Int32 thickness)
Draws corner widgets of a world aligned bounding
box.

* * *

**DrawBoxCorners**(BoundingBox box,Color color,Double size) Draws corner
widgets of a world aligned bounding
box.

* * *

**DrawBoxCorners**(BoundingBox box,Color color) Draws corner widgets of a
world aligned bounding box. Widget size will be 5% of the Box
diagonal.

* * *

**DrawBrepShaded**(Brep brep, DisplayMaterial material) Draws a shaded mesh
representation of a
brep.

* * *

**DrawBrepWires**(Brep brep,Color color,Int32 wireDensity) Draws all the
wireframe curves of a brep
object.

* * *

**DrawBrepWires**(Brep brep,Color color) Draws all the wireframe curves of a
brep
object.

* * *

**DrawCircle**(Circle circle,Color color,Int32 thickness) Draw a single
circle
object.

* * *

**DrawCircle**(Circle circle,Color color) Draw a single circle
object.

* * *

**DrawCone**(Cone cone,Color color,Int32 thickness) Draw a wireframe
cone.

* * *

**DrawCone**(Cone cone,Color color) Draw a wireframe
cone.

* * *

**DrawConstructionPlane**(ConstructionPlane constructionPlane) Draws a
construction
plane.

* * *

**DrawCurvatureGraph**(Curve curve,Color color,Int32 hairScale,Int32
hairDensity,Int32 sampleDensity) Draw a typical Rhino Curvature
Graph.

* * *

**DrawCurvatureGraph**(Curve curve,Color color,Int32 hairScale) Draw a
typical Rhino Curvature
Graph.

* * *

**DrawCurvatureGraph**(Curve curve,Color color) Draw a typical Rhino
Curvature
Graph.

* * *

**DrawCurve**(Curve curve, DisplayPen pen)

* * *

**DrawCurve**(Curve curve,Color color,Int32 thickness) Draw a single Curve
object.

* * *

**DrawCurve**(Curve curve,Color color) Draw a single Curve
object.

* * *

**DrawCylinder**(Cylinder cylinder,Color color,Int32 thickness) Draw a
wireframe
cylinder.

* * *

**DrawCylinder**(Cylinder cylinder,Color color) Draw a wireframe
cylinder.

* * *

**DrawDirectionArrow**(Point3d location, Vector3d direction,Color color)

* * *

**DrawDot**(Point3d worldPosition,String text,Color dotColor,Color textColor)
Draw a text dot in world
coordinates.

* * *

**DrawDot**(Point3d worldPosition,String text) Draws a text dot in world
coordinates.

* * *

**DrawDot**(Single screenX,Single screenY,String text,Color dotColor,Color
textColor) Draws a text dot in screen
coordinates.

* * *

**DrawDot**(Single screenX,Single screenY,String text) Draws a text dot in
screen
coordinates.

* * *

**DrawDot**(TextDot dot,Color fillColor,Color textColor,Color borderColor)
Draw a text dot as defined by the text dot
class

* * *

**DrawDottedLine**(Line line,Color color) Draws a single dotted
line.

* * *

**DrawDottedLine**(Point3d from, Point3d to,Color color) Draws a single
dotted
line.

* * *

**DrawDottedPolyline**(IEnumerable<Point3d> points,Color color,Boolean close)
Draws a set of connected lines (polyline) in a dotted pattern
(0x00001111).

* * *

**DraweInferencePoint**(Point3d P, Color color) Draw inference point used in
gesture based
snapping

* * *

**DrawExtrusionWires**(Extrusion extrusion,Color color,Int32 wireDensity)
Draws all the wireframe curves of an extrusion
object.

* * *

**DrawExtrusionWires**(Extrusion extrusion,Color color) Draws all the
wireframe curves of an extrusion
object.

* * *

**DrawGradientHatch**(Hatch hatch, IEnumerable<ColorStop> stops, Point3d
point1, Point3d point2,Boolean linearGradient,Single repeat, DisplayPen
boundary,Color backgroundFillColor)

* * *

**DrawGradientHatch**(Hatch hatch, IEnumerable<ColorStop> stops, Point3d
point1, Point3d point2,Boolean linearGradient,Single repeat,Single
boundaryThickness,Color boundaryColor)

* * *

**DrawGradientHatch**(Hatch hatch,Color color1,Color color2, Point3d point1,
Point3d point2,Boolean linearGradient,Single boundaryThickness,Color
boundaryColor) Draw a two point gradient filled
hatch

* * *

**DrawGradientLines**(IEnumerable<Line> lines,Single strokeWidth,
IEnumerable<ColorStop> stops, Point3d point1, Point3d point2,Boolean
linearGradient,Single repeat)

* * *

**DrawGradientMesh**(Mesh mesh, IEnumerable<ColorStop> stops, Point3d point1,
Point3d point2,Boolean linearGradient,Single repeat)

* * *

**DrawHatch**(Hatch hatch,Color hatchColor, DisplayPen boundary,Color
backgroundFillColor)

* * *

**DrawHatch**(Hatch hatch,Color hatchColor,Color boundaryColor)

* * *

**DrawInferenceLine**(Point3d P, Point3d O, Color color, InferenceLineType
type) Draw an inference line used in gesture based
snapping

* * *

**DrawInstanceDefinition**(InstanceDefinition instanceDefinition, Transform
xform) Draws an <b>DocObjects.InstanceDefinition</b>
.

* * *

**DrawInstanceDefinition**(InstanceDefinition instanceDefinition) Draws an
<b>DocObjects.InstanceDefinition</b>
.

* * *

**DrawLight**(Light light,Color wireframeColor) Draws a
light.

* * *

**DrawLine**(Line line, DisplayPen pen)

* * *

**DrawLine**(Line line,Color color,Int32 thickness) Draws a single line
object.

* * *

**DrawLine**(Line line,Color color) Draws a single line
object.

* * *

**DrawLine**(Point3d from, Point3d to,Color color,Int32 thickness) Draws a
single line
object.

* * *

**DrawLine**(Point3d from, Point3d to,Color color) Draws a single line
object.

* * *

**DrawLineArrow**(Line line,Color color,Int32 thickness,Double size) Draws an
arrow made up of three line
segments.

* * *

**DrawLineNoClip**(Point3d from, Point3d to,Color color,Int32 thickness)
Draws a single line object .This version of line drawing will draw the
segments of the line that extend beyond the near and far planes of the view
frustum with depths on those
planes

* * *

[**DrawLines**(IEnumerable<Line> lines,Color color,Int32 thickness) Draws a
set of lines with a given color and thickness. If you want the fastest
possible set of lines to be drawn, pass a Line[] for
lines.](/api/rhinocommon/rhino.display.displaypipeline/drawlines#\(ienumerable<line>,color,int32\))

* * *

[**DrawLines**(IEnumerable<Line> lines,Color color) Draws a set of lines with
a given color and thickness. If you want the fastest possible set of lines to
be drawn, pass a Line[] for
lines.](/api/rhinocommon/rhino.display.displaypipeline/drawlines#\(ienumerable<line>,color\))

* * *

[**DrawLines**(Line[] lines, DisplayPen pen)
](/api/rhinocommon/rhino.display.displaypipeline/drawlines#\(line\[\],displaypen\))

* * *

**DrawLinesNoClip**(IEnumerable<Line> lines,Color color,Int32 thickness)
Draws a multiple lines. This version of line drawing will draw the segments of
the line that extend beyond the near and far planes of the view frustum with
depths on those
planes

* * *

**DrawMarker**(Point3d tip, Vector3d direction,Color color,Int32
thickness,Double size,Double rotation) Draws an arrow marker as a view-aligned
widget.

* * *

**DrawMarker**(Point3d tip, Vector3d direction,Color color,Int32
thickness,Double size) Draws an arrow marker as a view-aligned
widget.

* * *

**DrawMarker**(Point3d tip, Vector3d direction,Color color,Int32 thickness)
Draws an arrow marker as a view-aligned
widget.

* * *

**DrawMarker**(Point3d tip, Vector3d direction,Color color) Draws an arrow
marker as a view-aligned
widget.

* * *

**DrawMeshFalseColors**(Mesh mesh) Draws the mesh faces as False color
patches. The mesh must have Vertex Colors defined for this to
work.

* * *

**DrawMeshShaded**(Mesh mesh, DisplayMaterial material, IEnumerable<int>
faceIndices) Draws the shaded faces of a given
mesh.

* * *

[**DrawMeshShaded**(Mesh mesh, DisplayMaterial material,Int32[] faceIndices)
Draws the shaded faces of a given
mesh.](/api/rhinocommon/rhino.display.displaypipeline/drawmeshshaded#\(mesh,displaymaterial,int32\[\]\))

* * *

**DrawMeshShaded**(Mesh mesh, DisplayMaterial material) Draws the shaded
faces of a given
mesh.

* * *

**DrawMeshVertices**(Mesh mesh,Color color) Draws all the vertices in a given
mesh.

* * *

**DrawMeshWires**(Mesh mesh,Color color,Int32 thickness) Draws all the wires
in a given
mesh.

* * *

**DrawMeshWires**(Mesh mesh,Color color) Draws all the wires in a given
mesh.

* * *

**DrawObject**(RhinoObject rhinoObject, Transform xform) Draws a
<b>DocObjects.RhinoObject</b> with an applied
transformation.

* * *

**DrawObject**(RhinoObject rhinoObject) Draws a <b>DocObjects.RhinoObject</b>
.

* * *

**DrawParticles**(ParticleSystem particles, DisplayBitmap bitmap)

* * *

[**DrawParticles**(ParticleSystem particles, DisplayBitmap[] bitmaps)
](/api/rhinocommon/rhino.display.displaypipeline/drawparticles#\(particlesystem,displaybitmap\[\]\))

* * *

**DrawParticles**(ParticleSystem particles)

* * *

**DrawPatternedLine**(Line line,Color color,Int32 pattern,Int32 thickness)
Draws a single line with specified
pattern.

* * *

**DrawPatternedLine**(Point3d from, Point3d to,Color color,Int32
pattern,Int32 thickness) Draws a single line with specified
pattern.

* * *

**DrawPatternedPolyline**(IEnumerable<Point3d> points,Color color,Int32
pattern,Int32 thickness,Boolean close) Draws a set of connected lines
(polyline) with specified
pattern.

* * *

**DrawPoint**(Point3d point, PointStyle style,Color strokeColor,Color
fillColor,Single radius,Single strokeWidth,Single secondarySize,Single
rotationRadians,Boolean diameterIsInPixels,Boolean autoScaleForDpi)

* * *

**DrawPoint**(Point3d point, PointStyle style,Int32 radius,Color color) Draws
a point with a given radius, style and
color.

* * *

**DrawPoint**(Point3d point, PointStyle style,Single radius,Color color)
Draws a point with a given radius, style and
color.

* * *

**DrawPoint**(Point3d point,Color color) Draws a point with a given radius,
style and
color.

* * *

**DrawPoint**(Point3d point) Draws a point using the current display
attribute size, style and
color

* * *

**DrawPointCloud**(PointCloud cloud,Int32 size,Color color) Draws a point
cloud.

* * *

**DrawPointCloud**(PointCloud cloud,Int32 size) Draws a point
cloud.

* * *

**DrawPointCloud**(PointCloud cloud,Single size,Color color) Draws a point
cloud.

* * *

**DrawPointCloud**(PointCloud cloud,Single size) Draws a point
cloud.

* * *

**DrawPoints**(DisplayPointSet points, DisplayPointAttributes
fallbackAttributes, DisplayPointAttributes overrideAttributes)

* * *

**DrawPoints**(DisplayPointSet points)

* * *

**DrawPoints**(IEnumerable<Point3d> points, PointStyle style,Color
strokeColor,Color fillColor,Single radius,Single strokeWidth,Single
secondarySize,Single rotationRadians,Boolean diameterIsInPixels,Boolean
autoScaleForDpi)

* * *

**DrawPoints**(IEnumerable<Point3d> points, PointStyle style,Int32
radius,Color color) Draw a set of points with a given radius, style and
color.

* * *

**DrawPoints**(IEnumerable<Point3d> points, PointStyle style,Single
radius,Color color) Draw a set of points with a given radius, style and
color.

* * *

**DrawPolygon**(IEnumerable<Point3d> points,Color color,Boolean filled) Draws
a filled, convex polygon from a collection of
points.

* * *

**DrawPolyline**(IEnumerable<Point3d> polyline,Color color,Int32 thickness)
Draws a single Polyline
object.

* * *

**DrawPolyline**(IEnumerable<Point3d> polyline,Color color) Draws a single
Polyline
object.

* * *

**DrawRoundedRectangle**(PointF center,Single pixelWidth,Single
pixelHeight,Single cornerRadius,Color strokeColor,Single strokeWidth,Color
fillColor)

* * *

**DrawSphere**(Sphere sphere,Color color,Int32 thickness) Draw a wireframe
sphere.

* * *

**DrawSphere**(Sphere sphere,Color color) Draw a wireframe
sphere.

* * *

**DrawSprite**(DisplayBitmap bitmap, Point2d screenLocation,Single size,Color
blendColor)

* * *

**DrawSprite**(DisplayBitmap bitmap, Point2d screenLocation,Single size)

* * *

**DrawSprite**(DisplayBitmap bitmap, Point2d screenLocation,Single
width,Single height) Draw screen oriented image centered at 2d screen
location

* * *

**DrawSprite**(DisplayBitmap bitmap, Point3d worldLocation,Single
size,Boolean sizeInWorldSpace)

* * *

**DrawSprite**(DisplayBitmap bitmap, Point3d worldLocation,Single size,Color
blendColor,Boolean sizeInWorldSpace)

* * *

**DrawSprites**(DisplayBitmap bitmap, DisplayBitmapDrawList items,Single
size,Boolean sizeInWorldSpace)

* * *

**DrawSprites**(DisplayBitmap bitmap, DisplayBitmapDrawList items,Single
size, Vector3d translation,Boolean sizeInWorldSpace)

* * *

**DrawStereoFrameBuffer**(ViewportInfo viewportLeft,ViewportInfo
viewportRight,UInt32 handleLeft,UInt32 handleRight) Draws the viewport as seen
from the left and the right eye viewports and returns the result as OpenGL
texture
handles.

* * *

**DrawSubDShaded**(SubD subd, DisplayMaterial material) Draw a shaded mesh
representation of a
SubD

* * *

**DrawSubDWires**(SubD subd, DisplayPen boundaryPen, DisplayPen
smoothInteriorPen, DisplayPen creasePen, DisplayPen nonmanifoldPen) Draws all
the wireframe curves os a SubD object using different
pens

* * *

**DrawSubDWires**(SubD subd,Color color,Single thickness) Draws all the
wireframe curves of a SubD
object

* * *

**DrawSurface**(Surface surface,Color wireColor,Int32 wireDensity) Draw
wireframe display for a single
surface.

* * *

**DrawText**(TextEntity text,Color color,Double scale)

* * *

**DrawText**(TextEntity text,Color color, Transform xform)

* * *

**DrawText**(TextEntity text,Color color)

* * *

**DrawToBitmap**(RhinoViewport viewport,Int32 width,Int32 height) Draw a
given viewport to an off-screen
bitmap.

* * *

**DrawTorus**(Torus torus,Color color,Int32 thickness) Draw a wireframe
torus.

* * *

**DrawTorus**(Torus torus,Color color) Draw a wireframe
torus.

* * *

**DrawZebraPreview**(Brep brep,Color color) Draws a shaded Brep with Zebra
stripe
preview.

* * *

**DrawZebraPreview**(Mesh mesh,Color color) Draws a shaded Mesh with Zebra
stripe
preview.

* * *

**EnableClippingPlanes**(Boolean enable) Enable or disable the Clipping Plane
logic of the
engine.

* * *

**EnableColorWriting**(Boolean enable) Enable or disable the ColorWriting
behavior of the
engine.

* * *

**EnableDepthTesting**(Boolean enable) Enable or disable the DepthTesting
behavior of the engine. When DepthTesting is disabled, objects in front will
no longer occlude objects behind
them.

* * *

**EnableDepthWriting**(Boolean enable) Enable or disable the DepthWriting
behavior of the engine. When DepthWriting is disabled, drawn geometry does not
affect the
Z-Buffer.

* * *

**EnableLighting**(Boolean enable) Enable or disable the Lighting logic of
the
engine.

* * *

**Flush**() Force the pipeline to immediately flush any cached geometry to
the display

* * *

**GetDrawListSerialNumbers**(UInt32 modelSerialNumber,UInt32
pageSerialNumber) Gets the current model and page view draw list serial
numbers, which can be used to determine if a model or page view needs to be
redrawn.

* * *

**GetLights**() Get lights that this pipeline is current
using

* * *

**GetOpenGLCameraToClip**() Get an array of 16 floats that represents the
"camera" to "clip" coordinate transformation in OpenGL's right handed
coordinate
system

* * *

**GetOpenGLWorldToCamera**(Boolean includeModelTransform) Get an array of 16
floats that represents the "world" to "camera" coordinate transformation in
OpenGL's right handed coordinate
system

* * *

**GetOpenGLWorldToClip**(Boolean includeModelTransform) Get an array of 16
floats that represents the "world" to "clip" coordinate transformation in
OpenGL's right handed coordinate
system

* * *

**InterruptDrawing**() Tests to see if the pipeline should stop drawing more
geometry and just show what it has so far. If a drawing operation is taking a
long time, this function will return True and tell Rhino it should just finish
up and show the frame buffer. This is used in dynamic drawing
operations.

* * *

**IsActive**(RhinoObject rhinoObject) Determines if an object can be visible
in this viewport based on it's object type and display attributes. This test
does not check for visibility based on location of the object. NOTE: Use
CRhinoDisplayPipeline::IsVisible() to perform "visibility" tests based on
location (is some part of the object in the view frustum). Use
CRhinoDisplayPipeline::IsActive() to perform "visibility" tests based on
object
type.

* * *

**IsInTiledDraw**(Size fullSize,Rectangle currentTile) Returns True if the
currently drawn frame is part of a tiled capture. Tiled captures are performed
when creating large raster
outputs.

* * *

**IsVisible**(BoundingBox bbox) Test a given box for visibility inside the
view frustum under the current viewport and model transformation
settings.

* * *

**IsVisible**(RhinoObject rhinoObject) Test a given object for visibility
inside the view frustum under the current viewport and model transformation
settings. This function calls a virtual IsVisibleFinal function that sub-
classed pipelines can add extra tests to. In the base class, this test only
tests visibility based on the objects world coordinates location and does not
pay attention to the object's attributes. NOTE: Use
CRhinoDisplayPipeline::IsVisible() to perform "visibility" tests based on
location (is some part of the object in the view frustum). Use
CRhinoDisplayPipeline::IsActive() to perform "visibility" tests based on
object
type.

* * *

**IsVisible**(Point3d worldCoordinate) Test a given 3d world coordinate point
for visibility inside the view frustum under the current viewport and model
transformation
settings.

* * *

**MakeDefaultOpenGLContextCurrent**() Make a "default" OpenGL context
current

* * *

**Measure2dText**(String text, Point2d definitionPoint,Boolean
middleJustified,Double rotationRadians,Int32 height,String fontFace)
Determines screen rectangle that would be drawn to using the Draw2dText(..)
function with the same
parameters.

* * *

**Open**() Opens the
pipeline.

* * *

**PopClipTesting**() __ Pop a ClipTesting flag off the engine's
stack.

* * *

**PopCullFaceMode**() Pop a FaceCull flag off the engine's
stack.

* * *

**PopDepthTesting**() Pop a DepthTesting flag off the engine's
stack.

* * *

**PopDepthWriting**() Pop a DepthWriting flag off the engine's
stack.

* * *

**PopModelTransform**() Pop a model transformation off the engine's model
transform
stack.

* * *

**PopProjection**() Pop a view projection off this pipelines projection
stack

* * *

**Push2dProjection**() Push the current view projection and set the viewport
up to be a simple 2D top projection where the camera frustum matches the same
size as the screen port. This allows geometry draw functions to act like they
are working with typical 2d graphics APIs on a
window

* * *

**PushClipTesting**(Boolean enable) __ Push a ClipTesting flag on the
engine's
stack.

* * *

**PushCullFaceMode**(CullFaceMode mode) Push a FaceCull flag on the engine's
stack.

* * *

**PushDepthTesting**(Boolean enable) Push a DepthTesting flag on the engine's
stack.

* * *

**PushDepthWriting**(Boolean enable) Push a DepthWriting flag on the engine's
stack.

* * *

**PushModelTransform**(Transform xform) Push a model transformation on the
engine's model transform
stack.

* * *

**RemoveClippingPlane**(Int32 index) Remove a clipping plane from the
pipeline for this
frame

* * *

**SetupDisplayMaterial**(RhinoDoc doc, RhinoObject rhinoObject,
ObjectAttributes attributes, Transform instanceTransform) Sets up a display
material.

* * *

**SetupDisplayMaterial**(RhinoDoc doc, RhinoObject rhinoObject,
ObjectAttributes attributes) Sets up a display
material.

* * *

**SetupDisplayMaterial**(RhinoDoc doc, RhinoObject rhinoObject) Sets up a
display
material.

* * *

**SetupDisplayMaterial**(Color color)

* * *

_keyboard_arrow_down_

Events (13)

**CalculateBoundingBox**

* * *

**CalculateBoundingBoxZoomExtents** Calculate a bounding to include in the
Zoom Extents
command.

* * *

**DisplayModeChanged**

* * *

**DrawForeground** Called after all non-highlighted objects have been drawn
and PostDrawObjects has been called. Depth writing and testing are turned OFF.
If you want to draw with depth writing/testing, see
PostDrawObjects.

* * *

**DrawOverlay** If Rhino is in a feedback mode, the draw overlay call allows
for temporary geometry to be drawn on top of everything in the scene. This is
similar to the dynamic draw routine that occurs with custom get
point.

* * *

**InitFrameBuffer**

* * *

**ObjectCulling**

* * *

**PostDrawObject** Called right after an individual object has been drawn.
NOTE: Do not use this event unless you absolutely need to. It is called for
every object in the document and can slow display down if a large number of
objects exist in the
document

* * *

**PostDrawObjects** Called after all non-highlighted objects have been drawn.
Depth writing and testing are still turned on. If you want to draw without
depth writing/testing, see
DrawForeground.

* * *

**PreDrawObject** Called right before an individual object is being drawn.
NOTE: Do not use this event unless you absolutely need to. It is called for
every object in the document and can slow display down if a large number of
objects exist in the
document

* * *

**PreDrawObjects** Called before objects are been drawn. Depth writing and
testing are
on.

* * *

**PreDrawTransparentObjects** Called before transparent objects have been
drawn. Depth writing and testing are
on.

* * *

**ViewportProjectionChanged** Called when the projection changes for a
viewport being
drawn.

* * *