---
url: https://developer.rhino3d.com/api/rhinocommon/rhino.commands.command
scraped_at: 2025-09-08T16:05:15.500757
title: Untitled
---

_home_

/

Rhino.Commands

/

Command

# Command class

Defines a base class for all commands. This class is abstract.

_Derived Classes:__SelCommand
_,___TransformCommand_

 _Namespace:Rhino.Commands_
 _Command:references_

 _keyboard_arrow_down_

Constructors (1)

**Command**() Default protected constructor. It only allows instantiation
through sub-classing.

* * *

_keyboard_arrow_down_

Properties (8)

**CommandContextHelpUrl** Gets the URL of the command contextual help. This
is usually a location of a local CHM file.
The default implementation return an empty
string.

* * *

**EnglishName** Gets the name of the command. This method is
abstract.

* * *

**Id** Gets the unique ID of this command. It is best to use a Guid attribute
for each custom derived command class since this will keep the id consistent
between sessions of Rhino
<b>System.Runtime.InteropServices.GuidAttribute</b>

* * *

**LastCommandId** Gets the ID of the last
commands.

* * *

**LastCommandResult** Gets the result code of the last
command.

* * *

**LocalName** Gets the local name of the
command.

* * *

**PlugIn** Gets the plug-in where this commands is
placed.

* * *

**Settings** Gets the settings of the
command.

* * *

_keyboard_arrow_down_

Methods (15)

**DisplayHelp**(Guid commandId) Displays help for a
command.

* * *

**GetCommandContextHelpUrl**(Guid commandId) Returns a command's context help
url.

* * *

**GetCommandNames**(Boolean english,Boolean loaded) Gets list of command
names in Rhino. This list does not include Test, Alpha, or System
commands.

* * *

**GetCommandStack**() Determines if Rhino is currently running a command.
Because Rhino allow for transparent commands (commands that can be run from
inside of other commands), this method returns the total ids of active
commands.

* * *

**GetMostRecentCommands**() Gets an array of most recent command
descriptions.

* * *

**InCommand**() Determines if Rhino is currently running a
command.

* * *

**InScriptRunnerCommand**() This is a low level tool to determine if Rhino is
currently running a script running command like "ReadCommandFile" or the
RhinoScript plug-in's
"RunScript".

* * *

**IsCommand**(String name) Determines is a string is a
command.

* * *

**IsValidCommandName**(String name) Determines if a string is a valid command
name.

* * *

**LookupCommandId**(String name,Boolean searchForEnglishName) Returns the ID
of a
command.

* * *

**LookupCommandName**(Guid commandId,Boolean englishName) Returns the command
name given a command
ID.

* * *

**OnHelp**() ____ Is called when the user needs assistance with this
command.

* * *

**ReplayHistory**(ReplayHistoryData replayData) ____ Repeats an operation of
a command.
In order to make this function work, you will likely need to grab the Result
property that gives the list of input objects. Then, you will be able to
replace these inputs by using one of the UpdateToX() methods of the
ReplayHistoryResult.
You should NOT use any document AddX() or ReplaceX() functions, as they will
break
history.

* * *

**RunCommand**(RhinoDoc doc, RunMode mode) __ Executes the
command.

* * *

**RunProxyCommand**(RunCommandDelegate commandCallback, RhinoDoc doc,Object
data) Execute some code as if it were running in a
command

* * *

 _keyboard_arrow_down_

Events (3)

**BeginCommand** Called just before
command.RunCommand().

* * *

**EndCommand** Called immediately after
command.RunCommand().

* * *

**UndoRedo** Used to monitor Rhino's built in undo/redo
support.

* * *