---
url: https://developer.rhino3d.com/api/rhinocommon/rhino.geometry.point3d
scraped_at: 2025-09-08T16:06:50.590471
title: Untitled
---

_home_

/

Rhino.Geometry

/

Point3d

# Point3d struct

Represents the three coordinates of a point in three-dimensional space, using
**double** -precision floating point values.

_Derived Classes:_

_Namespace:Rhino.Geometry_
 _Point3d:references_

 _keyboard_arrow_down_

Constructors (5)

**Point3d**(double x, double y, double z) Initializes a new point by defining
the X, Y and Z
coordinates.

* * *

**Point3d**(Point3d point) Initializes a new point by copying coordinates
from another
point.

* * *

**Point3d**(Point3f point) Initializes a new point by copying coordinates
from a single-precision
point.

* * *

**Point3d**(Point4d point) Initializes a new point by copying coordinates
from a four-dimensional point. The first three coordinates are divided by the
last one. If the W (fourth) dimension of the input point is zero, then it will
be just
discarded.

* * *

**Point3d**(Vector3d vector) Initializes a new point by copying coordinates
from the components of a
vector.

* * *

_keyboard_arrow_down_

Properties (9)

**IsValid** Each coordinate of the point must pass the
<b>RhinoMath.IsValidDouble</b>
test.

* * *

**Item** Gets or sets an indexed coordinate of this
point.

* * *

**MaximumCoordinate** Gets the largest (both positive and negative) valid
coordinate in this point, or RhinoMath.UnsetValue if no coordinate is valid,
as an absolute
value.

* * *

**MinimumCoordinate** Gets the smallest (both positive and negative)
coordinate value in this
point.

* * *

**Origin** Gets the value of a point at location
0,0,0.

* * *

**Unset** Gets the value of a point at location
RhinoMath.UnsetValue,RhinoMath.UnsetValue,RhinoMath.UnsetValue.

* * *

**X** Gets or sets the X (first) coordinate of this
point.

* * *

**Y** Gets or sets the Y (second) coordinate of this
point.

* * *

**Z** Gets or sets the Z (third) coordinate of this
point.

* * *

_keyboard_arrow_down_

Methods (25)

**Add**(Point3d point, Vector3d vector) Sums up a point and a vector, and
returns a new point.
(Provided for languages that do not support operator overloading. You can use
the + operator
otherwise)

* * *

**Add**(Point3d point, Vector3f vector) Sums up a point and a vector, and
returns a new point.
(Provided for languages that do not support operator overloading. You can use
the + operator
otherwise)

* * *

**Add**(Point3d point1, Point3d point2) Sums two <b>Point3d</b> instances.
(Provided for languages that do not support operator overloading. You can use
the + operator
otherwise)

* * *

**Add**(Vector3d vector, Point3d point) Sums up a point and a vector, and
returns a new point.
(Provided for languages that do not support operator overloading. You can use
the + operator
otherwise)

* * *

**ArePointsCoplanar**(IEnumerable<Point3d> points,Double tolerance)
Determines whether a set of points is coplanar within a given
tolerance.

* * *

**CompareTo**(Point3d other) Compares this <b>Point3d</b> with another
<b>Point3d</b> .
Component evaluation priority is first X, then Y, then
Z.

* * *

**CullDuplicates**(IEnumerable<Point3d> points,Double tolerance) Removes
duplicates in the supplied set of
points.

* * *

**DistanceTo**(Point3d other) Computes the distance between two
points.

* * *

**DistanceToSquared**(Point3d other) Computes the square of the distance
between two points.
This method is usually largely faster than
DistanceTo().

* * *

**Divide**(Point3d point,Double t) Divides a <b>Point3d</b> by a number.
(Provided for languages that do not support operator overloading. You can use
the / operator
otherwise)

* * *

**EpsilonEquals**(Point3d other,Double epsilon) Check that all values in
other are within epsilon of the values in
this

* * *

**Equals**(Point3d point) Determines whether the specified <b>Point3d</b> has
the same values as the present
point.

* * *

**Equals**(Object obj) Determines whether the specified <b>object</b> is a
<b>Point3d</b> and has the same values as the present
point.

* * *

**FromPoint3f**(Point3f point) Converts a single-precision point in a double-
precision
point.

* * *

**GetHashCode**() Computes a hash code for the present
point.

* * *

**Interpolate**(Point3d pA, Point3d pB,Double t) Interpolate between two
points.

* * *

**Multiply**(Point3d point,Double t) Multiplies a <b>Point3d</b> by a number.
(Provided for languages that do not support operator overloading. You can use
the * operator
otherwise)

* * *

**Multiply**(Double t, Point3d point) Multiplies a <b>Point3d</b> by a
number.
(Provided for languages that do not support operator overloading. You can use
the * operator
otherwise)

* * *

**SortAndCullPointList**(IEnumerable<Point3d> points,Double minimumDistance)
Orders a set of points so they will be connected in a "reasonable polyline"
order.
Also, removes points from the list if their common distance exceeds a
specified
threshold.

* * *

**Subtract**(Point3d point, Vector3d vector) Subtracts a vector from a point.
(Provided for languages that do not support operator overloading. You can use
the - operator
otherwise)

* * *

**Subtract**(Point3d point1, Point3d point2) Subtracts a point from another
point.
(Provided for languages that do not support operator overloading. You can use
the - operator
otherwise)

* * *

**ToString**() Constructs the string representation for the current
point.

* * *

**ToString**(String format,IFormatProvider formatProvider)

* * *

**Transform**(Transform xform) Transforms the present point in place. The
transformation matrix acts on the left of the point. i.e.,
result =
transformation*point

* * *

**TryParse**(String input, out Point3d result) Converts the string
representation of a point to the equivalent Point3d
structure.

* * *

_keyboard_arrow_down_

Operators (16)

**-** __ Subtracts a vector from a
point.

* * *

**-** __ Computes the additive inverse of all coordinates in the point, and
returns the new point.

* * *

**-** __ Subtracts a point from another
point.

* * *

**!=** __ Determines whether two Point3d have different
values.

* * *

***** __ Multiplies a <b>Point3d</b> by a
number.

* * *

***** __ Multiplies a <b>Point3d</b> by a
number.

* * *

**/** __ Divides a <b>Point3d</b> by a
number.

* * *

**+** __ Sums up a point and a vector, and returns a new
point.

* * *

**+** __ Sums up a point and a vector, and returns a new
point.

* * *

**+** __ Sums two <b>Point3d</b>
instances.

* * *

**+** __ Sums up a point and a vector, and returns a new
point.

* * *

**<** __ Determines whether the first specified point comes before (has
inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then
Z.

* * *

**< =** __ Determines whether the first specified point comes before (has
inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then
Z.

* * *

**==** __ Determines whether two Point3d have equal
values.

* * *

**>** __ Determines whether the first specified point comes after (has
superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then
Z.

* * *

**> =** __ Determines whether the first specified point comes after (has
superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then
Z.

* * *