---
url: https://developer.rhino3d.com/guides/grasshopper/what-is-a-grasshopper-component/
scraped_at: 2025-09-08T15:41:18.993790
title: Untitled
---

RhinoDeveloper®

design, model, present, analyze, realize...

__

Guides
Samples
API
Videos
Community [my account
](https://www.rhino3d.com/my-account/ "Manage your account, licenses, and
teams")

[What is a Grasshopper
Component?](https://developer.rhino3d.com/guides/grasshopper/what-is-a-
grasshopper-component/)

  * Rhino Plugin Architecture
  * .NET Component Library
  * Assembly References
  * Related topics

Guides / Grasshopper
Guides /

What is a Grasshopper Component?

by David Rutten (Last updated:
Wednesday, December 5, 2018)

This guide also explains the hierarchy of all assemblies involved with the
Grasshopper plugin. This is important for component developers so they know
which Assembly References they need to have in order to compile a Grasshopper
Component Library. It also provides some background information which is
useful when communicating with other developers.

## Rhino Plugin Architecture

Grasshopper is a .NET
([RhinoCommon](https://developer.rhino3d.com/guides/rhinocommon/what-is-
rhinocommon/)) plugin for Rhino 6 for Windows and later ([a version for Rhino
5 for Mac is currently in beta](http://www.grasshopper3d.com/page/grasshopper-
for-mac)). It was written using Microsoft Visual Studio Professional using
both VB.NET and C# source compiled against the .NET Framework. It is
recommended, though not required, that you target the same framework when
developing Grasshopper Component Libraries.

Our aim is to keep Grasshopper dependencies as conservative as possible.
However, it is possible that we will switch to a higher version number of
Rhino or .NET if this new version fixes crucial bugs or exposes useful
functions.

## .NET Component Library

The Grasshopper project type is _Class Library_ , meaning it cannot be run as
a stand-alone application. _Grasshopper.dll_ is loaded by a Rhino
plugin
called _GrasshopperPlugin.rhp_.

## Assembly References

As a Class Library, Grasshopper references namespaces in addition to
_RhinoCommon.dll_ , some of these are standard namespaces provided by the .NET
Framework, others are 3rd-party assemblies and others still are written by
McNeel developers but are shipped separately for technical reasons. Some of
these assemblies need to be referenced by Component developers, while others
can be safely ignored. The following table lists all assemblies referenced by
_Grasshopper.dll_ :

Assembly | Author | Purpose | Required
---|---|---|---
_RhinoCommon.dll_ | McNeel | Rhinoceros .NET SDK | Yes
_GH_IO.dll_ | McNeel | Grasshopper Input/Output library required to read and write Grasshopper files. | Yes
_GH_Util.dll_ | McNeel | Grasshopper utility library containing some peripheral algorithms. | Optional
_QWhale.*.dll_ | Quantum Whale | Syntax highlighter functionality. Contains a total of 5 dlls. | Optional
_System_ | Microsoft | Base .NET Namespace. | Yes
_System.Drawing_ | Microsoft | .NET namespace involved with drawing shapes and text. | Yes
_System.Windows.Forms_ | Microsoft | .NET namespace involved with dialogs and controls. | Yes
_System.Collections.Generic_ | Microsoft | .NET namespace containing useful list classes. | Yes

## Related topics

  * Developer Prerequities
  * What is a Rhino Plugin?
  * What is RhinoCommon?
  * Your First Component

Edit this page

[ Edit on
GitHub](https://github.com/mcneel/developer.rhino3d.com/edit/master/content/en/guides/grasshopper/what-
is-a-grasshopper-component/index.md) [
History](https://github.com/mcneel/developer.rhino3d.com/commits/master/content/en/guides/grasshopper/what-
is-a-grasshopper-component/index.md)
Admin

Find a Reseller

Shop online or find a
Reseller

Find a Reseller

Privacy Policy •
About • Contact
Us • [
Language](https://www.rhino3d.com/language "Change to a different region or
language")

Copyright © 1993-2025 Robert McNeel & Associates. All Rights
Reserved.

[!Blogger
icon](http://blog.rhino3d.com/)